/* automatically generated by rust-bindgen 0.72.1 */

#![allow(
    dead_code,
    non_upper_case_globals,
    non_camel_case_types,
    non_snake_case,
    unused_imports
)]

#[derive(PartialEq, Copy, Clone, Hash, Debug, Default)]
#[repr(C)]
pub struct __BindgenComplex<T> {
    pub re: T,
    pub im: T,
}
pub const _FEATURES_H: u32 = 1;
pub const _DEFAULT_SOURCE: u32 = 1;
pub const __GLIBC_USE_ISOC2Y: u32 = 0;
pub const __GLIBC_USE_ISOC23: u32 = 0;
pub const __USE_ISOC11: u32 = 1;
pub const __USE_ISOC99: u32 = 1;
pub const __USE_ISOC95: u32 = 1;
pub const __USE_POSIX_IMPLICITLY: u32 = 1;
pub const _POSIX_SOURCE: u32 = 1;
pub const _POSIX_C_SOURCE: u32 = 200809;
pub const __USE_POSIX: u32 = 1;
pub const __USE_POSIX2: u32 = 1;
pub const __USE_POSIX199309: u32 = 1;
pub const __USE_POSIX199506: u32 = 1;
pub const __USE_XOPEN2K: u32 = 1;
pub const __USE_XOPEN2K8: u32 = 1;
pub const _ATFILE_SOURCE: u32 = 1;
pub const __WORDSIZE: u32 = 64;
pub const __WORDSIZE_TIME64_COMPAT32: u32 = 1;
pub const __SYSCALL_WORDSIZE: u32 = 64;
pub const __TIMESIZE: u32 = 64;
pub const __USE_TIME_BITS64: u32 = 1;
pub const __USE_MISC: u32 = 1;
pub const __USE_ATFILE: u32 = 1;
pub const __USE_FORTIFY_LEVEL: u32 = 0;
pub const __GLIBC_USE_DEPRECATED_GETS: u32 = 0;
pub const __GLIBC_USE_DEPRECATED_SCANF: u32 = 0;
pub const __GLIBC_USE_C23_STRTOL: u32 = 0;
pub const _STDC_PREDEF_H: u32 = 1;
pub const __STDC_IEC_559__: u32 = 1;
pub const __STDC_IEC_60559_BFP__: u32 = 201404;

pub const INT32_MIN: i32 = -2147483648;
pub const INT8_MAX: u32 = 127;
pub const INT16_MAX: u32 = 32767;
pub const INT32_MAX: u32 = 2147483647;
pub const UINT8_MAX: u32 = 255;
pub const UINT16_MAX: u32 = 65535;
pub const UINT32_MAX: u32 = 4294967295;
pub const INT_LEAST8_MIN: i32 = -128;
pub const INT_LEAST16_MIN: i32 = -32768;
pub const INT_LEAST32_MIN: i32 = -2147483648;
pub const INT_LEAST8_MAX: u32 = 127;
pub const INT_LEAST16_MAX: u32 = 32767;
pub const INT_LEAST32_MAX: u32 = 2147483647;
pub const UINT_LEAST8_MAX: u32 = 255;
pub const UINT_LEAST16_MAX: u32 = 65535;
pub const UINT_LEAST32_MAX: u32 = 4294967295;
pub const INT_FAST8_MIN: i32 = -128;
pub const INT_FAST16_MIN: i64 = -9223372036854775808;
pub const INT_FAST32_MIN: i64 = -9223372036854775808;
pub const INT_FAST8_MAX: u32 = 127;
pub const INT_FAST16_MAX: u64 = 9223372036854775807;
pub const INT_FAST32_MAX: u64 = 9223372036854775807;
pub const UINT_FAST8_MAX: u32 = 255;
pub const UINT_FAST16_MAX: i32 = -1;
pub const UINT_FAST32_MAX: i32 = -1;
pub const INTPTR_MIN: i64 = -9223372036854775808;
pub const INTPTR_MAX: u64 = 9223372036854775807;
pub const UINTPTR_MAX: i32 = -1;
pub const PTRDIFF_MIN: i64 = -9223372036854775808;
pub const PTRDIFF_MAX: u64 = 9223372036854775807;
pub const SIG_ATOMIC_MIN: i32 = -2147483648;
pub const SIG_ATOMIC_MAX: u32 = 2147483647;
pub const SIZE_MAX: i32 = -1;
pub const WINT_MIN: u32 = 0;
pub const WINT_MAX: u32 = 4294967295;
pub const __CUDA_API_VERSION: u32 = 10000;
pub const CUDA_VERSION: u32 = 10000;
pub const CU_IPC_HANDLE_SIZE: u32 = 64;
pub const CU_MEMHOSTALLOC_PORTABLE: u32 = 1;
pub const CU_MEMHOSTALLOC_DEVICEMAP: u32 = 2;
pub const CU_MEMHOSTALLOC_WRITECOMBINED: u32 = 4;
pub const CU_MEMHOSTREGISTER_PORTABLE: u32 = 1;
pub const CU_MEMHOSTREGISTER_DEVICEMAP: u32 = 2;
pub const CU_MEMHOSTREGISTER_IOMEMORY: u32 = 4;
pub const CUDA_EXTERNAL_MEMORY_DEDICATED: u32 = 1;
pub const CUDA_COOPERATIVE_LAUNCH_MULTI_DEVICE_NO_PRE_LAUNCH_SYNC: u32 = 1;
pub const CUDA_COOPERATIVE_LAUNCH_MULTI_DEVICE_NO_POST_LAUNCH_SYNC: u32 = 2;
pub const CUDA_ARRAY3D_LAYERED: u32 = 1;
pub const CUDA_ARRAY3D_2DARRAY: u32 = 1;
pub const CUDA_ARRAY3D_SURFACE_LDST: u32 = 2;
pub const CUDA_ARRAY3D_CUBEMAP: u32 = 4;
pub const CUDA_ARRAY3D_TEXTURE_GATHER: u32 = 8;
pub const CUDA_ARRAY3D_DEPTH_TEXTURE: u32 = 16;
pub const CUDA_ARRAY3D_COLOR_ATTACHMENT: u32 = 32;
pub const CU_TRSA_OVERRIDE_FORMAT: u32 = 1;
pub const CU_TRSF_READ_AS_INTEGER: u32 = 1;
pub const CU_TRSF_NORMALIZED_COORDINATES: u32 = 2;
pub const CU_TRSF_SRGB: u32 = 16;
pub const CU_PARAM_TR_DEFAULT: i32 = -1;
pub type wchar_t = ::std::os::raw::c_int;
pub type __cfloat128 = __BindgenComplex<u128>;
pub type _Float128 = u128;
pub type _Float32 = f32;
pub type _Float64 = f64;
pub type _Float32x = f64;
pub type _Float64x = u128;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct div_t {
    pub quot: ::std::os::raw::c_int,
    pub rem: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of div_t"][::std::mem::size_of::<div_t>() - 8usize];
    ["Alignment of div_t"][::std::mem::align_of::<div_t>() - 4usize];
    ["Offset of field: div_t::quot"][::std::mem::offset_of!(div_t, quot) - 0usize];
    ["Offset of field: div_t::rem"][::std::mem::offset_of!(div_t, rem) - 4usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ldiv_t {
    pub quot: ::std::os::raw::c_long,
    pub rem: ::std::os::raw::c_long,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ldiv_t"][::std::mem::size_of::<ldiv_t>() - 16usize];
    ["Alignment of ldiv_t"][::std::mem::align_of::<ldiv_t>() - 8usize];
    ["Offset of field: ldiv_t::quot"][::std::mem::offset_of!(ldiv_t, quot) - 0usize];
    ["Offset of field: ldiv_t::rem"][::std::mem::offset_of!(ldiv_t, rem) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lldiv_t {
    pub quot: ::std::os::raw::c_longlong,
    pub rem: ::std::os::raw::c_longlong,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of lldiv_t"][::std::mem::size_of::<lldiv_t>() - 16usize];
    ["Alignment of lldiv_t"][::std::mem::align_of::<lldiv_t>() - 8usize];
    ["Offset of field: lldiv_t::quot"][::std::mem::offset_of!(lldiv_t, quot) - 0usize];
    ["Offset of field: lldiv_t::rem"][::std::mem::offset_of!(lldiv_t, rem) - 8usize];
};
unsafe extern "C" {
    pub fn __ctype_get_mb_cur_max() -> usize;
}
unsafe extern "C" {
    pub fn atof(__nptr: *const ::std::os::raw::c_char) -> f64;
}
unsafe extern "C" {
    pub fn atoi(__nptr: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn atol(__nptr: *const ::std::os::raw::c_char) -> ::std::os::raw::c_long;
}
unsafe extern "C" {
    pub fn atoll(__nptr: *const ::std::os::raw::c_char) -> ::std::os::raw::c_longlong;
}
unsafe extern "C" {
    pub fn strtod(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
    ) -> f64;
}
unsafe extern "C" {
    pub fn strtof(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
    ) -> f32;
}
unsafe extern "C" {
    pub fn strtold(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
    ) -> u128;
}
unsafe extern "C" {
    pub fn strtol(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
        __base: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_long;
}
unsafe extern "C" {
    pub fn strtoul(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
        __base: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_ulong;
}
unsafe extern "C" {
    pub fn strtoq(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
        __base: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_longlong;
}
unsafe extern "C" {
    pub fn strtouq(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
        __base: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_ulonglong;
}
unsafe extern "C" {
    pub fn strtoll(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
        __base: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_longlong;
}
unsafe extern "C" {
    pub fn strtoull(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
        __base: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_ulonglong;
}
unsafe extern "C" {
    pub fn l64a(__n: ::std::os::raw::c_long) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn a64l(__s: *const ::std::os::raw::c_char) -> ::std::os::raw::c_long;
}
pub type __u_char = ::std::os::raw::c_uchar;
pub type __u_short = ::std::os::raw::c_ushort;
pub type __u_int = ::std::os::raw::c_uint;
pub type __u_long = ::std::os::raw::c_ulong;
pub type __int8_t = ::std::os::raw::c_schar;
pub type __uint8_t = ::std::os::raw::c_uchar;
pub type __int16_t = ::std::os::raw::c_short;
pub type __uint16_t = ::std::os::raw::c_ushort;
pub type __int32_t = ::std::os::raw::c_int;
pub type __uint32_t = ::std::os::raw::c_uint;
pub type __int64_t = ::std::os::raw::c_long;
pub type __uint64_t = ::std::os::raw::c_ulong;
pub type __int_least8_t = __int8_t;
pub type __uint_least8_t = __uint8_t;
pub type __int_least16_t = __int16_t;
pub type __uint_least16_t = __uint16_t;
pub type __int_least32_t = __int32_t;
pub type __uint_least32_t = __uint32_t;
pub type __int_least64_t = __int64_t;
pub type __uint_least64_t = __uint64_t;
pub type __quad_t = ::std::os::raw::c_long;
pub type __u_quad_t = ::std::os::raw::c_ulong;
pub type __intmax_t = ::std::os::raw::c_long;
pub type __uintmax_t = ::std::os::raw::c_ulong;
pub type __dev_t = ::std::os::raw::c_ulong;
pub type __uid_t = ::std::os::raw::c_uint;
pub type __gid_t = ::std::os::raw::c_uint;
pub type __ino_t = ::std::os::raw::c_ulong;
pub type __ino64_t = ::std::os::raw::c_ulong;
pub type __mode_t = ::std::os::raw::c_uint;
pub type __nlink_t = ::std::os::raw::c_ulong;
pub type __off_t = ::std::os::raw::c_long;
pub type __off64_t = ::std::os::raw::c_long;
pub type __pid_t = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __fsid_t {
    pub __val: [::std::os::raw::c_int; 2usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __fsid_t"][::std::mem::size_of::<__fsid_t>() - 8usize];
    ["Alignment of __fsid_t"][::std::mem::align_of::<__fsid_t>() - 4usize];
    ["Offset of field: __fsid_t::__val"][::std::mem::offset_of!(__fsid_t, __val) - 0usize];
};
pub type __clock_t = ::std::os::raw::c_long;
pub type __rlim_t = ::std::os::raw::c_ulong;
pub type __rlim64_t = ::std::os::raw::c_ulong;
pub type __id_t = ::std::os::raw::c_uint;
pub type __time_t = ::std::os::raw::c_long;
pub type __useconds_t = ::std::os::raw::c_uint;
pub type __suseconds_t = ::std::os::raw::c_long;
pub type __suseconds64_t = ::std::os::raw::c_long;
pub type __daddr_t = ::std::os::raw::c_int;
pub type __key_t = ::std::os::raw::c_int;
pub type __clockid_t = ::std::os::raw::c_int;
pub type __timer_t = *mut ::std::os::raw::c_void;
pub type __blksize_t = ::std::os::raw::c_long;
pub type __blkcnt_t = ::std::os::raw::c_long;
pub type __blkcnt64_t = ::std::os::raw::c_long;
pub type __fsblkcnt_t = ::std::os::raw::c_ulong;
pub type __fsblkcnt64_t = ::std::os::raw::c_ulong;
pub type __fsfilcnt_t = ::std::os::raw::c_ulong;
pub type __fsfilcnt64_t = ::std::os::raw::c_ulong;
pub type __fsword_t = ::std::os::raw::c_long;
pub type __ssize_t = ::std::os::raw::c_long;
pub type __syscall_slong_t = ::std::os::raw::c_long;
pub type __syscall_ulong_t = ::std::os::raw::c_ulong;
pub type __loff_t = __off64_t;
pub type __caddr_t = *mut ::std::os::raw::c_char;
pub type __intptr_t = ::std::os::raw::c_long;
pub type __socklen_t = ::std::os::raw::c_uint;
pub type __sig_atomic_t = ::std::os::raw::c_int;
pub type u_char = __u_char;
pub type u_short = __u_short;
pub type u_int = __u_int;
pub type u_long = __u_long;
pub type quad_t = __quad_t;
pub type u_quad_t = __u_quad_t;
pub type fsid_t = __fsid_t;
pub type loff_t = __loff_t;
pub type ino_t = __ino_t;
pub type dev_t = __dev_t;
pub type gid_t = __gid_t;
pub type mode_t = __mode_t;
pub type nlink_t = __nlink_t;
pub type uid_t = __uid_t;
pub type off_t = __off_t;
pub type pid_t = __pid_t;
pub type id_t = __id_t;
pub type daddr_t = __daddr_t;
pub type caddr_t = __caddr_t;
pub type key_t = __key_t;
pub type clock_t = __clock_t;
pub type clockid_t = __clockid_t;
pub type time_t = __time_t;
pub type timer_t = __timer_t;
pub type ulong = ::std::os::raw::c_ulong;
pub type ushort = ::std::os::raw::c_ushort;
pub type uint = ::std::os::raw::c_uint;
pub type u_int8_t = __uint8_t;
pub type u_int16_t = __uint16_t;
pub type u_int32_t = __uint32_t;
pub type u_int64_t = __uint64_t;
pub type register_t = ::std::os::raw::c_long;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __sigset_t {
    pub __val: [::std::os::raw::c_ulong; 16usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __sigset_t"][::std::mem::size_of::<__sigset_t>() - 128usize];
    ["Alignment of __sigset_t"][::std::mem::align_of::<__sigset_t>() - 8usize];
    ["Offset of field: __sigset_t::__val"][::std::mem::offset_of!(__sigset_t, __val) - 0usize];
};
pub type sigset_t = __sigset_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct timeval {
    pub tv_sec: __time_t,
    pub tv_usec: __suseconds_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of timeval"][::std::mem::size_of::<timeval>() - 16usize];
    ["Alignment of timeval"][::std::mem::align_of::<timeval>() - 8usize];
    ["Offset of field: timeval::tv_sec"][::std::mem::offset_of!(timeval, tv_sec) - 0usize];
    ["Offset of field: timeval::tv_usec"][::std::mem::offset_of!(timeval, tv_usec) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct timespec {
    pub tv_sec: __time_t,
    pub tv_nsec: __syscall_slong_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of timespec"][::std::mem::size_of::<timespec>() - 16usize];
    ["Alignment of timespec"][::std::mem::align_of::<timespec>() - 8usize];
    ["Offset of field: timespec::tv_sec"][::std::mem::offset_of!(timespec, tv_sec) - 0usize];
    ["Offset of field: timespec::tv_nsec"][::std::mem::offset_of!(timespec, tv_nsec) - 8usize];
};
pub type suseconds_t = __suseconds_t;
pub type __fd_mask = ::std::os::raw::c_long;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct fd_set {
    pub __fds_bits: [__fd_mask; 16usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of fd_set"][::std::mem::size_of::<fd_set>() - 128usize];
    ["Alignment of fd_set"][::std::mem::align_of::<fd_set>() - 8usize];
    ["Offset of field: fd_set::__fds_bits"][::std::mem::offset_of!(fd_set, __fds_bits) - 0usize];
};
pub type fd_mask = __fd_mask;
unsafe extern "C" {
    pub fn select(
        __nfds: ::std::os::raw::c_int,
        __readfds: *mut fd_set,
        __writefds: *mut fd_set,
        __exceptfds: *mut fd_set,
        __timeout: *mut timeval,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pselect(
        __nfds: ::std::os::raw::c_int,
        __readfds: *mut fd_set,
        __writefds: *mut fd_set,
        __exceptfds: *mut fd_set,
        __timeout: *const timespec,
        __sigmask: *const __sigset_t,
    ) -> ::std::os::raw::c_int;
}
pub type blksize_t = __blksize_t;
pub type blkcnt_t = __blkcnt_t;
pub type fsblkcnt_t = __fsblkcnt_t;
pub type fsfilcnt_t = __fsfilcnt_t;
#[repr(C)]
#[derive(Copy, Clone)]
pub union __atomic_wide_counter {
    pub __value64: ::std::os::raw::c_ulonglong,
    pub __value32: __atomic_wide_counter__bindgen_ty_1,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __atomic_wide_counter__bindgen_ty_1 {
    pub __low: ::std::os::raw::c_uint,
    pub __high: ::std::os::raw::c_uint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __atomic_wide_counter__bindgen_ty_1"]
        [::std::mem::size_of::<__atomic_wide_counter__bindgen_ty_1>() - 8usize];
    ["Alignment of __atomic_wide_counter__bindgen_ty_1"]
        [::std::mem::align_of::<__atomic_wide_counter__bindgen_ty_1>() - 4usize];
    ["Offset of field: __atomic_wide_counter__bindgen_ty_1::__low"]
        [::std::mem::offset_of!(__atomic_wide_counter__bindgen_ty_1, __low) - 0usize];
    ["Offset of field: __atomic_wide_counter__bindgen_ty_1::__high"]
        [::std::mem::offset_of!(__atomic_wide_counter__bindgen_ty_1, __high) - 4usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __atomic_wide_counter"][::std::mem::size_of::<__atomic_wide_counter>() - 8usize];
    ["Alignment of __atomic_wide_counter"]
        [::std::mem::align_of::<__atomic_wide_counter>() - 8usize];
    ["Offset of field: __atomic_wide_counter::__value64"]
        [::std::mem::offset_of!(__atomic_wide_counter, __value64) - 0usize];
    ["Offset of field: __atomic_wide_counter::__value32"]
        [::std::mem::offset_of!(__atomic_wide_counter, __value32) - 0usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __pthread_internal_list {
    pub __prev: *mut __pthread_internal_list,
    pub __next: *mut __pthread_internal_list,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __pthread_internal_list"][::std::mem::size_of::<__pthread_internal_list>() - 16usize];
    ["Alignment of __pthread_internal_list"]
        [::std::mem::align_of::<__pthread_internal_list>() - 8usize];
    ["Offset of field: __pthread_internal_list::__prev"]
        [::std::mem::offset_of!(__pthread_internal_list, __prev) - 0usize];
    ["Offset of field: __pthread_internal_list::__next"]
        [::std::mem::offset_of!(__pthread_internal_list, __next) - 8usize];
};
pub type __pthread_list_t = __pthread_internal_list;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __pthread_internal_slist {
    pub __next: *mut __pthread_internal_slist,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __pthread_internal_slist"]
        [::std::mem::size_of::<__pthread_internal_slist>() - 8usize];
    ["Alignment of __pthread_internal_slist"]
        [::std::mem::align_of::<__pthread_internal_slist>() - 8usize];
    ["Offset of field: __pthread_internal_slist::__next"]
        [::std::mem::offset_of!(__pthread_internal_slist, __next) - 0usize];
};
pub type __pthread_slist_t = __pthread_internal_slist;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __pthread_mutex_s {
    pub __lock: ::std::os::raw::c_int,
    pub __count: ::std::os::raw::c_uint,
    pub __owner: ::std::os::raw::c_int,
    pub __nusers: ::std::os::raw::c_uint,
    pub __kind: ::std::os::raw::c_int,
    pub __spins: ::std::os::raw::c_short,
    pub __elision: ::std::os::raw::c_short,
    pub __list: __pthread_list_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __pthread_mutex_s"][::std::mem::size_of::<__pthread_mutex_s>() - 40usize];
    ["Alignment of __pthread_mutex_s"][::std::mem::align_of::<__pthread_mutex_s>() - 8usize];
    ["Offset of field: __pthread_mutex_s::__lock"]
        [::std::mem::offset_of!(__pthread_mutex_s, __lock) - 0usize];
    ["Offset of field: __pthread_mutex_s::__count"]
        [::std::mem::offset_of!(__pthread_mutex_s, __count) - 4usize];
    ["Offset of field: __pthread_mutex_s::__owner"]
        [::std::mem::offset_of!(__pthread_mutex_s, __owner) - 8usize];
    ["Offset of field: __pthread_mutex_s::__nusers"]
        [::std::mem::offset_of!(__pthread_mutex_s, __nusers) - 12usize];
    ["Offset of field: __pthread_mutex_s::__kind"]
        [::std::mem::offset_of!(__pthread_mutex_s, __kind) - 16usize];
    ["Offset of field: __pthread_mutex_s::__spins"]
        [::std::mem::offset_of!(__pthread_mutex_s, __spins) - 20usize];
    ["Offset of field: __pthread_mutex_s::__elision"]
        [::std::mem::offset_of!(__pthread_mutex_s, __elision) - 22usize];
    ["Offset of field: __pthread_mutex_s::__list"]
        [::std::mem::offset_of!(__pthread_mutex_s, __list) - 24usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __pthread_rwlock_arch_t {
    pub __readers: ::std::os::raw::c_uint,
    pub __writers: ::std::os::raw::c_uint,
    pub __wrphase_futex: ::std::os::raw::c_uint,
    pub __writers_futex: ::std::os::raw::c_uint,
    pub __pad3: ::std::os::raw::c_uint,
    pub __pad4: ::std::os::raw::c_uint,
    pub __cur_writer: ::std::os::raw::c_int,
    pub __shared: ::std::os::raw::c_int,
    pub __rwelision: ::std::os::raw::c_schar,
    pub __pad1: [::std::os::raw::c_uchar; 7usize],
    pub __pad2: ::std::os::raw::c_ulong,
    pub __flags: ::std::os::raw::c_uint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __pthread_rwlock_arch_t"][::std::mem::size_of::<__pthread_rwlock_arch_t>() - 56usize];
    ["Alignment of __pthread_rwlock_arch_t"]
        [::std::mem::align_of::<__pthread_rwlock_arch_t>() - 8usize];
    ["Offset of field: __pthread_rwlock_arch_t::__readers"]
        [::std::mem::offset_of!(__pthread_rwlock_arch_t, __readers) - 0usize];
    ["Offset of field: __pthread_rwlock_arch_t::__writers"]
        [::std::mem::offset_of!(__pthread_rwlock_arch_t, __writers) - 4usize];
    ["Offset of field: __pthread_rwlock_arch_t::__wrphase_futex"]
        [::std::mem::offset_of!(__pthread_rwlock_arch_t, __wrphase_futex) - 8usize];
    ["Offset of field: __pthread_rwlock_arch_t::__writers_futex"]
        [::std::mem::offset_of!(__pthread_rwlock_arch_t, __writers_futex) - 12usize];
    ["Offset of field: __pthread_rwlock_arch_t::__pad3"]
        [::std::mem::offset_of!(__pthread_rwlock_arch_t, __pad3) - 16usize];
    ["Offset of field: __pthread_rwlock_arch_t::__pad4"]
        [::std::mem::offset_of!(__pthread_rwlock_arch_t, __pad4) - 20usize];
    ["Offset of field: __pthread_rwlock_arch_t::__cur_writer"]
        [::std::mem::offset_of!(__pthread_rwlock_arch_t, __cur_writer) - 24usize];
    ["Offset of field: __pthread_rwlock_arch_t::__shared"]
        [::std::mem::offset_of!(__pthread_rwlock_arch_t, __shared) - 28usize];
    ["Offset of field: __pthread_rwlock_arch_t::__rwelision"]
        [::std::mem::offset_of!(__pthread_rwlock_arch_t, __rwelision) - 32usize];
    ["Offset of field: __pthread_rwlock_arch_t::__pad1"]
        [::std::mem::offset_of!(__pthread_rwlock_arch_t, __pad1) - 33usize];
    ["Offset of field: __pthread_rwlock_arch_t::__pad2"]
        [::std::mem::offset_of!(__pthread_rwlock_arch_t, __pad2) - 40usize];
    ["Offset of field: __pthread_rwlock_arch_t::__flags"]
        [::std::mem::offset_of!(__pthread_rwlock_arch_t, __flags) - 48usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub struct __pthread_cond_s {
    pub __wseq: __atomic_wide_counter,
    pub __g1_start: __atomic_wide_counter,
    pub __g_size: [::std::os::raw::c_uint; 2usize],
    pub __g1_orig_size: ::std::os::raw::c_uint,
    pub __wrefs: ::std::os::raw::c_uint,
    pub __g_signals: [::std::os::raw::c_uint; 2usize],
    pub __unused_initialized_1: ::std::os::raw::c_uint,
    pub __unused_initialized_2: ::std::os::raw::c_uint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __pthread_cond_s"][::std::mem::size_of::<__pthread_cond_s>() - 48usize];
    ["Alignment of __pthread_cond_s"][::std::mem::align_of::<__pthread_cond_s>() - 8usize];
    ["Offset of field: __pthread_cond_s::__wseq"]
        [::std::mem::offset_of!(__pthread_cond_s, __wseq) - 0usize];
    ["Offset of field: __pthread_cond_s::__g1_start"]
        [::std::mem::offset_of!(__pthread_cond_s, __g1_start) - 8usize];
    ["Offset of field: __pthread_cond_s::__g_size"]
        [::std::mem::offset_of!(__pthread_cond_s, __g_size) - 16usize];
    ["Offset of field: __pthread_cond_s::__g1_orig_size"]
        [::std::mem::offset_of!(__pthread_cond_s, __g1_orig_size) - 24usize];
    ["Offset of field: __pthread_cond_s::__wrefs"]
        [::std::mem::offset_of!(__pthread_cond_s, __wrefs) - 28usize];
    ["Offset of field: __pthread_cond_s::__g_signals"]
        [::std::mem::offset_of!(__pthread_cond_s, __g_signals) - 32usize];
    ["Offset of field: __pthread_cond_s::__unused_initialized_1"]
        [::std::mem::offset_of!(__pthread_cond_s, __unused_initialized_1) - 40usize];
    ["Offset of field: __pthread_cond_s::__unused_initialized_2"]
        [::std::mem::offset_of!(__pthread_cond_s, __unused_initialized_2) - 44usize];
};
pub type __tss_t = ::std::os::raw::c_uint;
pub type __thrd_t = ::std::os::raw::c_ulong;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __once_flag {
    pub __data: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __once_flag"][::std::mem::size_of::<__once_flag>() - 4usize];
    ["Alignment of __once_flag"][::std::mem::align_of::<__once_flag>() - 4usize];
    ["Offset of field: __once_flag::__data"][::std::mem::offset_of!(__once_flag, __data) - 0usize];
};
pub type pthread_t = ::std::os::raw::c_ulong;
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_mutexattr_t {
    pub __size: [::std::os::raw::c_char; 4usize],
    pub __align: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pthread_mutexattr_t"][::std::mem::size_of::<pthread_mutexattr_t>() - 4usize];
    ["Alignment of pthread_mutexattr_t"][::std::mem::align_of::<pthread_mutexattr_t>() - 4usize];
    ["Offset of field: pthread_mutexattr_t::__size"]
        [::std::mem::offset_of!(pthread_mutexattr_t, __size) - 0usize];
    ["Offset of field: pthread_mutexattr_t::__align"]
        [::std::mem::offset_of!(pthread_mutexattr_t, __align) - 0usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_condattr_t {
    pub __size: [::std::os::raw::c_char; 4usize],
    pub __align: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pthread_condattr_t"][::std::mem::size_of::<pthread_condattr_t>() - 4usize];
    ["Alignment of pthread_condattr_t"][::std::mem::align_of::<pthread_condattr_t>() - 4usize];
    ["Offset of field: pthread_condattr_t::__size"]
        [::std::mem::offset_of!(pthread_condattr_t, __size) - 0usize];
    ["Offset of field: pthread_condattr_t::__align"]
        [::std::mem::offset_of!(pthread_condattr_t, __align) - 0usize];
};
pub type pthread_key_t = ::std::os::raw::c_uint;
pub type pthread_once_t = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_attr_t {
    pub __size: [::std::os::raw::c_char; 56usize],
    pub __align: ::std::os::raw::c_long,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pthread_attr_t"][::std::mem::size_of::<pthread_attr_t>() - 56usize];
    ["Alignment of pthread_attr_t"][::std::mem::align_of::<pthread_attr_t>() - 8usize];
    ["Offset of field: pthread_attr_t::__size"]
        [::std::mem::offset_of!(pthread_attr_t, __size) - 0usize];
    ["Offset of field: pthread_attr_t::__align"]
        [::std::mem::offset_of!(pthread_attr_t, __align) - 0usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_mutex_t {
    pub __data: __pthread_mutex_s,
    pub __size: [::std::os::raw::c_char; 40usize],
    pub __align: ::std::os::raw::c_long,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pthread_mutex_t"][::std::mem::size_of::<pthread_mutex_t>() - 40usize];
    ["Alignment of pthread_mutex_t"][::std::mem::align_of::<pthread_mutex_t>() - 8usize];
    ["Offset of field: pthread_mutex_t::__data"]
        [::std::mem::offset_of!(pthread_mutex_t, __data) - 0usize];
    ["Offset of field: pthread_mutex_t::__size"]
        [::std::mem::offset_of!(pthread_mutex_t, __size) - 0usize];
    ["Offset of field: pthread_mutex_t::__align"]
        [::std::mem::offset_of!(pthread_mutex_t, __align) - 0usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_cond_t {
    pub __data: __pthread_cond_s,
    pub __size: [::std::os::raw::c_char; 48usize],
    pub __align: ::std::os::raw::c_longlong,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pthread_cond_t"][::std::mem::size_of::<pthread_cond_t>() - 48usize];
    ["Alignment of pthread_cond_t"][::std::mem::align_of::<pthread_cond_t>() - 8usize];
    ["Offset of field: pthread_cond_t::__data"]
        [::std::mem::offset_of!(pthread_cond_t, __data) - 0usize];
    ["Offset of field: pthread_cond_t::__size"]
        [::std::mem::offset_of!(pthread_cond_t, __size) - 0usize];
    ["Offset of field: pthread_cond_t::__align"]
        [::std::mem::offset_of!(pthread_cond_t, __align) - 0usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_rwlock_t {
    pub __data: __pthread_rwlock_arch_t,
    pub __size: [::std::os::raw::c_char; 56usize],
    pub __align: ::std::os::raw::c_long,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pthread_rwlock_t"][::std::mem::size_of::<pthread_rwlock_t>() - 56usize];
    ["Alignment of pthread_rwlock_t"][::std::mem::align_of::<pthread_rwlock_t>() - 8usize];
    ["Offset of field: pthread_rwlock_t::__data"]
        [::std::mem::offset_of!(pthread_rwlock_t, __data) - 0usize];
    ["Offset of field: pthread_rwlock_t::__size"]
        [::std::mem::offset_of!(pthread_rwlock_t, __size) - 0usize];
    ["Offset of field: pthread_rwlock_t::__align"]
        [::std::mem::offset_of!(pthread_rwlock_t, __align) - 0usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_rwlockattr_t {
    pub __size: [::std::os::raw::c_char; 8usize],
    pub __align: ::std::os::raw::c_long,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pthread_rwlockattr_t"][::std::mem::size_of::<pthread_rwlockattr_t>() - 8usize];
    ["Alignment of pthread_rwlockattr_t"][::std::mem::align_of::<pthread_rwlockattr_t>() - 8usize];
    ["Offset of field: pthread_rwlockattr_t::__size"]
        [::std::mem::offset_of!(pthread_rwlockattr_t, __size) - 0usize];
    ["Offset of field: pthread_rwlockattr_t::__align"]
        [::std::mem::offset_of!(pthread_rwlockattr_t, __align) - 0usize];
};
pub type pthread_spinlock_t = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_barrier_t {
    pub __size: [::std::os::raw::c_char; 32usize],
    pub __align: ::std::os::raw::c_long,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pthread_barrier_t"][::std::mem::size_of::<pthread_barrier_t>() - 32usize];
    ["Alignment of pthread_barrier_t"][::std::mem::align_of::<pthread_barrier_t>() - 8usize];
    ["Offset of field: pthread_barrier_t::__size"]
        [::std::mem::offset_of!(pthread_barrier_t, __size) - 0usize];
    ["Offset of field: pthread_barrier_t::__align"]
        [::std::mem::offset_of!(pthread_barrier_t, __align) - 0usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_barrierattr_t {
    pub __size: [::std::os::raw::c_char; 4usize],
    pub __align: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pthread_barrierattr_t"][::std::mem::size_of::<pthread_barrierattr_t>() - 4usize];
    ["Alignment of pthread_barrierattr_t"]
        [::std::mem::align_of::<pthread_barrierattr_t>() - 4usize];
    ["Offset of field: pthread_barrierattr_t::__size"]
        [::std::mem::offset_of!(pthread_barrierattr_t, __size) - 0usize];
    ["Offset of field: pthread_barrierattr_t::__align"]
        [::std::mem::offset_of!(pthread_barrierattr_t, __align) - 0usize];
};
unsafe extern "C" {
    pub fn random() -> ::std::os::raw::c_long;
}
unsafe extern "C" {
    pub fn srandom(__seed: ::std::os::raw::c_uint);
}
unsafe extern "C" {
    pub fn initstate(
        __seed: ::std::os::raw::c_uint,
        __statebuf: *mut ::std::os::raw::c_char,
        __statelen: usize,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn setstate(__statebuf: *mut ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct random_data {
    pub fptr: *mut i32,
    pub rptr: *mut i32,
    pub state: *mut i32,
    pub rand_type: ::std::os::raw::c_int,
    pub rand_deg: ::std::os::raw::c_int,
    pub rand_sep: ::std::os::raw::c_int,
    pub end_ptr: *mut i32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of random_data"][::std::mem::size_of::<random_data>() - 48usize];
    ["Alignment of random_data"][::std::mem::align_of::<random_data>() - 8usize];
    ["Offset of field: random_data::fptr"][::std::mem::offset_of!(random_data, fptr) - 0usize];
    ["Offset of field: random_data::rptr"][::std::mem::offset_of!(random_data, rptr) - 8usize];
    ["Offset of field: random_data::state"][::std::mem::offset_of!(random_data, state) - 16usize];
    ["Offset of field: random_data::rand_type"]
        [::std::mem::offset_of!(random_data, rand_type) - 24usize];
    ["Offset of field: random_data::rand_deg"]
        [::std::mem::offset_of!(random_data, rand_deg) - 28usize];
    ["Offset of field: random_data::rand_sep"]
        [::std::mem::offset_of!(random_data, rand_sep) - 32usize];
    ["Offset of field: random_data::end_ptr"]
        [::std::mem::offset_of!(random_data, end_ptr) - 40usize];
};
unsafe extern "C" {
    pub fn random_r(__buf: *mut random_data, __result: *mut i32) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn srandom_r(
        __seed: ::std::os::raw::c_uint,
        __buf: *mut random_data,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn initstate_r(
        __seed: ::std::os::raw::c_uint,
        __statebuf: *mut ::std::os::raw::c_char,
        __statelen: usize,
        __buf: *mut random_data,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn setstate_r(
        __statebuf: *mut ::std::os::raw::c_char,
        __buf: *mut random_data,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn rand() -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn srand(__seed: ::std::os::raw::c_uint);
}
unsafe extern "C" {
    pub fn rand_r(__seed: *mut ::std::os::raw::c_uint) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn drand48() -> f64;
}
unsafe extern "C" {
    pub fn erand48(__xsubi: *mut ::std::os::raw::c_ushort) -> f64;
}
unsafe extern "C" {
    pub fn lrand48() -> ::std::os::raw::c_long;
}
unsafe extern "C" {
    pub fn nrand48(__xsubi: *mut ::std::os::raw::c_ushort) -> ::std::os::raw::c_long;
}
unsafe extern "C" {
    pub fn mrand48() -> ::std::os::raw::c_long;
}
unsafe extern "C" {
    pub fn jrand48(__xsubi: *mut ::std::os::raw::c_ushort) -> ::std::os::raw::c_long;
}
unsafe extern "C" {
    pub fn srand48(__seedval: ::std::os::raw::c_long);
}
unsafe extern "C" {
    pub fn seed48(__seed16v: *mut ::std::os::raw::c_ushort) -> *mut ::std::os::raw::c_ushort;
}
unsafe extern "C" {
    pub fn lcong48(__param: *mut ::std::os::raw::c_ushort);
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct drand48_data {
    pub __x: [::std::os::raw::c_ushort; 3usize],
    pub __old_x: [::std::os::raw::c_ushort; 3usize],
    pub __c: ::std::os::raw::c_ushort,
    pub __init: ::std::os::raw::c_ushort,
    pub __a: ::std::os::raw::c_ulonglong,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of drand48_data"][::std::mem::size_of::<drand48_data>() - 24usize];
    ["Alignment of drand48_data"][::std::mem::align_of::<drand48_data>() - 8usize];
    ["Offset of field: drand48_data::__x"][::std::mem::offset_of!(drand48_data, __x) - 0usize];
    ["Offset of field: drand48_data::__old_x"]
        [::std::mem::offset_of!(drand48_data, __old_x) - 6usize];
    ["Offset of field: drand48_data::__c"][::std::mem::offset_of!(drand48_data, __c) - 12usize];
    ["Offset of field: drand48_data::__init"]
        [::std::mem::offset_of!(drand48_data, __init) - 14usize];
    ["Offset of field: drand48_data::__a"][::std::mem::offset_of!(drand48_data, __a) - 16usize];
};
unsafe extern "C" {
    pub fn drand48_r(__buffer: *mut drand48_data, __result: *mut f64) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn erand48_r(
        __xsubi: *mut ::std::os::raw::c_ushort,
        __buffer: *mut drand48_data,
        __result: *mut f64,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lrand48_r(
        __buffer: *mut drand48_data,
        __result: *mut ::std::os::raw::c_long,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn nrand48_r(
        __xsubi: *mut ::std::os::raw::c_ushort,
        __buffer: *mut drand48_data,
        __result: *mut ::std::os::raw::c_long,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn mrand48_r(
        __buffer: *mut drand48_data,
        __result: *mut ::std::os::raw::c_long,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn jrand48_r(
        __xsubi: *mut ::std::os::raw::c_ushort,
        __buffer: *mut drand48_data,
        __result: *mut ::std::os::raw::c_long,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn srand48_r(
        __seedval: ::std::os::raw::c_long,
        __buffer: *mut drand48_data,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn seed48_r(
        __seed16v: *mut ::std::os::raw::c_ushort,
        __buffer: *mut drand48_data,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lcong48_r(
        __param: *mut ::std::os::raw::c_ushort,
        __buffer: *mut drand48_data,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn arc4random() -> __uint32_t;
}
unsafe extern "C" {
    pub fn arc4random_buf(__buf: *mut ::std::os::raw::c_void, __size: usize);
}
unsafe extern "C" {
    pub fn arc4random_uniform(__upper_bound: __uint32_t) -> __uint32_t;
}
unsafe extern "C" {
    pub fn malloc(__size: ::std::os::raw::c_ulong) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn calloc(
        __nmemb: ::std::os::raw::c_ulong,
        __size: ::std::os::raw::c_ulong,
    ) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn realloc(
        __ptr: *mut ::std::os::raw::c_void,
        __size: ::std::os::raw::c_ulong,
    ) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn free(__ptr: *mut ::std::os::raw::c_void);
}
unsafe extern "C" {
    pub fn reallocarray(
        __ptr: *mut ::std::os::raw::c_void,
        __nmemb: usize,
        __size: usize,
    ) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn alloca(__size: ::std::os::raw::c_ulong) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn valloc(__size: usize) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn posix_memalign(
        __memptr: *mut *mut ::std::os::raw::c_void,
        __alignment: usize,
        __size: usize,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn aligned_alloc(
        __alignment: ::std::os::raw::c_ulong,
        __size: ::std::os::raw::c_ulong,
    ) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn abort() -> !;
}
unsafe extern "C" {
    pub fn atexit(__func: ::std::option::Option<unsafe extern "C" fn()>) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn at_quick_exit(
        __func: ::std::option::Option<unsafe extern "C" fn()>,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn on_exit(
        __func: ::std::option::Option<
            unsafe extern "C" fn(
                __status: ::std::os::raw::c_int,
                __arg: *mut ::std::os::raw::c_void,
            ),
        >,
        __arg: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn exit(__status: ::std::os::raw::c_int) -> !;
}
unsafe extern "C" {
    pub fn quick_exit(__status: ::std::os::raw::c_int) -> !;
}
unsafe extern "C" {
    pub fn _Exit(__status: ::std::os::raw::c_int) -> !;
}
unsafe extern "C" {
    pub fn getenv(__name: *const ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn putenv(__string: *mut ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn setenv(
        __name: *const ::std::os::raw::c_char,
        __value: *const ::std::os::raw::c_char,
        __replace: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn unsetenv(__name: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn clearenv() -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn mktemp(__template: *mut ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn mkstemp(__template: *mut ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn mkstemps(
        __template: *mut ::std::os::raw::c_char,
        __suffixlen: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn mkdtemp(__template: *mut ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn system(__command: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn realpath(
        __name: *const ::std::os::raw::c_char,
        __resolved: *mut ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
pub type __compar_fn_t = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: *const ::std::os::raw::c_void,
        arg2: *const ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int,
>;
unsafe extern "C" {
    pub fn bsearch(
        __key: *const ::std::os::raw::c_void,
        __base: *const ::std::os::raw::c_void,
        __nmemb: usize,
        __size: usize,
        __compar: __compar_fn_t,
    ) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn qsort(
        __base: *mut ::std::os::raw::c_void,
        __nmemb: usize,
        __size: usize,
        __compar: __compar_fn_t,
    );
}
unsafe extern "C" {
    pub fn abs(__x: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn labs(__x: ::std::os::raw::c_long) -> ::std::os::raw::c_long;
}
unsafe extern "C" {
    pub fn llabs(__x: ::std::os::raw::c_longlong) -> ::std::os::raw::c_longlong;
}
unsafe extern "C" {
    pub fn div(__numer: ::std::os::raw::c_int, __denom: ::std::os::raw::c_int) -> div_t;
}
unsafe extern "C" {
    pub fn ldiv(__numer: ::std::os::raw::c_long, __denom: ::std::os::raw::c_long) -> ldiv_t;
}
unsafe extern "C" {
    pub fn lldiv(
        __numer: ::std::os::raw::c_longlong,
        __denom: ::std::os::raw::c_longlong,
    ) -> lldiv_t;
}
unsafe extern "C" {
    pub fn ecvt(
        __value: f64,
        __ndigit: ::std::os::raw::c_int,
        __decpt: *mut ::std::os::raw::c_int,
        __sign: *mut ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn fcvt(
        __value: f64,
        __ndigit: ::std::os::raw::c_int,
        __decpt: *mut ::std::os::raw::c_int,
        __sign: *mut ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn gcvt(
        __value: f64,
        __ndigit: ::std::os::raw::c_int,
        __buf: *mut ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn qecvt(
        __value: u128,
        __ndigit: ::std::os::raw::c_int,
        __decpt: *mut ::std::os::raw::c_int,
        __sign: *mut ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn qfcvt(
        __value: u128,
        __ndigit: ::std::os::raw::c_int,
        __decpt: *mut ::std::os::raw::c_int,
        __sign: *mut ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn qgcvt(
        __value: u128,
        __ndigit: ::std::os::raw::c_int,
        __buf: *mut ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn ecvt_r(
        __value: f64,
        __ndigit: ::std::os::raw::c_int,
        __decpt: *mut ::std::os::raw::c_int,
        __sign: *mut ::std::os::raw::c_int,
        __buf: *mut ::std::os::raw::c_char,
        __len: usize,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn fcvt_r(
        __value: f64,
        __ndigit: ::std::os::raw::c_int,
        __decpt: *mut ::std::os::raw::c_int,
        __sign: *mut ::std::os::raw::c_int,
        __buf: *mut ::std::os::raw::c_char,
        __len: usize,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn qecvt_r(
        __value: u128,
        __ndigit: ::std::os::raw::c_int,
        __decpt: *mut ::std::os::raw::c_int,
        __sign: *mut ::std::os::raw::c_int,
        __buf: *mut ::std::os::raw::c_char,
        __len: usize,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn qfcvt_r(
        __value: u128,
        __ndigit: ::std::os::raw::c_int,
        __decpt: *mut ::std::os::raw::c_int,
        __sign: *mut ::std::os::raw::c_int,
        __buf: *mut ::std::os::raw::c_char,
        __len: usize,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn mblen(__s: *const ::std::os::raw::c_char, __n: usize) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn mbtowc(
        __pwc: *mut wchar_t,
        __s: *const ::std::os::raw::c_char,
        __n: usize,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn wctomb(__s: *mut ::std::os::raw::c_char, __wchar: wchar_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn mbstowcs(__pwcs: *mut wchar_t, __s: *const ::std::os::raw::c_char, __n: usize) -> usize;
}
unsafe extern "C" {
    pub fn wcstombs(__s: *mut ::std::os::raw::c_char, __pwcs: *const wchar_t, __n: usize) -> usize;
}
unsafe extern "C" {
    pub fn rpmatch(__response: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn getsubopt(
        __optionp: *mut *mut ::std::os::raw::c_char,
        __tokens: *const *mut ::std::os::raw::c_char,
        __valuep: *mut *mut ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn getloadavg(__loadavg: *mut f64, __nelem: ::std::os::raw::c_int)
    -> ::std::os::raw::c_int;
}
pub type int_least8_t = __int_least8_t;
pub type int_least16_t = __int_least16_t;
pub type int_least32_t = __int_least32_t;
pub type int_least64_t = __int_least64_t;
pub type uint_least8_t = __uint_least8_t;
pub type uint_least16_t = __uint_least16_t;
pub type uint_least32_t = __uint_least32_t;
pub type uint_least64_t = __uint_least64_t;
pub type int_fast8_t = ::std::os::raw::c_schar;
pub type int_fast16_t = ::std::os::raw::c_long;
pub type int_fast32_t = ::std::os::raw::c_long;
pub type int_fast64_t = ::std::os::raw::c_long;
pub type uint_fast8_t = ::std::os::raw::c_uchar;
pub type uint_fast16_t = ::std::os::raw::c_ulong;
pub type uint_fast32_t = ::std::os::raw::c_ulong;
pub type uint_fast64_t = ::std::os::raw::c_ulong;
pub type intmax_t = __intmax_t;
pub type uintmax_t = __uintmax_t;
pub type cuuint32_t = u32;
pub type cuuint64_t = u64;
pub type CUdeviceptr = ::std::os::raw::c_ulonglong;
pub type CUdevice = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CUctx_st {
    _unused: [u8; 0],
}
pub type CUcontext = *mut CUctx_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CUmod_st {
    _unused: [u8; 0],
}
pub type CUmodule = *mut CUmod_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CUfunc_st {
    _unused: [u8; 0],
}
pub type CUfunction = *mut CUfunc_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CUarray_st {
    _unused: [u8; 0],
}
pub type CUarray = *mut CUarray_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CUmipmappedArray_st {
    _unused: [u8; 0],
}
pub type CUmipmappedArray = *mut CUmipmappedArray_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CUtexref_st {
    _unused: [u8; 0],
}
pub type CUtexref = *mut CUtexref_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CUsurfref_st {
    _unused: [u8; 0],
}
pub type CUsurfref = *mut CUsurfref_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CUevent_st {
    _unused: [u8; 0],
}
pub type CUevent = *mut CUevent_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CUstream_st {
    _unused: [u8; 0],
}
pub type CUstream = *mut CUstream_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CUgraphicsResource_st {
    _unused: [u8; 0],
}
pub type CUgraphicsResource = *mut CUgraphicsResource_st;
pub type CUtexObject = ::std::os::raw::c_ulonglong;
pub type CUsurfObject = ::std::os::raw::c_ulonglong;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CUextMemory_st {
    _unused: [u8; 0],
}
pub type CUexternalMemory = *mut CUextMemory_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CUextSemaphore_st {
    _unused: [u8; 0],
}
pub type CUexternalSemaphore = *mut CUextSemaphore_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CUgraph_st {
    _unused: [u8; 0],
}
pub type CUgraph = *mut CUgraph_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CUgraphNode_st {
    _unused: [u8; 0],
}
pub type CUgraphNode = *mut CUgraphNode_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CUgraphExec_st {
    _unused: [u8; 0],
}
pub type CUgraphExec = *mut CUgraphExec_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CUuuid_st {
    pub bytes: [::std::os::raw::c_char; 16usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of CUuuid_st"][::std::mem::size_of::<CUuuid_st>() - 16usize];
    ["Alignment of CUuuid_st"][::std::mem::align_of::<CUuuid_st>() - 1usize];
    ["Offset of field: CUuuid_st::bytes"][::std::mem::offset_of!(CUuuid_st, bytes) - 0usize];
};
pub type CUuuid = CUuuid_st;
#[doc = " CUDA IPC event handle"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CUipcEventHandle_st {
    pub reserved: [::std::os::raw::c_char; 64usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of CUipcEventHandle_st"][::std::mem::size_of::<CUipcEventHandle_st>() - 64usize];
    ["Alignment of CUipcEventHandle_st"][::std::mem::align_of::<CUipcEventHandle_st>() - 1usize];
    ["Offset of field: CUipcEventHandle_st::reserved"]
        [::std::mem::offset_of!(CUipcEventHandle_st, reserved) - 0usize];
};
#[doc = " CUDA IPC event handle"]
pub type CUipcEventHandle = CUipcEventHandle_st;
#[doc = " CUDA IPC mem handle"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CUipcMemHandle_st {
    pub reserved: [::std::os::raw::c_char; 64usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of CUipcMemHandle_st"][::std::mem::size_of::<CUipcMemHandle_st>() - 64usize];
    ["Alignment of CUipcMemHandle_st"][::std::mem::align_of::<CUipcMemHandle_st>() - 1usize];
    ["Offset of field: CUipcMemHandle_st::reserved"]
        [::std::mem::offset_of!(CUipcMemHandle_st, reserved) - 0usize];
};
#[doc = " CUDA IPC mem handle"]
pub type CUipcMemHandle = CUipcMemHandle_st;
pub mod CUipcMem_flags_enum {
    #[doc = " CUDA Ipc Mem Flags"]
    pub type Type = ::std::os::raw::c_uint;
    #[doc = "< Automatically enable peer access between remote devices as needed"]
    pub const CU_IPC_MEM_LAZY_ENABLE_PEER_ACCESS: Type = 1;
}
#[doc = " CUDA Ipc Mem Flags"]
pub use self::CUipcMem_flags_enum::Type as CUipcMem_flags;
pub mod CUmemAttach_flags_enum {
    #[doc = " CUDA Mem Attach Flags"]
    pub type Type = ::std::os::raw::c_uint;
    #[doc = "< Memory can be accessed by any stream on any device"]
    pub const CU_MEM_ATTACH_GLOBAL: Type = 1;
    #[doc = "< Memory cannot be accessed by any stream on any device"]
    pub const CU_MEM_ATTACH_HOST: Type = 2;
    #[doc = "< Memory can only be accessed by a single stream on the associated device"]
    pub const CU_MEM_ATTACH_SINGLE: Type = 4;
}
#[doc = " CUDA Mem Attach Flags"]
pub use self::CUmemAttach_flags_enum::Type as CUmemAttach_flags;
pub mod CUctx_flags_enum {
    #[doc = " Context creation flags"]
    pub type Type = ::std::os::raw::c_uint;
    #[doc = "< Automatic scheduling"]
    pub const CU_CTX_SCHED_AUTO: Type = 0;
    #[doc = "< Set spin as default scheduling"]
    pub const CU_CTX_SCHED_SPIN: Type = 1;
    #[doc = "< Set yield as default scheduling"]
    pub const CU_CTX_SCHED_YIELD: Type = 2;
    #[doc = "< Set blocking synchronization as default scheduling"]
    pub const CU_CTX_SCHED_BLOCKING_SYNC: Type = 4;
    #[doc = "< Set blocking synchronization as default scheduling\n  \\deprecated This flag was deprecated as of CUDA 4.0\n  and was replaced with ::CU_CTX_SCHED_BLOCKING_SYNC."]
    pub const CU_CTX_BLOCKING_SYNC: Type = 4;
    pub const CU_CTX_SCHED_MASK: Type = 7;
    #[doc = "< Support mapped pinned allocations"]
    pub const CU_CTX_MAP_HOST: Type = 8;
    #[doc = "< Keep local memory allocation after launch"]
    pub const CU_CTX_LMEM_RESIZE_TO_MAX: Type = 16;
    pub const CU_CTX_FLAGS_MASK: Type = 31;
}
#[doc = " Context creation flags"]
pub use self::CUctx_flags_enum::Type as CUctx_flags;
pub mod CUstream_flags_enum {
    #[doc = " Stream creation flags"]
    pub type Type = ::std::os::raw::c_uint;
    #[doc = "< Default stream flag"]
    pub const CU_STREAM_DEFAULT: Type = 0;
    #[doc = "< Stream does not synchronize with stream 0 (the NULL stream)"]
    pub const CU_STREAM_NON_BLOCKING: Type = 1;
}
#[doc = " Stream creation flags"]
pub use self::CUstream_flags_enum::Type as CUstream_flags;
pub mod CUevent_flags_enum {
    #[doc = " Event creation flags"]
    pub type Type = ::std::os::raw::c_uint;
    #[doc = "< Default event flag"]
    pub const CU_EVENT_DEFAULT: Type = 0;
    #[doc = "< Event uses blocking synchronization"]
    pub const CU_EVENT_BLOCKING_SYNC: Type = 1;
    #[doc = "< Event will not record timing data"]
    pub const CU_EVENT_DISABLE_TIMING: Type = 2;
    #[doc = "< Event is suitable for interprocess use. CU_EVENT_DISABLE_TIMING must be set"]
    pub const CU_EVENT_INTERPROCESS: Type = 4;
}
#[doc = " Event creation flags"]
pub use self::CUevent_flags_enum::Type as CUevent_flags;
pub mod CUstreamWaitValue_flags_enum {
    #[doc = " Flags for ::cuStreamWaitValue32 and ::cuStreamWaitValue64"]
    pub type Type = ::std::os::raw::c_uint;
    #[doc = "< Wait until (int32_t)(*addr - value) >= 0 (or int64_t for 64 bit\nvalues). Note this is a cyclic comparison which ignores wraparound.\n(Default behavior.)"]
    pub const CU_STREAM_WAIT_VALUE_GEQ: Type = 0;
    #[doc = "< Wait until *addr == value."]
    pub const CU_STREAM_WAIT_VALUE_EQ: Type = 1;
    #[doc = "< Wait until (*addr & value) != 0."]
    pub const CU_STREAM_WAIT_VALUE_AND: Type = 2;
    #[doc = "< Wait until ~(*addr | value) != 0. Support for this operation can be\nqueried with ::cuDeviceGetAttribute() and\n::CU_DEVICE_ATTRIBUTE_CAN_USE_STREAM_WAIT_VALUE_NOR."]
    pub const CU_STREAM_WAIT_VALUE_NOR: Type = 3;
    #[doc = "< Follow the wait operation with a flush of outstanding remote writes. This\nmeans that, if a remote write operation is guaranteed to have reached the\ndevice before the wait can be satisfied, that write is guaranteed to be\nvisible to downstream device work. The device is permitted to reorder\nremote writes internally. For example, this flag would be required if\ntwo remote writes arrive in a defined order, the wait is satisfied by the\nsecond write, and downstream work needs to observe the first write.\nSupport for this operation is restricted to selected platforms and can be\nqueried with ::CU_DEVICE_ATTRIBUTE_CAN_USE_WAIT_VALUE_FLUSH."]
    pub const CU_STREAM_WAIT_VALUE_FLUSH: Type = 1073741824;
}
#[doc = " Flags for ::cuStreamWaitValue32 and ::cuStreamWaitValue64"]
pub use self::CUstreamWaitValue_flags_enum::Type as CUstreamWaitValue_flags;
pub mod CUstreamWriteValue_flags_enum {
    #[doc = " Flags for ::cuStreamWriteValue32"]
    pub type Type = ::std::os::raw::c_uint;
    #[doc = "< Default behavior"]
    pub const CU_STREAM_WRITE_VALUE_DEFAULT: Type = 0;
    #[doc = "< Permits the write to be reordered with writes which were issued\nbefore it, as a performance optimization. Normally,\n::cuStreamWriteValue32 will provide a memory fence before the\nwrite, which has similar semantics to\n__threadfence_system() but is scoped to the stream\nrather than a CUDA thread."]
    pub const CU_STREAM_WRITE_VALUE_NO_MEMORY_BARRIER: Type = 1;
}
#[doc = " Flags for ::cuStreamWriteValue32"]
pub use self::CUstreamWriteValue_flags_enum::Type as CUstreamWriteValue_flags;
pub mod CUstreamBatchMemOpType_enum {
    #[doc = " Operations for ::cuStreamBatchMemOp"]
    pub type Type = ::std::os::raw::c_uint;
    #[doc = "< Represents a ::cuStreamWaitValue32 operation"]
    pub const CU_STREAM_MEM_OP_WAIT_VALUE_32: Type = 1;
    #[doc = "< Represents a ::cuStreamWriteValue32 operation"]
    pub const CU_STREAM_MEM_OP_WRITE_VALUE_32: Type = 2;
    #[doc = "< Represents a ::cuStreamWaitValue64 operation"]
    pub const CU_STREAM_MEM_OP_WAIT_VALUE_64: Type = 4;
    #[doc = "< Represents a ::cuStreamWriteValue64 operation"]
    pub const CU_STREAM_MEM_OP_WRITE_VALUE_64: Type = 5;
    #[doc = "< This has the same effect as ::CU_STREAM_WAIT_VALUE_FLUSH, but as a\nstandalone operation."]
    pub const CU_STREAM_MEM_OP_FLUSH_REMOTE_WRITES: Type = 3;
}
#[doc = " Operations for ::cuStreamBatchMemOp"]
pub use self::CUstreamBatchMemOpType_enum::Type as CUstreamBatchMemOpType;
#[doc = " Per-operation parameters for ::cuStreamBatchMemOp"]
#[repr(C)]
#[derive(Copy, Clone)]
pub union CUstreamBatchMemOpParams_union {
    pub operation: CUstreamBatchMemOpType,
    pub waitValue: CUstreamBatchMemOpParams_union_CUstreamMemOpWaitValueParams_st,
    pub writeValue: CUstreamBatchMemOpParams_union_CUstreamMemOpWriteValueParams_st,
    pub flushRemoteWrites: CUstreamBatchMemOpParams_union_CUstreamMemOpFlushRemoteWritesParams_st,
    pub pad: [cuuint64_t; 6usize],
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct CUstreamBatchMemOpParams_union_CUstreamMemOpWaitValueParams_st {
    pub operation: CUstreamBatchMemOpType,
    pub address: CUdeviceptr,
    pub __bindgen_anon_1:
        CUstreamBatchMemOpParams_union_CUstreamMemOpWaitValueParams_st__bindgen_ty_1,
    pub flags: ::std::os::raw::c_uint,
    #[doc = "< For driver internal use. Initial value is unimportant."]
    pub alias: CUdeviceptr,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union CUstreamBatchMemOpParams_union_CUstreamMemOpWaitValueParams_st__bindgen_ty_1 {
    pub value: cuuint32_t,
    pub value64: cuuint64_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of CUstreamBatchMemOpParams_union_CUstreamMemOpWaitValueParams_st__bindgen_ty_1"]
        [::std::mem::size_of::<
            CUstreamBatchMemOpParams_union_CUstreamMemOpWaitValueParams_st__bindgen_ty_1,
        >() - 8usize];
    ["Alignment of CUstreamBatchMemOpParams_union_CUstreamMemOpWaitValueParams_st__bindgen_ty_1"]
        [::std::mem::align_of::<
            CUstreamBatchMemOpParams_union_CUstreamMemOpWaitValueParams_st__bindgen_ty_1,
        >() - 8usize];
    [
        "Offset of field: CUstreamBatchMemOpParams_union_CUstreamMemOpWaitValueParams_st__bindgen_ty_1::value",
    ][::std::mem::offset_of!(
        CUstreamBatchMemOpParams_union_CUstreamMemOpWaitValueParams_st__bindgen_ty_1,
        value
    ) - 0usize];
    [
        "Offset of field: CUstreamBatchMemOpParams_union_CUstreamMemOpWaitValueParams_st__bindgen_ty_1::value64",
    ][::std::mem::offset_of!(
        CUstreamBatchMemOpParams_union_CUstreamMemOpWaitValueParams_st__bindgen_ty_1,
        value64
    ) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of CUstreamBatchMemOpParams_union_CUstreamMemOpWaitValueParams_st"][::std::mem::size_of::<
        CUstreamBatchMemOpParams_union_CUstreamMemOpWaitValueParams_st,
    >() - 40usize];
    ["Alignment of CUstreamBatchMemOpParams_union_CUstreamMemOpWaitValueParams_st"]
        [::std::mem::align_of::<CUstreamBatchMemOpParams_union_CUstreamMemOpWaitValueParams_st>()
            - 8usize];
    ["Offset of field: CUstreamBatchMemOpParams_union_CUstreamMemOpWaitValueParams_st::operation"]
        [::std::mem::offset_of!(
            CUstreamBatchMemOpParams_union_CUstreamMemOpWaitValueParams_st,
            operation
        ) - 0usize];
    ["Offset of field: CUstreamBatchMemOpParams_union_CUstreamMemOpWaitValueParams_st::address"][::std::mem::offset_of!(
        CUstreamBatchMemOpParams_union_CUstreamMemOpWaitValueParams_st,
        address
    )
        - 8usize];
    ["Offset of field: CUstreamBatchMemOpParams_union_CUstreamMemOpWaitValueParams_st::flags"][::std::mem::offset_of!(
        CUstreamBatchMemOpParams_union_CUstreamMemOpWaitValueParams_st,
        flags
    )
        - 24usize];
    ["Offset of field: CUstreamBatchMemOpParams_union_CUstreamMemOpWaitValueParams_st::alias"][::std::mem::offset_of!(
        CUstreamBatchMemOpParams_union_CUstreamMemOpWaitValueParams_st,
        alias
    )
        - 32usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub struct CUstreamBatchMemOpParams_union_CUstreamMemOpWriteValueParams_st {
    pub operation: CUstreamBatchMemOpType,
    pub address: CUdeviceptr,
    pub __bindgen_anon_1:
        CUstreamBatchMemOpParams_union_CUstreamMemOpWriteValueParams_st__bindgen_ty_1,
    pub flags: ::std::os::raw::c_uint,
    #[doc = "< For driver internal use. Initial value is unimportant."]
    pub alias: CUdeviceptr,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union CUstreamBatchMemOpParams_union_CUstreamMemOpWriteValueParams_st__bindgen_ty_1 {
    pub value: cuuint32_t,
    pub value64: cuuint64_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of CUstreamBatchMemOpParams_union_CUstreamMemOpWriteValueParams_st__bindgen_ty_1"]
        [::std::mem::size_of::<
            CUstreamBatchMemOpParams_union_CUstreamMemOpWriteValueParams_st__bindgen_ty_1,
        >() - 8usize];
    ["Alignment of CUstreamBatchMemOpParams_union_CUstreamMemOpWriteValueParams_st__bindgen_ty_1"]
        [::std::mem::align_of::<
            CUstreamBatchMemOpParams_union_CUstreamMemOpWriteValueParams_st__bindgen_ty_1,
        >() - 8usize];
    [
        "Offset of field: CUstreamBatchMemOpParams_union_CUstreamMemOpWriteValueParams_st__bindgen_ty_1::value",
    ][::std::mem::offset_of!(
        CUstreamBatchMemOpParams_union_CUstreamMemOpWriteValueParams_st__bindgen_ty_1,
        value
    ) - 0usize];
    [
        "Offset of field: CUstreamBatchMemOpParams_union_CUstreamMemOpWriteValueParams_st__bindgen_ty_1::value64",
    ][::std::mem::offset_of!(
        CUstreamBatchMemOpParams_union_CUstreamMemOpWriteValueParams_st__bindgen_ty_1,
        value64
    ) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of CUstreamBatchMemOpParams_union_CUstreamMemOpWriteValueParams_st"][::std::mem::size_of::<
        CUstreamBatchMemOpParams_union_CUstreamMemOpWriteValueParams_st,
    >() - 40usize];
    ["Alignment of CUstreamBatchMemOpParams_union_CUstreamMemOpWriteValueParams_st"]
        [::std::mem::align_of::<CUstreamBatchMemOpParams_union_CUstreamMemOpWriteValueParams_st>()
            - 8usize];
    ["Offset of field: CUstreamBatchMemOpParams_union_CUstreamMemOpWriteValueParams_st::operation"]
        [::std::mem::offset_of!(
            CUstreamBatchMemOpParams_union_CUstreamMemOpWriteValueParams_st,
            operation
        ) - 0usize];
    ["Offset of field: CUstreamBatchMemOpParams_union_CUstreamMemOpWriteValueParams_st::address"][::std::mem::offset_of!(
        CUstreamBatchMemOpParams_union_CUstreamMemOpWriteValueParams_st,
        address
    )
        - 8usize];
    ["Offset of field: CUstreamBatchMemOpParams_union_CUstreamMemOpWriteValueParams_st::flags"][::std::mem::offset_of!(
        CUstreamBatchMemOpParams_union_CUstreamMemOpWriteValueParams_st,
        flags
    )
        - 24usize];
    ["Offset of field: CUstreamBatchMemOpParams_union_CUstreamMemOpWriteValueParams_st::alias"][::std::mem::offset_of!(
        CUstreamBatchMemOpParams_union_CUstreamMemOpWriteValueParams_st,
        alias
    )
        - 32usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CUstreamBatchMemOpParams_union_CUstreamMemOpFlushRemoteWritesParams_st {
    pub operation: CUstreamBatchMemOpType,
    pub flags: ::std::os::raw::c_uint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of CUstreamBatchMemOpParams_union_CUstreamMemOpFlushRemoteWritesParams_st"]
        [::std::mem::size_of::<
            CUstreamBatchMemOpParams_union_CUstreamMemOpFlushRemoteWritesParams_st,
        >() - 8usize];
    ["Alignment of CUstreamBatchMemOpParams_union_CUstreamMemOpFlushRemoteWritesParams_st"]
        [::std::mem::align_of::<
            CUstreamBatchMemOpParams_union_CUstreamMemOpFlushRemoteWritesParams_st,
        >() - 4usize];
    [
        "Offset of field: CUstreamBatchMemOpParams_union_CUstreamMemOpFlushRemoteWritesParams_st::operation",
    ][::std::mem::offset_of!(
        CUstreamBatchMemOpParams_union_CUstreamMemOpFlushRemoteWritesParams_st,
        operation
    ) - 0usize];
    [
        "Offset of field: CUstreamBatchMemOpParams_union_CUstreamMemOpFlushRemoteWritesParams_st::flags",
    ][::std::mem::offset_of!(
        CUstreamBatchMemOpParams_union_CUstreamMemOpFlushRemoteWritesParams_st,
        flags
    ) - 4usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of CUstreamBatchMemOpParams_union"]
        [::std::mem::size_of::<CUstreamBatchMemOpParams_union>() - 48usize];
    ["Alignment of CUstreamBatchMemOpParams_union"]
        [::std::mem::align_of::<CUstreamBatchMemOpParams_union>() - 8usize];
    ["Offset of field: CUstreamBatchMemOpParams_union::operation"]
        [::std::mem::offset_of!(CUstreamBatchMemOpParams_union, operation) - 0usize];
    ["Offset of field: CUstreamBatchMemOpParams_union::waitValue"]
        [::std::mem::offset_of!(CUstreamBatchMemOpParams_union, waitValue) - 0usize];
    ["Offset of field: CUstreamBatchMemOpParams_union::writeValue"]
        [::std::mem::offset_of!(CUstreamBatchMemOpParams_union, writeValue) - 0usize];
    ["Offset of field: CUstreamBatchMemOpParams_union::flushRemoteWrites"]
        [::std::mem::offset_of!(CUstreamBatchMemOpParams_union, flushRemoteWrites) - 0usize];
    ["Offset of field: CUstreamBatchMemOpParams_union::pad"]
        [::std::mem::offset_of!(CUstreamBatchMemOpParams_union, pad) - 0usize];
};
#[doc = " Per-operation parameters for ::cuStreamBatchMemOp"]
pub type CUstreamBatchMemOpParams = CUstreamBatchMemOpParams_union;
pub mod CUoccupancy_flags_enum {
    #[doc = " Occupancy calculator flag"]
    pub type Type = ::std::os::raw::c_uint;
    #[doc = "< Default behavior"]
    pub const CU_OCCUPANCY_DEFAULT: Type = 0;
    #[doc = "< Assume global caching is enabled and cannot be automatically turned off"]
    pub const CU_OCCUPANCY_DISABLE_CACHING_OVERRIDE: Type = 1;
}
#[doc = " Occupancy calculator flag"]
pub use self::CUoccupancy_flags_enum::Type as CUoccupancy_flags;
pub mod CUarray_format_enum {
    #[doc = " Array formats"]
    pub type Type = ::std::os::raw::c_uint;
    #[doc = "< Unsigned 8-bit integers"]
    pub const CU_AD_FORMAT_UNSIGNED_INT8: Type = 1;
    #[doc = "< Unsigned 16-bit integers"]
    pub const CU_AD_FORMAT_UNSIGNED_INT16: Type = 2;
    #[doc = "< Unsigned 32-bit integers"]
    pub const CU_AD_FORMAT_UNSIGNED_INT32: Type = 3;
    #[doc = "< Signed 8-bit integers"]
    pub const CU_AD_FORMAT_SIGNED_INT8: Type = 8;
    #[doc = "< Signed 16-bit integers"]
    pub const CU_AD_FORMAT_SIGNED_INT16: Type = 9;
    #[doc = "< Signed 32-bit integers"]
    pub const CU_AD_FORMAT_SIGNED_INT32: Type = 10;
    #[doc = "< 16-bit floating point"]
    pub const CU_AD_FORMAT_HALF: Type = 16;
    #[doc = "< 32-bit floating point"]
    pub const CU_AD_FORMAT_FLOAT: Type = 32;
}
#[doc = " Array formats"]
pub use self::CUarray_format_enum::Type as CUarray_format;
pub mod CUaddress_mode_enum {
    #[doc = " Texture reference addressing modes"]
    pub type Type = ::std::os::raw::c_uint;
    #[doc = "< Wrapping address mode"]
    pub const CU_TR_ADDRESS_MODE_WRAP: Type = 0;
    #[doc = "< Clamp to edge address mode"]
    pub const CU_TR_ADDRESS_MODE_CLAMP: Type = 1;
    #[doc = "< Mirror address mode"]
    pub const CU_TR_ADDRESS_MODE_MIRROR: Type = 2;
    #[doc = "< Border address mode"]
    pub const CU_TR_ADDRESS_MODE_BORDER: Type = 3;
}
#[doc = " Texture reference addressing modes"]
pub use self::CUaddress_mode_enum::Type as CUaddress_mode;
pub mod CUfilter_mode_enum {
    #[doc = " Texture reference filtering modes"]
    pub type Type = ::std::os::raw::c_uint;
    #[doc = "< Point filter mode"]
    pub const CU_TR_FILTER_MODE_POINT: Type = 0;
    #[doc = "< Linear filter mode"]
    pub const CU_TR_FILTER_MODE_LINEAR: Type = 1;
}
#[doc = " Texture reference filtering modes"]
pub use self::CUfilter_mode_enum::Type as CUfilter_mode;
pub mod CUdevice_attribute_enum {
    #[doc = " Device properties"]
    pub type Type = ::std::os::raw::c_uint;
    #[doc = "< Maximum number of threads per block"]
    pub const CU_DEVICE_ATTRIBUTE_MAX_THREADS_PER_BLOCK: Type = 1;
    #[doc = "< Maximum block dimension X"]
    pub const CU_DEVICE_ATTRIBUTE_MAX_BLOCK_DIM_X: Type = 2;
    #[doc = "< Maximum block dimension Y"]
    pub const CU_DEVICE_ATTRIBUTE_MAX_BLOCK_DIM_Y: Type = 3;
    #[doc = "< Maximum block dimension Z"]
    pub const CU_DEVICE_ATTRIBUTE_MAX_BLOCK_DIM_Z: Type = 4;
    #[doc = "< Maximum grid dimension X"]
    pub const CU_DEVICE_ATTRIBUTE_MAX_GRID_DIM_X: Type = 5;
    #[doc = "< Maximum grid dimension Y"]
    pub const CU_DEVICE_ATTRIBUTE_MAX_GRID_DIM_Y: Type = 6;
    #[doc = "< Maximum grid dimension Z"]
    pub const CU_DEVICE_ATTRIBUTE_MAX_GRID_DIM_Z: Type = 7;
    #[doc = "< Maximum shared memory available per block in bytes"]
    pub const CU_DEVICE_ATTRIBUTE_MAX_SHARED_MEMORY_PER_BLOCK: Type = 8;
    #[doc = "< Deprecated, use CU_DEVICE_ATTRIBUTE_MAX_SHARED_MEMORY_PER_BLOCK"]
    pub const CU_DEVICE_ATTRIBUTE_SHARED_MEMORY_PER_BLOCK: Type = 8;
    #[doc = "< Memory available on device for __constant__ variables in a CUDA C kernel in bytes"]
    pub const CU_DEVICE_ATTRIBUTE_TOTAL_CONSTANT_MEMORY: Type = 9;
    #[doc = "< Warp size in threads"]
    pub const CU_DEVICE_ATTRIBUTE_WARP_SIZE: Type = 10;
    #[doc = "< Maximum pitch in bytes allowed by memory copies"]
    pub const CU_DEVICE_ATTRIBUTE_MAX_PITCH: Type = 11;
    #[doc = "< Maximum number of 32-bit registers available per block"]
    pub const CU_DEVICE_ATTRIBUTE_MAX_REGISTERS_PER_BLOCK: Type = 12;
    #[doc = "< Deprecated, use CU_DEVICE_ATTRIBUTE_MAX_REGISTERS_PER_BLOCK"]
    pub const CU_DEVICE_ATTRIBUTE_REGISTERS_PER_BLOCK: Type = 12;
    #[doc = "< Typical clock frequency in kilohertz"]
    pub const CU_DEVICE_ATTRIBUTE_CLOCK_RATE: Type = 13;
    #[doc = "< Alignment requirement for textures"]
    pub const CU_DEVICE_ATTRIBUTE_TEXTURE_ALIGNMENT: Type = 14;
    #[doc = "< Device can possibly copy memory and execute a kernel concurrently. Deprecated. Use instead CU_DEVICE_ATTRIBUTE_ASYNC_ENGINE_COUNT."]
    pub const CU_DEVICE_ATTRIBUTE_GPU_OVERLAP: Type = 15;
    #[doc = "< Number of multiprocessors on device"]
    pub const CU_DEVICE_ATTRIBUTE_MULTIPROCESSOR_COUNT: Type = 16;
    #[doc = "< Specifies whether there is a run time limit on kernels"]
    pub const CU_DEVICE_ATTRIBUTE_KERNEL_EXEC_TIMEOUT: Type = 17;
    #[doc = "< Device is integrated with host memory"]
    pub const CU_DEVICE_ATTRIBUTE_INTEGRATED: Type = 18;
    #[doc = "< Device can map host memory into CUDA address space"]
    pub const CU_DEVICE_ATTRIBUTE_CAN_MAP_HOST_MEMORY: Type = 19;
    #[doc = "< Compute mode (See ::CUcomputemode for details)"]
    pub const CU_DEVICE_ATTRIBUTE_COMPUTE_MODE: Type = 20;
    #[doc = "< Maximum 1D texture width"]
    pub const CU_DEVICE_ATTRIBUTE_MAXIMUM_TEXTURE1D_WIDTH: Type = 21;
    #[doc = "< Maximum 2D texture width"]
    pub const CU_DEVICE_ATTRIBUTE_MAXIMUM_TEXTURE2D_WIDTH: Type = 22;
    #[doc = "< Maximum 2D texture height"]
    pub const CU_DEVICE_ATTRIBUTE_MAXIMUM_TEXTURE2D_HEIGHT: Type = 23;
    #[doc = "< Maximum 3D texture width"]
    pub const CU_DEVICE_ATTRIBUTE_MAXIMUM_TEXTURE3D_WIDTH: Type = 24;
    #[doc = "< Maximum 3D texture height"]
    pub const CU_DEVICE_ATTRIBUTE_MAXIMUM_TEXTURE3D_HEIGHT: Type = 25;
    #[doc = "< Maximum 3D texture depth"]
    pub const CU_DEVICE_ATTRIBUTE_MAXIMUM_TEXTURE3D_DEPTH: Type = 26;
    #[doc = "< Maximum 2D layered texture width"]
    pub const CU_DEVICE_ATTRIBUTE_MAXIMUM_TEXTURE2D_LAYERED_WIDTH: Type = 27;
    #[doc = "< Maximum 2D layered texture height"]
    pub const CU_DEVICE_ATTRIBUTE_MAXIMUM_TEXTURE2D_LAYERED_HEIGHT: Type = 28;
    #[doc = "< Maximum layers in a 2D layered texture"]
    pub const CU_DEVICE_ATTRIBUTE_MAXIMUM_TEXTURE2D_LAYERED_LAYERS: Type = 29;
    #[doc = "< Deprecated, use CU_DEVICE_ATTRIBUTE_MAXIMUM_TEXTURE2D_LAYERED_WIDTH"]
    pub const CU_DEVICE_ATTRIBUTE_MAXIMUM_TEXTURE2D_ARRAY_WIDTH: Type = 27;
    #[doc = "< Deprecated, use CU_DEVICE_ATTRIBUTE_MAXIMUM_TEXTURE2D_LAYERED_HEIGHT"]
    pub const CU_DEVICE_ATTRIBUTE_MAXIMUM_TEXTURE2D_ARRAY_HEIGHT: Type = 28;
    #[doc = "< Deprecated, use CU_DEVICE_ATTRIBUTE_MAXIMUM_TEXTURE2D_LAYERED_LAYERS"]
    pub const CU_DEVICE_ATTRIBUTE_MAXIMUM_TEXTURE2D_ARRAY_NUMSLICES: Type = 29;
    #[doc = "< Alignment requirement for surfaces"]
    pub const CU_DEVICE_ATTRIBUTE_SURFACE_ALIGNMENT: Type = 30;
    #[doc = "< Device can possibly execute multiple kernels concurrently"]
    pub const CU_DEVICE_ATTRIBUTE_CONCURRENT_KERNELS: Type = 31;
    #[doc = "< Device has ECC support enabled"]
    pub const CU_DEVICE_ATTRIBUTE_ECC_ENABLED: Type = 32;
    #[doc = "< PCI bus ID of the device"]
    pub const CU_DEVICE_ATTRIBUTE_PCI_BUS_ID: Type = 33;
    #[doc = "< PCI device ID of the device"]
    pub const CU_DEVICE_ATTRIBUTE_PCI_DEVICE_ID: Type = 34;
    #[doc = "< Device is using TCC driver model"]
    pub const CU_DEVICE_ATTRIBUTE_TCC_DRIVER: Type = 35;
    #[doc = "< Peak memory clock frequency in kilohertz"]
    pub const CU_DEVICE_ATTRIBUTE_MEMORY_CLOCK_RATE: Type = 36;
    #[doc = "< Global memory bus width in bits"]
    pub const CU_DEVICE_ATTRIBUTE_GLOBAL_MEMORY_BUS_WIDTH: Type = 37;
    #[doc = "< Size of L2 cache in bytes"]
    pub const CU_DEVICE_ATTRIBUTE_L2_CACHE_SIZE: Type = 38;
    #[doc = "< Maximum resident threads per multiprocessor"]
    pub const CU_DEVICE_ATTRIBUTE_MAX_THREADS_PER_MULTIPROCESSOR: Type = 39;
    #[doc = "< Number of asynchronous engines"]
    pub const CU_DEVICE_ATTRIBUTE_ASYNC_ENGINE_COUNT: Type = 40;
    #[doc = "< Device shares a unified address space with the host"]
    pub const CU_DEVICE_ATTRIBUTE_UNIFIED_ADDRESSING: Type = 41;
    #[doc = "< Maximum 1D layered texture width"]
    pub const CU_DEVICE_ATTRIBUTE_MAXIMUM_TEXTURE1D_LAYERED_WIDTH: Type = 42;
    #[doc = "< Maximum layers in a 1D layered texture"]
    pub const CU_DEVICE_ATTRIBUTE_MAXIMUM_TEXTURE1D_LAYERED_LAYERS: Type = 43;
    #[doc = "< Deprecated, do not use."]
    pub const CU_DEVICE_ATTRIBUTE_CAN_TEX2D_GATHER: Type = 44;
    #[doc = "< Maximum 2D texture width if CUDA_ARRAY3D_TEXTURE_GATHER is set"]
    pub const CU_DEVICE_ATTRIBUTE_MAXIMUM_TEXTURE2D_GATHER_WIDTH: Type = 45;
    #[doc = "< Maximum 2D texture height if CUDA_ARRAY3D_TEXTURE_GATHER is set"]
    pub const CU_DEVICE_ATTRIBUTE_MAXIMUM_TEXTURE2D_GATHER_HEIGHT: Type = 46;
    #[doc = "< Alternate maximum 3D texture width"]
    pub const CU_DEVICE_ATTRIBUTE_MAXIMUM_TEXTURE3D_WIDTH_ALTERNATE: Type = 47;
    #[doc = "< Alternate maximum 3D texture height"]
    pub const CU_DEVICE_ATTRIBUTE_MAXIMUM_TEXTURE3D_HEIGHT_ALTERNATE: Type = 48;
    #[doc = "< Alternate maximum 3D texture depth"]
    pub const CU_DEVICE_ATTRIBUTE_MAXIMUM_TEXTURE3D_DEPTH_ALTERNATE: Type = 49;
    #[doc = "< PCI domain ID of the device"]
    pub const CU_DEVICE_ATTRIBUTE_PCI_DOMAIN_ID: Type = 50;
    #[doc = "< Pitch alignment requirement for textures"]
    pub const CU_DEVICE_ATTRIBUTE_TEXTURE_PITCH_ALIGNMENT: Type = 51;
    #[doc = "< Maximum cubemap texture width/height"]
    pub const CU_DEVICE_ATTRIBUTE_MAXIMUM_TEXTURECUBEMAP_WIDTH: Type = 52;
    #[doc = "< Maximum cubemap layered texture width/height"]
    pub const CU_DEVICE_ATTRIBUTE_MAXIMUM_TEXTURECUBEMAP_LAYERED_WIDTH: Type = 53;
    #[doc = "< Maximum layers in a cubemap layered texture"]
    pub const CU_DEVICE_ATTRIBUTE_MAXIMUM_TEXTURECUBEMAP_LAYERED_LAYERS: Type = 54;
    #[doc = "< Maximum 1D surface width"]
    pub const CU_DEVICE_ATTRIBUTE_MAXIMUM_SURFACE1D_WIDTH: Type = 55;
    #[doc = "< Maximum 2D surface width"]
    pub const CU_DEVICE_ATTRIBUTE_MAXIMUM_SURFACE2D_WIDTH: Type = 56;
    #[doc = "< Maximum 2D surface height"]
    pub const CU_DEVICE_ATTRIBUTE_MAXIMUM_SURFACE2D_HEIGHT: Type = 57;
    #[doc = "< Maximum 3D surface width"]
    pub const CU_DEVICE_ATTRIBUTE_MAXIMUM_SURFACE3D_WIDTH: Type = 58;
    #[doc = "< Maximum 3D surface height"]
    pub const CU_DEVICE_ATTRIBUTE_MAXIMUM_SURFACE3D_HEIGHT: Type = 59;
    #[doc = "< Maximum 3D surface depth"]
    pub const CU_DEVICE_ATTRIBUTE_MAXIMUM_SURFACE3D_DEPTH: Type = 60;
    #[doc = "< Maximum 1D layered surface width"]
    pub const CU_DEVICE_ATTRIBUTE_MAXIMUM_SURFACE1D_LAYERED_WIDTH: Type = 61;
    #[doc = "< Maximum layers in a 1D layered surface"]
    pub const CU_DEVICE_ATTRIBUTE_MAXIMUM_SURFACE1D_LAYERED_LAYERS: Type = 62;
    #[doc = "< Maximum 2D layered surface width"]
    pub const CU_DEVICE_ATTRIBUTE_MAXIMUM_SURFACE2D_LAYERED_WIDTH: Type = 63;
    #[doc = "< Maximum 2D layered surface height"]
    pub const CU_DEVICE_ATTRIBUTE_MAXIMUM_SURFACE2D_LAYERED_HEIGHT: Type = 64;
    #[doc = "< Maximum layers in a 2D layered surface"]
    pub const CU_DEVICE_ATTRIBUTE_MAXIMUM_SURFACE2D_LAYERED_LAYERS: Type = 65;
    #[doc = "< Maximum cubemap surface width"]
    pub const CU_DEVICE_ATTRIBUTE_MAXIMUM_SURFACECUBEMAP_WIDTH: Type = 66;
    #[doc = "< Maximum cubemap layered surface width"]
    pub const CU_DEVICE_ATTRIBUTE_MAXIMUM_SURFACECUBEMAP_LAYERED_WIDTH: Type = 67;
    #[doc = "< Maximum layers in a cubemap layered surface"]
    pub const CU_DEVICE_ATTRIBUTE_MAXIMUM_SURFACECUBEMAP_LAYERED_LAYERS: Type = 68;
    #[doc = "< Maximum 1D linear texture width"]
    pub const CU_DEVICE_ATTRIBUTE_MAXIMUM_TEXTURE1D_LINEAR_WIDTH: Type = 69;
    #[doc = "< Maximum 2D linear texture width"]
    pub const CU_DEVICE_ATTRIBUTE_MAXIMUM_TEXTURE2D_LINEAR_WIDTH: Type = 70;
    #[doc = "< Maximum 2D linear texture height"]
    pub const CU_DEVICE_ATTRIBUTE_MAXIMUM_TEXTURE2D_LINEAR_HEIGHT: Type = 71;
    #[doc = "< Maximum 2D linear texture pitch in bytes"]
    pub const CU_DEVICE_ATTRIBUTE_MAXIMUM_TEXTURE2D_LINEAR_PITCH: Type = 72;
    #[doc = "< Maximum mipmapped 2D texture width"]
    pub const CU_DEVICE_ATTRIBUTE_MAXIMUM_TEXTURE2D_MIPMAPPED_WIDTH: Type = 73;
    #[doc = "< Maximum mipmapped 2D texture height"]
    pub const CU_DEVICE_ATTRIBUTE_MAXIMUM_TEXTURE2D_MIPMAPPED_HEIGHT: Type = 74;
    #[doc = "< Major compute capability version number"]
    pub const CU_DEVICE_ATTRIBUTE_COMPUTE_CAPABILITY_MAJOR: Type = 75;
    #[doc = "< Minor compute capability version number"]
    pub const CU_DEVICE_ATTRIBUTE_COMPUTE_CAPABILITY_MINOR: Type = 76;
    #[doc = "< Maximum mipmapped 1D texture width"]
    pub const CU_DEVICE_ATTRIBUTE_MAXIMUM_TEXTURE1D_MIPMAPPED_WIDTH: Type = 77;
    #[doc = "< Device supports stream priorities"]
    pub const CU_DEVICE_ATTRIBUTE_STREAM_PRIORITIES_SUPPORTED: Type = 78;
    #[doc = "< Device supports caching globals in L1"]
    pub const CU_DEVICE_ATTRIBUTE_GLOBAL_L1_CACHE_SUPPORTED: Type = 79;
    #[doc = "< Device supports caching locals in L1"]
    pub const CU_DEVICE_ATTRIBUTE_LOCAL_L1_CACHE_SUPPORTED: Type = 80;
    #[doc = "< Maximum shared memory available per multiprocessor in bytes"]
    pub const CU_DEVICE_ATTRIBUTE_MAX_SHARED_MEMORY_PER_MULTIPROCESSOR: Type = 81;
    #[doc = "< Maximum number of 32-bit registers available per multiprocessor"]
    pub const CU_DEVICE_ATTRIBUTE_MAX_REGISTERS_PER_MULTIPROCESSOR: Type = 82;
    #[doc = "< Device can allocate managed memory on this system"]
    pub const CU_DEVICE_ATTRIBUTE_MANAGED_MEMORY: Type = 83;
    #[doc = "< Device is on a multi-GPU board"]
    pub const CU_DEVICE_ATTRIBUTE_MULTI_GPU_BOARD: Type = 84;
    #[doc = "< Unique id for a group of devices on the same multi-GPU board"]
    pub const CU_DEVICE_ATTRIBUTE_MULTI_GPU_BOARD_GROUP_ID: Type = 85;
    #[doc = "< Link between the device and the host supports native atomic operations (this is a placeholder attribute, and is not supported on any current hardware)"]
    pub const CU_DEVICE_ATTRIBUTE_HOST_NATIVE_ATOMIC_SUPPORTED: Type = 86;
    #[doc = "< Ratio of single precision performance (in floating-point operations per second) to double precision performance"]
    pub const CU_DEVICE_ATTRIBUTE_SINGLE_TO_DOUBLE_PRECISION_PERF_RATIO: Type = 87;
    #[doc = "< Device supports coherently accessing pageable memory without calling cudaHostRegister on it"]
    pub const CU_DEVICE_ATTRIBUTE_PAGEABLE_MEMORY_ACCESS: Type = 88;
    #[doc = "< Device can coherently access managed memory concurrently with the CPU"]
    pub const CU_DEVICE_ATTRIBUTE_CONCURRENT_MANAGED_ACCESS: Type = 89;
    #[doc = "< Device supports compute preemption."]
    pub const CU_DEVICE_ATTRIBUTE_COMPUTE_PREEMPTION_SUPPORTED: Type = 90;
    #[doc = "< Device can access host registered memory at the same virtual address as the CPU"]
    pub const CU_DEVICE_ATTRIBUTE_CAN_USE_HOST_POINTER_FOR_REGISTERED_MEM: Type = 91;
    #[doc = "< ::cuStreamBatchMemOp and related APIs are supported."]
    pub const CU_DEVICE_ATTRIBUTE_CAN_USE_STREAM_MEM_OPS: Type = 92;
    #[doc = "< 64-bit operations are supported in ::cuStreamBatchMemOp and related APIs."]
    pub const CU_DEVICE_ATTRIBUTE_CAN_USE_64_BIT_STREAM_MEM_OPS: Type = 93;
    #[doc = "< ::CU_STREAM_WAIT_VALUE_NOR is supported."]
    pub const CU_DEVICE_ATTRIBUTE_CAN_USE_STREAM_WAIT_VALUE_NOR: Type = 94;
    #[doc = "< Device supports launching cooperative kernels via ::cuLaunchCooperativeKernel"]
    pub const CU_DEVICE_ATTRIBUTE_COOPERATIVE_LAUNCH: Type = 95;
    #[doc = "< Device can participate in cooperative kernels launched via ::cuLaunchCooperativeKernelMultiDevice"]
    pub const CU_DEVICE_ATTRIBUTE_COOPERATIVE_MULTI_DEVICE_LAUNCH: Type = 96;
    #[doc = "< Maximum optin shared memory per block"]
    pub const CU_DEVICE_ATTRIBUTE_MAX_SHARED_MEMORY_PER_BLOCK_OPTIN: Type = 97;
    #[doc = "< Both the ::CU_STREAM_WAIT_VALUE_FLUSH flag and the ::CU_STREAM_MEM_OP_FLUSH_REMOTE_WRITES MemOp are supported on the device. See \\ref CUDA_MEMOP for additional details."]
    pub const CU_DEVICE_ATTRIBUTE_CAN_FLUSH_REMOTE_WRITES: Type = 98;
    #[doc = "< Device supports host memory registration via ::cudaHostRegister."]
    pub const CU_DEVICE_ATTRIBUTE_HOST_REGISTER_SUPPORTED: Type = 99;
    #[doc = "< Device accesses pageable memory via the host's page tables."]
    pub const CU_DEVICE_ATTRIBUTE_PAGEABLE_MEMORY_ACCESS_USES_HOST_PAGE_TABLES: Type = 100;
    #[doc = "< The host can directly access managed memory on the device without migration."]
    pub const CU_DEVICE_ATTRIBUTE_DIRECT_MANAGED_MEM_ACCESS_FROM_HOST: Type = 101;
    pub const CU_DEVICE_ATTRIBUTE_MAX: Type = 102;
}
#[doc = " Device properties"]
pub use self::CUdevice_attribute_enum::Type as CUdevice_attribute;
#[doc = " Legacy device properties"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CUdevprop_st {
    #[doc = "< Maximum number of threads per block"]
    pub maxThreadsPerBlock: ::std::os::raw::c_int,
    #[doc = "< Maximum size of each dimension of a block"]
    pub maxThreadsDim: [::std::os::raw::c_int; 3usize],
    #[doc = "< Maximum size of each dimension of a grid"]
    pub maxGridSize: [::std::os::raw::c_int; 3usize],
    #[doc = "< Shared memory available per block in bytes"]
    pub sharedMemPerBlock: ::std::os::raw::c_int,
    #[doc = "< Constant memory available on device in bytes"]
    pub totalConstantMemory: ::std::os::raw::c_int,
    #[doc = "< Warp size in threads"]
    pub SIMDWidth: ::std::os::raw::c_int,
    #[doc = "< Maximum pitch in bytes allowed by memory copies"]
    pub memPitch: ::std::os::raw::c_int,
    #[doc = "< 32-bit registers available per block"]
    pub regsPerBlock: ::std::os::raw::c_int,
    #[doc = "< Clock frequency in kilohertz"]
    pub clockRate: ::std::os::raw::c_int,
    #[doc = "< Alignment requirement for textures"]
    pub textureAlign: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of CUdevprop_st"][::std::mem::size_of::<CUdevprop_st>() - 56usize];
    ["Alignment of CUdevprop_st"][::std::mem::align_of::<CUdevprop_st>() - 4usize];
    ["Offset of field: CUdevprop_st::maxThreadsPerBlock"]
        [::std::mem::offset_of!(CUdevprop_st, maxThreadsPerBlock) - 0usize];
    ["Offset of field: CUdevprop_st::maxThreadsDim"]
        [::std::mem::offset_of!(CUdevprop_st, maxThreadsDim) - 4usize];
    ["Offset of field: CUdevprop_st::maxGridSize"]
        [::std::mem::offset_of!(CUdevprop_st, maxGridSize) - 16usize];
    ["Offset of field: CUdevprop_st::sharedMemPerBlock"]
        [::std::mem::offset_of!(CUdevprop_st, sharedMemPerBlock) - 28usize];
    ["Offset of field: CUdevprop_st::totalConstantMemory"]
        [::std::mem::offset_of!(CUdevprop_st, totalConstantMemory) - 32usize];
    ["Offset of field: CUdevprop_st::SIMDWidth"]
        [::std::mem::offset_of!(CUdevprop_st, SIMDWidth) - 36usize];
    ["Offset of field: CUdevprop_st::memPitch"]
        [::std::mem::offset_of!(CUdevprop_st, memPitch) - 40usize];
    ["Offset of field: CUdevprop_st::regsPerBlock"]
        [::std::mem::offset_of!(CUdevprop_st, regsPerBlock) - 44usize];
    ["Offset of field: CUdevprop_st::clockRate"]
        [::std::mem::offset_of!(CUdevprop_st, clockRate) - 48usize];
    ["Offset of field: CUdevprop_st::textureAlign"]
        [::std::mem::offset_of!(CUdevprop_st, textureAlign) - 52usize];
};
#[doc = " Legacy device properties"]
pub type CUdevprop = CUdevprop_st;
pub mod CUpointer_attribute_enum {
    #[doc = " Pointer information"]
    pub type Type = ::std::os::raw::c_uint;
    #[doc = "< The ::CUcontext on which a pointer was allocated or registered"]
    pub const CU_POINTER_ATTRIBUTE_CONTEXT: Type = 1;
    #[doc = "< The ::CUmemorytype describing the physical location of a pointer"]
    pub const CU_POINTER_ATTRIBUTE_MEMORY_TYPE: Type = 2;
    #[doc = "< The address at which a pointer's memory may be accessed on the device"]
    pub const CU_POINTER_ATTRIBUTE_DEVICE_POINTER: Type = 3;
    #[doc = "< The address at which a pointer's memory may be accessed on the host"]
    pub const CU_POINTER_ATTRIBUTE_HOST_POINTER: Type = 4;
    #[doc = "< A pair of tokens for use with the nv-p2p.h Linux kernel interface"]
    pub const CU_POINTER_ATTRIBUTE_P2P_TOKENS: Type = 5;
    #[doc = "< Synchronize every synchronous memory operation initiated on this region"]
    pub const CU_POINTER_ATTRIBUTE_SYNC_MEMOPS: Type = 6;
    #[doc = "< A process-wide unique ID for an allocated memory region"]
    pub const CU_POINTER_ATTRIBUTE_BUFFER_ID: Type = 7;
    #[doc = "< Indicates if the pointer points to managed memory"]
    pub const CU_POINTER_ATTRIBUTE_IS_MANAGED: Type = 8;
    #[doc = "< A device ordinal of a device on which a pointer was allocated or registered"]
    pub const CU_POINTER_ATTRIBUTE_DEVICE_ORDINAL: Type = 9;
}
#[doc = " Pointer information"]
pub use self::CUpointer_attribute_enum::Type as CUpointer_attribute;
pub mod CUfunction_attribute_enum {
    #[doc = " Function properties"]
    pub type Type = ::std::os::raw::c_uint;
    #[doc = " The maximum number of threads per block, beyond which a launch of the\n function would fail. This number depends on both the function and the\n device on which the function is currently loaded."]
    pub const CU_FUNC_ATTRIBUTE_MAX_THREADS_PER_BLOCK: Type = 0;
    #[doc = " The size in bytes of statically-allocated shared memory required by\n this function. This does not include dynamically-allocated shared\n memory requested by the user at runtime."]
    pub const CU_FUNC_ATTRIBUTE_SHARED_SIZE_BYTES: Type = 1;
    #[doc = " The size in bytes of user-allocated constant memory required by this\n function."]
    pub const CU_FUNC_ATTRIBUTE_CONST_SIZE_BYTES: Type = 2;
    #[doc = " The size in bytes of local memory used by each thread of this function."]
    pub const CU_FUNC_ATTRIBUTE_LOCAL_SIZE_BYTES: Type = 3;
    #[doc = " The number of registers used by each thread of this function."]
    pub const CU_FUNC_ATTRIBUTE_NUM_REGS: Type = 4;
    #[doc = " The PTX virtual architecture version for which the function was\n compiled. This value is the major PTX version * 10 + the minor PTX\n version, so a PTX version 1.3 function would return the value 13.\n Note that this may return the undefined value of 0 for cubins\n compiled prior to CUDA 3.0."]
    pub const CU_FUNC_ATTRIBUTE_PTX_VERSION: Type = 5;
    #[doc = " The binary architecture version for which the function was compiled.\n This value is the major binary version * 10 + the minor binary version,\n so a binary version 1.3 function would return the value 13. Note that\n this will return a value of 10 for legacy cubins that do not have a\n properly-encoded binary architecture version."]
    pub const CU_FUNC_ATTRIBUTE_BINARY_VERSION: Type = 6;
    #[doc = " The attribute to indicate whether the function has been compiled with\n user specified option \"-Xptxas --dlcm=ca\" set ."]
    pub const CU_FUNC_ATTRIBUTE_CACHE_MODE_CA: Type = 7;
    #[doc = " The maximum size in bytes of dynamically-allocated shared memory that can be used by\n this function. If the user-specified dynamic shared memory size is larger than this\n value, the launch will fail."]
    pub const CU_FUNC_ATTRIBUTE_MAX_DYNAMIC_SHARED_SIZE_BYTES: Type = 8;
    #[doc = " On devices where the L1 cache and shared memory use the same hardware resources,\n this sets the shared memory carveout preference, in percent of the total resources.\n This is only a hint, and the driver can choose a different ratio if required to execute the function."]
    pub const CU_FUNC_ATTRIBUTE_PREFERRED_SHARED_MEMORY_CARVEOUT: Type = 9;
    #[doc = " On devices where the L1 cache and shared memory use the same hardware resources,\n this sets the shared memory carveout preference, in percent of the total resources.\n This is only a hint, and the driver can choose a different ratio if required to execute the function."]
    pub const CU_FUNC_ATTRIBUTE_MAX: Type = 10;
}
#[doc = " Function properties"]
pub use self::CUfunction_attribute_enum::Type as CUfunction_attribute;
pub mod CUfunc_cache_enum {
    #[doc = " Function cache configurations"]
    pub type Type = ::std::os::raw::c_uint;
    #[doc = "< no preference for shared memory or L1 (default)"]
    pub const CU_FUNC_CACHE_PREFER_NONE: Type = 0;
    #[doc = "< prefer larger shared memory and smaller L1 cache"]
    pub const CU_FUNC_CACHE_PREFER_SHARED: Type = 1;
    #[doc = "< prefer larger L1 cache and smaller shared memory"]
    pub const CU_FUNC_CACHE_PREFER_L1: Type = 2;
    #[doc = "< prefer equal sized L1 cache and shared memory"]
    pub const CU_FUNC_CACHE_PREFER_EQUAL: Type = 3;
}
#[doc = " Function cache configurations"]
pub use self::CUfunc_cache_enum::Type as CUfunc_cache;
pub mod CUsharedconfig_enum {
    #[doc = " Shared memory configurations"]
    pub type Type = ::std::os::raw::c_uint;
    #[doc = "< set default shared memory bank size"]
    pub const CU_SHARED_MEM_CONFIG_DEFAULT_BANK_SIZE: Type = 0;
    #[doc = "< set shared memory bank width to four bytes"]
    pub const CU_SHARED_MEM_CONFIG_FOUR_BYTE_BANK_SIZE: Type = 1;
    #[doc = "< set shared memory bank width to eight bytes"]
    pub const CU_SHARED_MEM_CONFIG_EIGHT_BYTE_BANK_SIZE: Type = 2;
}
#[doc = " Shared memory configurations"]
pub use self::CUsharedconfig_enum::Type as CUsharedconfig;
pub mod CUshared_carveout_enum {
    #[doc = " Shared memory carveout configurations"]
    pub type Type = ::std::os::raw::c_int;
    pub const CU_SHAREDMEM_CARVEOUT_DEFAULT: Type = -1;
    #[doc = " < no preference for shared memory or L1 (default)"]
    pub const CU_SHAREDMEM_CARVEOUT_MAX_SHARED: Type = 100;
    #[doc = " < prefer maximum available shared memory, minimum L1 cache"]
    pub const CU_SHAREDMEM_CARVEOUT_MAX_L1: Type = 0;
}
#[doc = " Shared memory carveout configurations"]
pub use self::CUshared_carveout_enum::Type as CUshared_carveout;
pub mod CUmemorytype_enum {
    #[doc = " Memory types"]
    pub type Type = ::std::os::raw::c_uint;
    #[doc = "< Host memory"]
    pub const CU_MEMORYTYPE_HOST: Type = 1;
    #[doc = "< Device memory"]
    pub const CU_MEMORYTYPE_DEVICE: Type = 2;
    #[doc = "< Array memory"]
    pub const CU_MEMORYTYPE_ARRAY: Type = 3;
    #[doc = "< Unified device or host memory"]
    pub const CU_MEMORYTYPE_UNIFIED: Type = 4;
}
#[doc = " Memory types"]
pub use self::CUmemorytype_enum::Type as CUmemorytype;
pub mod CUcomputemode_enum {
    #[doc = " Compute Modes"]
    pub type Type = ::std::os::raw::c_uint;
    #[doc = "< Default compute mode (Multiple contexts allowed per device)"]
    pub const CU_COMPUTEMODE_DEFAULT: Type = 0;
    #[doc = "< Compute-prohibited mode (No contexts can be created on this device at this time)"]
    pub const CU_COMPUTEMODE_PROHIBITED: Type = 2;
    #[doc = "< Compute-exclusive-process mode (Only one context used by a single process can be present on this device at a time)"]
    pub const CU_COMPUTEMODE_EXCLUSIVE_PROCESS: Type = 3;
}
#[doc = " Compute Modes"]
pub use self::CUcomputemode_enum::Type as CUcomputemode;
pub mod CUmem_advise_enum {
    #[doc = " Memory advise values"]
    pub type Type = ::std::os::raw::c_uint;
    #[doc = "< Data will mostly be read and only occassionally be written to"]
    pub const CU_MEM_ADVISE_SET_READ_MOSTLY: Type = 1;
    #[doc = "< Undo the effect of ::CU_MEM_ADVISE_SET_READ_MOSTLY"]
    pub const CU_MEM_ADVISE_UNSET_READ_MOSTLY: Type = 2;
    #[doc = "< Set the preferred location for the data as the specified device"]
    pub const CU_MEM_ADVISE_SET_PREFERRED_LOCATION: Type = 3;
    #[doc = "< Clear the preferred location for the data"]
    pub const CU_MEM_ADVISE_UNSET_PREFERRED_LOCATION: Type = 4;
    #[doc = "< Data will be accessed by the specified device, so prevent page faults as much as possible"]
    pub const CU_MEM_ADVISE_SET_ACCESSED_BY: Type = 5;
    #[doc = "< Let the Unified Memory subsystem decide on the page faulting policy for the specified device"]
    pub const CU_MEM_ADVISE_UNSET_ACCESSED_BY: Type = 6;
}
#[doc = " Memory advise values"]
pub use self::CUmem_advise_enum::Type as CUmem_advise;
pub mod CUmem_range_attribute_enum {
    pub type Type = ::std::os::raw::c_uint;
    #[doc = "< Whether the range will mostly be read and only occassionally be written to"]
    pub const CU_MEM_RANGE_ATTRIBUTE_READ_MOSTLY: Type = 1;
    #[doc = "< The preferred location of the range"]
    pub const CU_MEM_RANGE_ATTRIBUTE_PREFERRED_LOCATION: Type = 2;
    #[doc = "< Memory range has ::CU_MEM_ADVISE_SET_ACCESSED_BY set for specified device"]
    pub const CU_MEM_RANGE_ATTRIBUTE_ACCESSED_BY: Type = 3;
    #[doc = "< The last location to which the range was prefetched"]
    pub const CU_MEM_RANGE_ATTRIBUTE_LAST_PREFETCH_LOCATION: Type = 4;
}
pub use self::CUmem_range_attribute_enum::Type as CUmem_range_attribute;
pub mod CUjit_option_enum {
    #[doc = " Online compiler and linker options"]
    pub type Type = ::std::os::raw::c_uint;
    #[doc = " Max number of registers that a thread may use.\\n\n Option type: unsigned int\\n\n Applies to: compiler only"]
    pub const CU_JIT_MAX_REGISTERS: Type = 0;
    #[doc = " IN: Specifies minimum number of threads per block to target compilation\n for\\n\n OUT: Returns the number of threads the compiler actually targeted.\n This restricts the resource utilization fo the compiler (e.g. max\n registers) such that a block with the given number of threads should be\n able to launch based on register limitations. Note, this option does not\n currently take into account any other resource limitations, such as\n shared memory utilization.\\n\n Cannot be combined with ::CU_JIT_TARGET.\\n\n Option type: unsigned int\\n\n Applies to: compiler only"]
    pub const CU_JIT_THREADS_PER_BLOCK: Type = 1;
    #[doc = " Overwrites the option value with the total wall clock time, in\n milliseconds, spent in the compiler and linker\\n\n Option type: float\\n\n Applies to: compiler and linker"]
    pub const CU_JIT_WALL_TIME: Type = 2;
    #[doc = " Pointer to a buffer in which to print any log messages\n that are informational in nature (the buffer size is specified via\n option ::CU_JIT_INFO_LOG_BUFFER_SIZE_BYTES)\\n\n Option type: char *\\n\n Applies to: compiler and linker"]
    pub const CU_JIT_INFO_LOG_BUFFER: Type = 3;
    #[doc = " IN: Log buffer size in bytes.  Log messages will be capped at this size\n (including null terminator)\\n\n OUT: Amount of log buffer filled with messages\\n\n Option type: unsigned int\\n\n Applies to: compiler and linker"]
    pub const CU_JIT_INFO_LOG_BUFFER_SIZE_BYTES: Type = 4;
    #[doc = " Pointer to a buffer in which to print any log messages that\n reflect errors (the buffer size is specified via option\n ::CU_JIT_ERROR_LOG_BUFFER_SIZE_BYTES)\\n\n Option type: char *\\n\n Applies to: compiler and linker"]
    pub const CU_JIT_ERROR_LOG_BUFFER: Type = 5;
    #[doc = " IN: Log buffer size in bytes.  Log messages will be capped at this size\n (including null terminator)\\n\n OUT: Amount of log buffer filled with messages\\n\n Option type: unsigned int\\n\n Applies to: compiler and linker"]
    pub const CU_JIT_ERROR_LOG_BUFFER_SIZE_BYTES: Type = 6;
    #[doc = " Level of optimizations to apply to generated code (0 - 4), with 4\n being the default and highest level of optimizations.\\n\n Option type: unsigned int\\n\n Applies to: compiler only"]
    pub const CU_JIT_OPTIMIZATION_LEVEL: Type = 7;
    #[doc = " No option value required. Determines the target based on the current\n attached context (default)\\n\n Option type: No option value needed\\n\n Applies to: compiler and linker"]
    pub const CU_JIT_TARGET_FROM_CUCONTEXT: Type = 8;
    #[doc = " Target is chosen based on supplied ::CUjit_target.  Cannot be\n combined with ::CU_JIT_THREADS_PER_BLOCK.\\n\n Option type: unsigned int for enumerated type ::CUjit_target\\n\n Applies to: compiler and linker"]
    pub const CU_JIT_TARGET: Type = 9;
    #[doc = " Specifies choice of fallback strategy if matching cubin is not found.\n Choice is based on supplied ::CUjit_fallback.  This option cannot be\n used with cuLink* APIs as the linker requires exact matches.\\n\n Option type: unsigned int for enumerated type ::CUjit_fallback\\n\n Applies to: compiler only"]
    pub const CU_JIT_FALLBACK_STRATEGY: Type = 10;
    #[doc = " Specifies whether to create debug information in output (-g)\n (0: false, default)\\n\n Option type: int\\n\n Applies to: compiler and linker"]
    pub const CU_JIT_GENERATE_DEBUG_INFO: Type = 11;
    #[doc = " Generate verbose log messages (0: false, default)\\n\n Option type: int\\n\n Applies to: compiler and linker"]
    pub const CU_JIT_LOG_VERBOSE: Type = 12;
    #[doc = " Generate line number information (-lineinfo) (0: false, default)\\n\n Option type: int\\n\n Applies to: compiler only"]
    pub const CU_JIT_GENERATE_LINE_INFO: Type = 13;
    #[doc = " Specifies whether to enable caching explicitly (-dlcm) \\n\n Choice is based on supplied ::CUjit_cacheMode_enum.\\n\n Option type: unsigned int for enumerated type ::CUjit_cacheMode_enum\\n\n Applies to: compiler only"]
    pub const CU_JIT_CACHE_MODE: Type = 14;
    #[doc = " The below jit options are used for internal purposes only, in this version of CUDA"]
    pub const CU_JIT_NEW_SM3X_OPT: Type = 15;
    #[doc = " The below jit options are used for internal purposes only, in this version of CUDA"]
    pub const CU_JIT_FAST_COMPILE: Type = 16;
    #[doc = " Array of device symbol names that will be relocated to the corresponing\n host addresses stored in ::CU_JIT_GLOBAL_SYMBOL_ADDRESSES.\\n\n Must contain ::CU_JIT_GLOBAL_SYMBOL_COUNT entries.\\n\n When loding a device module, driver will relocate all encountered\n unresolved symbols to the host addresses.\\n\n It is only allowed to register symbols that correspond to unresolved\n global variables.\\n\n It is illegal to register the same device symbol at multiple addresses.\\n\n Option type: const char **\\n\n Applies to: dynamic linker only"]
    pub const CU_JIT_GLOBAL_SYMBOL_NAMES: Type = 17;
    #[doc = " Array of host addresses that will be used to relocate corresponding\n device symbols stored in ::CU_JIT_GLOBAL_SYMBOL_NAMES.\\n\n Must contain ::CU_JIT_GLOBAL_SYMBOL_COUNT entries.\\n\n Option type: void **\\n\n Applies to: dynamic linker only"]
    pub const CU_JIT_GLOBAL_SYMBOL_ADDRESSES: Type = 18;
    #[doc = " Number of entries in ::CU_JIT_GLOBAL_SYMBOL_NAMES and\n ::CU_JIT_GLOBAL_SYMBOL_ADDRESSES arrays.\\n\n Option type: unsigned int\\n\n Applies to: dynamic linker only"]
    pub const CU_JIT_GLOBAL_SYMBOL_COUNT: Type = 19;
    #[doc = " Number of entries in ::CU_JIT_GLOBAL_SYMBOL_NAMES and\n ::CU_JIT_GLOBAL_SYMBOL_ADDRESSES arrays.\\n\n Option type: unsigned int\\n\n Applies to: dynamic linker only"]
    pub const CU_JIT_NUM_OPTIONS: Type = 20;
}
#[doc = " Online compiler and linker options"]
pub use self::CUjit_option_enum::Type as CUjit_option;
pub mod CUjit_target_enum {
    #[doc = " Online compilation targets"]
    pub type Type = ::std::os::raw::c_uint;
    #[doc = "< Compute device class 2.0"]
    pub const CU_TARGET_COMPUTE_20: Type = 20;
    #[doc = "< Compute device class 2.1"]
    pub const CU_TARGET_COMPUTE_21: Type = 21;
    #[doc = "< Compute device class 3.0"]
    pub const CU_TARGET_COMPUTE_30: Type = 30;
    #[doc = "< Compute device class 3.2"]
    pub const CU_TARGET_COMPUTE_32: Type = 32;
    #[doc = "< Compute device class 3.5"]
    pub const CU_TARGET_COMPUTE_35: Type = 35;
    #[doc = "< Compute device class 3.7"]
    pub const CU_TARGET_COMPUTE_37: Type = 37;
    #[doc = "< Compute device class 5.0"]
    pub const CU_TARGET_COMPUTE_50: Type = 50;
    #[doc = "< Compute device class 5.2"]
    pub const CU_TARGET_COMPUTE_52: Type = 52;
    #[doc = "< Compute device class 5.3"]
    pub const CU_TARGET_COMPUTE_53: Type = 53;
    #[doc = "< Compute device class 6.0."]
    pub const CU_TARGET_COMPUTE_60: Type = 60;
    #[doc = "< Compute device class 6.1."]
    pub const CU_TARGET_COMPUTE_61: Type = 61;
    #[doc = "< Compute device class 6.2."]
    pub const CU_TARGET_COMPUTE_62: Type = 62;
    #[doc = "< Compute device class 7.0."]
    pub const CU_TARGET_COMPUTE_70: Type = 70;
    #[doc = "< Compute device class 7.5."]
    pub const CU_TARGET_COMPUTE_75: Type = 75;
}
#[doc = " Online compilation targets"]
pub use self::CUjit_target_enum::Type as CUjit_target;
pub mod CUjit_fallback_enum {
    #[doc = " Cubin matching fallback strategies"]
    pub type Type = ::std::os::raw::c_uint;
    #[doc = "< Prefer to compile ptx if exact binary match not found"]
    pub const CU_PREFER_PTX: Type = 0;
    #[doc = "< Prefer to fall back to compatible binary code if exact match not found"]
    pub const CU_PREFER_BINARY: Type = 1;
}
#[doc = " Cubin matching fallback strategies"]
pub use self::CUjit_fallback_enum::Type as CUjit_fallback;
pub mod CUjit_cacheMode_enum {
    #[doc = " Caching modes for dlcm"]
    pub type Type = ::std::os::raw::c_uint;
    #[doc = "< Compile with no -dlcm flag specified"]
    pub const CU_JIT_CACHE_OPTION_NONE: Type = 0;
    #[doc = "< Compile with L1 cache disabled"]
    pub const CU_JIT_CACHE_OPTION_CG: Type = 1;
    #[doc = "< Compile with L1 cache enabled"]
    pub const CU_JIT_CACHE_OPTION_CA: Type = 2;
}
#[doc = " Caching modes for dlcm"]
pub use self::CUjit_cacheMode_enum::Type as CUjit_cacheMode;
pub mod CUjitInputType_enum {
    #[doc = " Device code formats"]
    pub type Type = ::std::os::raw::c_uint;
    #[doc = " Compiled device-class-specific device code\\n\n Applicable options: none"]
    pub const CU_JIT_INPUT_CUBIN: Type = 0;
    #[doc = " PTX source code\\n\n Applicable options: PTX compiler options"]
    pub const CU_JIT_INPUT_PTX: Type = 1;
    #[doc = " Bundle of multiple cubins and/or PTX of some device code\\n\n Applicable options: PTX compiler options, ::CU_JIT_FALLBACK_STRATEGY"]
    pub const CU_JIT_INPUT_FATBINARY: Type = 2;
    #[doc = " Host object with embedded device code\\n\n Applicable options: PTX compiler options, ::CU_JIT_FALLBACK_STRATEGY"]
    pub const CU_JIT_INPUT_OBJECT: Type = 3;
    #[doc = " Archive of host objects with embedded device code\\n\n Applicable options: PTX compiler options, ::CU_JIT_FALLBACK_STRATEGY"]
    pub const CU_JIT_INPUT_LIBRARY: Type = 4;
    #[doc = " Archive of host objects with embedded device code\\n\n Applicable options: PTX compiler options, ::CU_JIT_FALLBACK_STRATEGY"]
    pub const CU_JIT_NUM_INPUT_TYPES: Type = 5;
}
#[doc = " Device code formats"]
pub use self::CUjitInputType_enum::Type as CUjitInputType;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CUlinkState_st {
    _unused: [u8; 0],
}
pub type CUlinkState = *mut CUlinkState_st;
pub mod CUgraphicsRegisterFlags_enum {
    #[doc = " Flags to register a graphics resource"]
    pub type Type = ::std::os::raw::c_uint;
    pub const CU_GRAPHICS_REGISTER_FLAGS_NONE: Type = 0;
    pub const CU_GRAPHICS_REGISTER_FLAGS_READ_ONLY: Type = 1;
    pub const CU_GRAPHICS_REGISTER_FLAGS_WRITE_DISCARD: Type = 2;
    pub const CU_GRAPHICS_REGISTER_FLAGS_SURFACE_LDST: Type = 4;
    pub const CU_GRAPHICS_REGISTER_FLAGS_TEXTURE_GATHER: Type = 8;
}
#[doc = " Flags to register a graphics resource"]
pub use self::CUgraphicsRegisterFlags_enum::Type as CUgraphicsRegisterFlags;
pub mod CUgraphicsMapResourceFlags_enum {
    #[doc = " Flags for mapping and unmapping interop resources"]
    pub type Type = ::std::os::raw::c_uint;
    pub const CU_GRAPHICS_MAP_RESOURCE_FLAGS_NONE: Type = 0;
    pub const CU_GRAPHICS_MAP_RESOURCE_FLAGS_READ_ONLY: Type = 1;
    pub const CU_GRAPHICS_MAP_RESOURCE_FLAGS_WRITE_DISCARD: Type = 2;
}
#[doc = " Flags for mapping and unmapping interop resources"]
pub use self::CUgraphicsMapResourceFlags_enum::Type as CUgraphicsMapResourceFlags;
pub mod CUarray_cubemap_face_enum {
    #[doc = " Array indices for cube faces"]
    pub type Type = ::std::os::raw::c_uint;
    #[doc = "< Positive X face of cubemap"]
    pub const CU_CUBEMAP_FACE_POSITIVE_X: Type = 0;
    #[doc = "< Negative X face of cubemap"]
    pub const CU_CUBEMAP_FACE_NEGATIVE_X: Type = 1;
    #[doc = "< Positive Y face of cubemap"]
    pub const CU_CUBEMAP_FACE_POSITIVE_Y: Type = 2;
    #[doc = "< Negative Y face of cubemap"]
    pub const CU_CUBEMAP_FACE_NEGATIVE_Y: Type = 3;
    #[doc = "< Positive Z face of cubemap"]
    pub const CU_CUBEMAP_FACE_POSITIVE_Z: Type = 4;
    #[doc = "< Negative Z face of cubemap"]
    pub const CU_CUBEMAP_FACE_NEGATIVE_Z: Type = 5;
}
#[doc = " Array indices for cube faces"]
pub use self::CUarray_cubemap_face_enum::Type as CUarray_cubemap_face;
pub mod CUlimit_enum {
    #[doc = " Limits"]
    pub type Type = ::std::os::raw::c_uint;
    #[doc = "< GPU thread stack size"]
    pub const CU_LIMIT_STACK_SIZE: Type = 0;
    #[doc = "< GPU printf FIFO size"]
    pub const CU_LIMIT_PRINTF_FIFO_SIZE: Type = 1;
    #[doc = "< GPU malloc heap size"]
    pub const CU_LIMIT_MALLOC_HEAP_SIZE: Type = 2;
    #[doc = "< GPU device runtime launch synchronize depth"]
    pub const CU_LIMIT_DEV_RUNTIME_SYNC_DEPTH: Type = 3;
    #[doc = "< GPU device runtime pending launch count"]
    pub const CU_LIMIT_DEV_RUNTIME_PENDING_LAUNCH_COUNT: Type = 4;
    #[doc = "< A value between 0 and 128 that indicates the maximum fetch granularity of L2 (in Bytes). This is a hint"]
    pub const CU_LIMIT_MAX_L2_FETCH_GRANULARITY: Type = 5;
    pub const CU_LIMIT_MAX: Type = 6;
}
#[doc = " Limits"]
pub use self::CUlimit_enum::Type as CUlimit;
pub mod CUresourcetype_enum {
    #[doc = " Resource types"]
    pub type Type = ::std::os::raw::c_uint;
    #[doc = "< Array resoure"]
    pub const CU_RESOURCE_TYPE_ARRAY: Type = 0;
    #[doc = "< Mipmapped array resource"]
    pub const CU_RESOURCE_TYPE_MIPMAPPED_ARRAY: Type = 1;
    #[doc = "< Linear resource"]
    pub const CU_RESOURCE_TYPE_LINEAR: Type = 2;
    #[doc = "< Pitch 2D resource"]
    pub const CU_RESOURCE_TYPE_PITCH2D: Type = 3;
}
#[doc = " Resource types"]
pub use self::CUresourcetype_enum::Type as CUresourcetype;
#[doc = " CUDA host function\n \\param userData Argument value passed to the function"]
pub type CUhostFn =
    ::std::option::Option<unsafe extern "C" fn(userData: *mut ::std::os::raw::c_void)>;
#[doc = " GPU kernel node parameters"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CUDA_KERNEL_NODE_PARAMS_st {
    #[doc = "< Kernel to launch"]
    pub func: CUfunction,
    #[doc = "< Width of grid in blocks"]
    pub gridDimX: ::std::os::raw::c_uint,
    #[doc = "< Height of grid in blocks"]
    pub gridDimY: ::std::os::raw::c_uint,
    #[doc = "< Depth of grid in blocks"]
    pub gridDimZ: ::std::os::raw::c_uint,
    #[doc = "< X dimension of each thread block"]
    pub blockDimX: ::std::os::raw::c_uint,
    #[doc = "< Y dimension of each thread block"]
    pub blockDimY: ::std::os::raw::c_uint,
    #[doc = "< Z dimension of each thread block"]
    pub blockDimZ: ::std::os::raw::c_uint,
    #[doc = "< Dynamic shared-memory size per thread block in bytes"]
    pub sharedMemBytes: ::std::os::raw::c_uint,
    #[doc = "< Array of pointers to kernel parameters"]
    pub kernelParams: *mut *mut ::std::os::raw::c_void,
    #[doc = "< Extra options"]
    pub extra: *mut *mut ::std::os::raw::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of CUDA_KERNEL_NODE_PARAMS_st"]
        [::std::mem::size_of::<CUDA_KERNEL_NODE_PARAMS_st>() - 56usize];
    ["Alignment of CUDA_KERNEL_NODE_PARAMS_st"]
        [::std::mem::align_of::<CUDA_KERNEL_NODE_PARAMS_st>() - 8usize];
    ["Offset of field: CUDA_KERNEL_NODE_PARAMS_st::func"]
        [::std::mem::offset_of!(CUDA_KERNEL_NODE_PARAMS_st, func) - 0usize];
    ["Offset of field: CUDA_KERNEL_NODE_PARAMS_st::gridDimX"]
        [::std::mem::offset_of!(CUDA_KERNEL_NODE_PARAMS_st, gridDimX) - 8usize];
    ["Offset of field: CUDA_KERNEL_NODE_PARAMS_st::gridDimY"]
        [::std::mem::offset_of!(CUDA_KERNEL_NODE_PARAMS_st, gridDimY) - 12usize];
    ["Offset of field: CUDA_KERNEL_NODE_PARAMS_st::gridDimZ"]
        [::std::mem::offset_of!(CUDA_KERNEL_NODE_PARAMS_st, gridDimZ) - 16usize];
    ["Offset of field: CUDA_KERNEL_NODE_PARAMS_st::blockDimX"]
        [::std::mem::offset_of!(CUDA_KERNEL_NODE_PARAMS_st, blockDimX) - 20usize];
    ["Offset of field: CUDA_KERNEL_NODE_PARAMS_st::blockDimY"]
        [::std::mem::offset_of!(CUDA_KERNEL_NODE_PARAMS_st, blockDimY) - 24usize];
    ["Offset of field: CUDA_KERNEL_NODE_PARAMS_st::blockDimZ"]
        [::std::mem::offset_of!(CUDA_KERNEL_NODE_PARAMS_st, blockDimZ) - 28usize];
    ["Offset of field: CUDA_KERNEL_NODE_PARAMS_st::sharedMemBytes"]
        [::std::mem::offset_of!(CUDA_KERNEL_NODE_PARAMS_st, sharedMemBytes) - 32usize];
    ["Offset of field: CUDA_KERNEL_NODE_PARAMS_st::kernelParams"]
        [::std::mem::offset_of!(CUDA_KERNEL_NODE_PARAMS_st, kernelParams) - 40usize];
    ["Offset of field: CUDA_KERNEL_NODE_PARAMS_st::extra"]
        [::std::mem::offset_of!(CUDA_KERNEL_NODE_PARAMS_st, extra) - 48usize];
};
#[doc = " GPU kernel node parameters"]
pub type CUDA_KERNEL_NODE_PARAMS = CUDA_KERNEL_NODE_PARAMS_st;
#[doc = " Memset node parameters"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CUDA_MEMSET_NODE_PARAMS_st {
    #[doc = "< Destination device pointer"]
    pub dst: CUdeviceptr,
    #[doc = "< Pitch of destination device pointer. Unused if height is 1"]
    pub pitch: usize,
    #[doc = "< Value to be set"]
    pub value: ::std::os::raw::c_uint,
    #[doc = "< Size of each element in bytes. Must be 1, 2, or 4."]
    pub elementSize: ::std::os::raw::c_uint,
    #[doc = "< Width in bytes, of the row"]
    pub width: usize,
    #[doc = "< Number of rows"]
    pub height: usize,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of CUDA_MEMSET_NODE_PARAMS_st"]
        [::std::mem::size_of::<CUDA_MEMSET_NODE_PARAMS_st>() - 40usize];
    ["Alignment of CUDA_MEMSET_NODE_PARAMS_st"]
        [::std::mem::align_of::<CUDA_MEMSET_NODE_PARAMS_st>() - 8usize];
    ["Offset of field: CUDA_MEMSET_NODE_PARAMS_st::dst"]
        [::std::mem::offset_of!(CUDA_MEMSET_NODE_PARAMS_st, dst) - 0usize];
    ["Offset of field: CUDA_MEMSET_NODE_PARAMS_st::pitch"]
        [::std::mem::offset_of!(CUDA_MEMSET_NODE_PARAMS_st, pitch) - 8usize];
    ["Offset of field: CUDA_MEMSET_NODE_PARAMS_st::value"]
        [::std::mem::offset_of!(CUDA_MEMSET_NODE_PARAMS_st, value) - 16usize];
    ["Offset of field: CUDA_MEMSET_NODE_PARAMS_st::elementSize"]
        [::std::mem::offset_of!(CUDA_MEMSET_NODE_PARAMS_st, elementSize) - 20usize];
    ["Offset of field: CUDA_MEMSET_NODE_PARAMS_st::width"]
        [::std::mem::offset_of!(CUDA_MEMSET_NODE_PARAMS_st, width) - 24usize];
    ["Offset of field: CUDA_MEMSET_NODE_PARAMS_st::height"]
        [::std::mem::offset_of!(CUDA_MEMSET_NODE_PARAMS_st, height) - 32usize];
};
#[doc = " Memset node parameters"]
pub type CUDA_MEMSET_NODE_PARAMS = CUDA_MEMSET_NODE_PARAMS_st;
#[doc = " Host node parameters"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CUDA_HOST_NODE_PARAMS_st {
    #[doc = "< The function to call when the node executes"]
    pub fn_: CUhostFn,
    #[doc = "< Argument to pass to the function"]
    pub userData: *mut ::std::os::raw::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of CUDA_HOST_NODE_PARAMS_st"]
        [::std::mem::size_of::<CUDA_HOST_NODE_PARAMS_st>() - 16usize];
    ["Alignment of CUDA_HOST_NODE_PARAMS_st"]
        [::std::mem::align_of::<CUDA_HOST_NODE_PARAMS_st>() - 8usize];
    ["Offset of field: CUDA_HOST_NODE_PARAMS_st::fn_"]
        [::std::mem::offset_of!(CUDA_HOST_NODE_PARAMS_st, fn_) - 0usize];
    ["Offset of field: CUDA_HOST_NODE_PARAMS_st::userData"]
        [::std::mem::offset_of!(CUDA_HOST_NODE_PARAMS_st, userData) - 8usize];
};
#[doc = " Host node parameters"]
pub type CUDA_HOST_NODE_PARAMS = CUDA_HOST_NODE_PARAMS_st;
pub mod CUgraphNodeType_enum {
    #[doc = " Graph node types"]
    pub type Type = ::std::os::raw::c_uint;
    #[doc = "< GPU kernel node"]
    pub const CU_GRAPH_NODE_TYPE_KERNEL: Type = 0;
    #[doc = "< Memcpy node"]
    pub const CU_GRAPH_NODE_TYPE_MEMCPY: Type = 1;
    #[doc = "< Memset node"]
    pub const CU_GRAPH_NODE_TYPE_MEMSET: Type = 2;
    #[doc = "< Host (executable) node"]
    pub const CU_GRAPH_NODE_TYPE_HOST: Type = 3;
    #[doc = "< Node which executes an embedded graph"]
    pub const CU_GRAPH_NODE_TYPE_GRAPH: Type = 4;
    #[doc = "< Empty (no-op) node"]
    pub const CU_GRAPH_NODE_TYPE_EMPTY: Type = 5;
    pub const CU_GRAPH_NODE_TYPE_COUNT: Type = 6;
}
#[doc = " Graph node types"]
pub use self::CUgraphNodeType_enum::Type as CUgraphNodeType;
pub mod CUstreamCaptureStatus_enum {
    #[doc = " Possible stream capture statuses returned by ::cuStreamIsCapturing"]
    pub type Type = ::std::os::raw::c_uint;
    #[doc = "< Stream is not capturing"]
    pub const CU_STREAM_CAPTURE_STATUS_NONE: Type = 0;
    #[doc = "< Stream is actively capturing"]
    pub const CU_STREAM_CAPTURE_STATUS_ACTIVE: Type = 1;
    #[doc = "< Stream is part of a capture sequence that\nhas been invalidated, but not terminated"]
    pub const CU_STREAM_CAPTURE_STATUS_INVALIDATED: Type = 2;
}
#[doc = " Possible stream capture statuses returned by ::cuStreamIsCapturing"]
pub use self::CUstreamCaptureStatus_enum::Type as CUstreamCaptureStatus;
pub mod cudaError_enum {
    #[doc = " Error codes"]
    pub type Type = ::std::os::raw::c_uint;
    #[doc = " The API call returned with no errors. In the case of query calls, this\n also means that the operation being queried is complete (see\n ::cuEventQuery() and ::cuStreamQuery())."]
    pub const CUDA_SUCCESS: Type = 0;
    #[doc = " This indicates that one or more of the parameters passed to the API call\n is not within an acceptable range of values."]
    pub const CUDA_ERROR_INVALID_VALUE: Type = 1;
    #[doc = " The API call failed because it was unable to allocate enough memory to\n perform the requested operation."]
    pub const CUDA_ERROR_OUT_OF_MEMORY: Type = 2;
    #[doc = " This indicates that the CUDA driver has not been initialized with\n ::cuInit() or that initialization has failed."]
    pub const CUDA_ERROR_NOT_INITIALIZED: Type = 3;
    #[doc = " This indicates that the CUDA driver is in the process of shutting down."]
    pub const CUDA_ERROR_DEINITIALIZED: Type = 4;
    #[doc = " This indicates profiler is not initialized for this run. This can\n happen when the application is running with external profiling tools\n like visual profiler."]
    pub const CUDA_ERROR_PROFILER_DISABLED: Type = 5;
    #[doc = " \\deprecated\n This error return is deprecated as of CUDA 5.0. It is no longer an error\n to attempt to enable/disable the profiling via ::cuProfilerStart or\n ::cuProfilerStop without initialization."]
    pub const CUDA_ERROR_PROFILER_NOT_INITIALIZED: Type = 6;
    #[doc = " \\deprecated\n This error return is deprecated as of CUDA 5.0. It is no longer an error\n to call cuProfilerStart() when profiling is already enabled."]
    pub const CUDA_ERROR_PROFILER_ALREADY_STARTED: Type = 7;
    #[doc = " \\deprecated\n This error return is deprecated as of CUDA 5.0. It is no longer an error\n to call cuProfilerStop() when profiling is already disabled."]
    pub const CUDA_ERROR_PROFILER_ALREADY_STOPPED: Type = 8;
    #[doc = " This indicates that no CUDA-capable devices were detected by the installed\n CUDA driver."]
    pub const CUDA_ERROR_NO_DEVICE: Type = 100;
    #[doc = " This indicates that the device ordinal supplied by the user does not\n correspond to a valid CUDA device."]
    pub const CUDA_ERROR_INVALID_DEVICE: Type = 101;
    #[doc = " This indicates that the device kernel image is invalid. This can also\n indicate an invalid CUDA module."]
    pub const CUDA_ERROR_INVALID_IMAGE: Type = 200;
    #[doc = " This most frequently indicates that there is no context bound to the\n current thread. This can also be returned if the context passed to an\n API call is not a valid handle (such as a context that has had\n ::cuCtxDestroy() invoked on it). This can also be returned if a user\n mixes different API versions (i.e. 3010 context with 3020 API calls).\n See ::cuCtxGetApiVersion() for more details."]
    pub const CUDA_ERROR_INVALID_CONTEXT: Type = 201;
    #[doc = " This indicated that the context being supplied as a parameter to the\n API call was already the active context.\n \\deprecated\n This error return is deprecated as of CUDA 3.2. It is no longer an\n error to attempt to push the active context via ::cuCtxPushCurrent()."]
    pub const CUDA_ERROR_CONTEXT_ALREADY_CURRENT: Type = 202;
    #[doc = " This indicates that a map or register operation has failed."]
    pub const CUDA_ERROR_MAP_FAILED: Type = 205;
    #[doc = " This indicates that an unmap or unregister operation has failed."]
    pub const CUDA_ERROR_UNMAP_FAILED: Type = 206;
    #[doc = " This indicates that the specified array is currently mapped and thus\n cannot be destroyed."]
    pub const CUDA_ERROR_ARRAY_IS_MAPPED: Type = 207;
    #[doc = " This indicates that the resource is already mapped."]
    pub const CUDA_ERROR_ALREADY_MAPPED: Type = 208;
    #[doc = " This indicates that there is no kernel image available that is suitable\n for the device. This can occur when a user specifies code generation\n options for a particular CUDA source file that do not include the\n corresponding device configuration."]
    pub const CUDA_ERROR_NO_BINARY_FOR_GPU: Type = 209;
    #[doc = " This indicates that a resource has already been acquired."]
    pub const CUDA_ERROR_ALREADY_ACQUIRED: Type = 210;
    #[doc = " This indicates that a resource is not mapped."]
    pub const CUDA_ERROR_NOT_MAPPED: Type = 211;
    #[doc = " This indicates that a mapped resource is not available for access as an\n array."]
    pub const CUDA_ERROR_NOT_MAPPED_AS_ARRAY: Type = 212;
    #[doc = " This indicates that a mapped resource is not available for access as a\n pointer."]
    pub const CUDA_ERROR_NOT_MAPPED_AS_POINTER: Type = 213;
    #[doc = " This indicates that an uncorrectable ECC error was detected during\n execution."]
    pub const CUDA_ERROR_ECC_UNCORRECTABLE: Type = 214;
    #[doc = " This indicates that the ::CUlimit passed to the API call is not\n supported by the active device."]
    pub const CUDA_ERROR_UNSUPPORTED_LIMIT: Type = 215;
    #[doc = " This indicates that the ::CUcontext passed to the API call can\n only be bound to a single CPU thread at a time but is already\n bound to a CPU thread."]
    pub const CUDA_ERROR_CONTEXT_ALREADY_IN_USE: Type = 216;
    #[doc = " This indicates that peer access is not supported across the given\n devices."]
    pub const CUDA_ERROR_PEER_ACCESS_UNSUPPORTED: Type = 217;
    #[doc = " This indicates that a PTX JIT compilation failed."]
    pub const CUDA_ERROR_INVALID_PTX: Type = 218;
    #[doc = " This indicates an error with OpenGL or DirectX context."]
    pub const CUDA_ERROR_INVALID_GRAPHICS_CONTEXT: Type = 219;
    #[doc = " This indicates that an uncorrectable NVLink error was detected during the\n execution."]
    pub const CUDA_ERROR_NVLINK_UNCORRECTABLE: Type = 220;
    #[doc = " This indicates that the PTX JIT compiler library was not found."]
    pub const CUDA_ERROR_JIT_COMPILER_NOT_FOUND: Type = 221;
    #[doc = " This indicates that the device kernel source is invalid."]
    pub const CUDA_ERROR_INVALID_SOURCE: Type = 300;
    #[doc = " This indicates that the file specified was not found."]
    pub const CUDA_ERROR_FILE_NOT_FOUND: Type = 301;
    #[doc = " This indicates that a link to a shared object failed to resolve."]
    pub const CUDA_ERROR_SHARED_OBJECT_SYMBOL_NOT_FOUND: Type = 302;
    #[doc = " This indicates that initialization of a shared object failed."]
    pub const CUDA_ERROR_SHARED_OBJECT_INIT_FAILED: Type = 303;
    #[doc = " This indicates that an OS call failed."]
    pub const CUDA_ERROR_OPERATING_SYSTEM: Type = 304;
    #[doc = " This indicates that a resource handle passed to the API call was not\n valid. Resource handles are opaque types like ::CUstream and ::CUevent."]
    pub const CUDA_ERROR_INVALID_HANDLE: Type = 400;
    #[doc = " This indicates that a resource required by the API call is not in a\n valid state to perform the requested operation."]
    pub const CUDA_ERROR_ILLEGAL_STATE: Type = 401;
    #[doc = " This indicates that a named symbol was not found. Examples of symbols\n are global/constant variable names, texture names, and surface names."]
    pub const CUDA_ERROR_NOT_FOUND: Type = 500;
    #[doc = " This indicates that asynchronous operations issued previously have not\n completed yet. This result is not actually an error, but must be indicated\n differently than ::CUDA_SUCCESS (which indicates completion). Calls that\n may return this value include ::cuEventQuery() and ::cuStreamQuery()."]
    pub const CUDA_ERROR_NOT_READY: Type = 600;
    #[doc = " While executing a kernel, the device encountered a\n load or store instruction on an invalid memory address.\n This leaves the process in an inconsistent state and any further CUDA work\n will return the same error. To continue using CUDA, the process must be terminated\n and relaunched."]
    pub const CUDA_ERROR_ILLEGAL_ADDRESS: Type = 700;
    #[doc = " This indicates that a launch did not occur because it did not have\n appropriate resources. This error usually indicates that the user has\n attempted to pass too many arguments to the device kernel, or the\n kernel launch specifies too many threads for the kernel's register\n count. Passing arguments of the wrong size (i.e. a 64-bit pointer\n when a 32-bit int is expected) is equivalent to passing too many\n arguments and can also result in this error."]
    pub const CUDA_ERROR_LAUNCH_OUT_OF_RESOURCES: Type = 701;
    #[doc = " This indicates that the device kernel took too long to execute. This can\n only occur if timeouts are enabled - see the device attribute\n ::CU_DEVICE_ATTRIBUTE_KERNEL_EXEC_TIMEOUT for more information.\n This leaves the process in an inconsistent state and any further CUDA work\n will return the same error. To continue using CUDA, the process must be terminated\n and relaunched."]
    pub const CUDA_ERROR_LAUNCH_TIMEOUT: Type = 702;
    #[doc = " This error indicates a kernel launch that uses an incompatible texturing\n mode."]
    pub const CUDA_ERROR_LAUNCH_INCOMPATIBLE_TEXTURING: Type = 703;
    #[doc = " This error indicates that a call to ::cuCtxEnablePeerAccess() is\n trying to re-enable peer access to a context which has already\n had peer access to it enabled."]
    pub const CUDA_ERROR_PEER_ACCESS_ALREADY_ENABLED: Type = 704;
    #[doc = " This error indicates that ::cuCtxDisablePeerAccess() is\n trying to disable peer access which has not been enabled yet\n via ::cuCtxEnablePeerAccess()."]
    pub const CUDA_ERROR_PEER_ACCESS_NOT_ENABLED: Type = 705;
    #[doc = " This error indicates that the primary context for the specified device\n has already been initialized."]
    pub const CUDA_ERROR_PRIMARY_CONTEXT_ACTIVE: Type = 708;
    #[doc = " This error indicates that the context current to the calling thread\n has been destroyed using ::cuCtxDestroy, or is a primary context which\n has not yet been initialized."]
    pub const CUDA_ERROR_CONTEXT_IS_DESTROYED: Type = 709;
    #[doc = " A device-side assert triggered during kernel execution. The context\n cannot be used anymore, and must be destroyed. All existing device\n memory allocations from this context are invalid and must be\n reconstructed if the program is to continue using CUDA."]
    pub const CUDA_ERROR_ASSERT: Type = 710;
    #[doc = " This error indicates that the hardware resources required to enable\n peer access have been exhausted for one or more of the devices\n passed to ::cuCtxEnablePeerAccess()."]
    pub const CUDA_ERROR_TOO_MANY_PEERS: Type = 711;
    #[doc = " This error indicates that the memory range passed to ::cuMemHostRegister()\n has already been registered."]
    pub const CUDA_ERROR_HOST_MEMORY_ALREADY_REGISTERED: Type = 712;
    #[doc = " This error indicates that the pointer passed to ::cuMemHostUnregister()\n does not correspond to any currently registered memory region."]
    pub const CUDA_ERROR_HOST_MEMORY_NOT_REGISTERED: Type = 713;
    #[doc = " While executing a kernel, the device encountered a stack error.\n This can be due to stack corruption or exceeding the stack size limit.\n This leaves the process in an inconsistent state and any further CUDA work\n will return the same error. To continue using CUDA, the process must be terminated\n and relaunched."]
    pub const CUDA_ERROR_HARDWARE_STACK_ERROR: Type = 714;
    #[doc = " While executing a kernel, the device encountered an illegal instruction.\n This leaves the process in an inconsistent state and any further CUDA work\n will return the same error. To continue using CUDA, the process must be terminated\n and relaunched."]
    pub const CUDA_ERROR_ILLEGAL_INSTRUCTION: Type = 715;
    #[doc = " While executing a kernel, the device encountered a load or store instruction\n on a memory address which is not aligned.\n This leaves the process in an inconsistent state and any further CUDA work\n will return the same error. To continue using CUDA, the process must be terminated\n and relaunched."]
    pub const CUDA_ERROR_MISALIGNED_ADDRESS: Type = 716;
    #[doc = " While executing a kernel, the device encountered an instruction\n which can only operate on memory locations in certain address spaces\n (global, shared, or local), but was supplied a memory address not\n belonging to an allowed address space.\n This leaves the process in an inconsistent state and any further CUDA work\n will return the same error. To continue using CUDA, the process must be terminated\n and relaunched."]
    pub const CUDA_ERROR_INVALID_ADDRESS_SPACE: Type = 717;
    #[doc = " While executing a kernel, the device program counter wrapped its address space.\n This leaves the process in an inconsistent state and any further CUDA work\n will return the same error. To continue using CUDA, the process must be terminated\n and relaunched."]
    pub const CUDA_ERROR_INVALID_PC: Type = 718;
    #[doc = " An exception occurred on the device while executing a kernel. Common\n causes include dereferencing an invalid device pointer and accessing\n out of bounds shared memory.\n This leaves the process in an inconsistent state and any further CUDA work\n will return the same error. To continue using CUDA, the process must be terminated\n and relaunched."]
    pub const CUDA_ERROR_LAUNCH_FAILED: Type = 719;
    #[doc = " This error indicates that the number of blocks launched per grid for a kernel that was\n launched via either ::cuLaunchCooperativeKernel or ::cuLaunchCooperativeKernelMultiDevice\n exceeds the maximum number of blocks as allowed by ::cuOccupancyMaxActiveBlocksPerMultiprocessor\n or ::cuOccupancyMaxActiveBlocksPerMultiprocessorWithFlags times the number of multiprocessors\n as specified by the device attribute ::CU_DEVICE_ATTRIBUTE_MULTIPROCESSOR_COUNT."]
    pub const CUDA_ERROR_COOPERATIVE_LAUNCH_TOO_LARGE: Type = 720;
    #[doc = " This error indicates that the attempted operation is not permitted."]
    pub const CUDA_ERROR_NOT_PERMITTED: Type = 800;
    #[doc = " This error indicates that the attempted operation is not supported\n on the current system or device."]
    pub const CUDA_ERROR_NOT_SUPPORTED: Type = 801;
    #[doc = " This error indicates that the system is not yet ready to start any CUDA\n work.  To continue using CUDA, verify the system configuration is in a\n valid state and all required driver daemons are actively running."]
    pub const CUDA_ERROR_SYSTEM_NOT_READY: Type = 802;
    #[doc = " This error indicates that the operation is not permitted when\n the stream is capturing."]
    pub const CUDA_ERROR_STREAM_CAPTURE_UNSUPPORTED: Type = 900;
    #[doc = " This error indicates that the current capture sequence on the stream\n has been invalidated due to a previous error."]
    pub const CUDA_ERROR_STREAM_CAPTURE_INVALIDATED: Type = 901;
    #[doc = " This error indicates that the operation would have resulted in a merge\n of two independent capture sequences."]
    pub const CUDA_ERROR_STREAM_CAPTURE_MERGE: Type = 902;
    #[doc = " This error indicates that the capture was not initiated in this stream."]
    pub const CUDA_ERROR_STREAM_CAPTURE_UNMATCHED: Type = 903;
    #[doc = " This error indicates that the capture sequence contains a fork that was\n not joined to the primary stream."]
    pub const CUDA_ERROR_STREAM_CAPTURE_UNJOINED: Type = 904;
    #[doc = " This error indicates that a dependency would have been created which\n crosses the capture sequence boundary. Only implicit in-stream ordering\n dependencies are allowed to cross the boundary."]
    pub const CUDA_ERROR_STREAM_CAPTURE_ISOLATION: Type = 905;
    #[doc = " This error indicates a disallowed implicit dependency on a current capture\n sequence from cudaStreamLegacy."]
    pub const CUDA_ERROR_STREAM_CAPTURE_IMPLICIT: Type = 906;
    #[doc = " This error indicates that the operation is not permitted on an event which\n was last recorded in a capturing stream."]
    pub const CUDA_ERROR_CAPTURED_EVENT: Type = 907;
    #[doc = " This indicates that an unknown internal error has occurred."]
    pub const CUDA_ERROR_UNKNOWN: Type = 999;
}
#[doc = " Error codes"]
pub use self::cudaError_enum::Type as CUresult;
pub mod CUdevice_P2PAttribute_enum {
    #[doc = " P2P Attributes"]
    pub type Type = ::std::os::raw::c_uint;
    #[doc = "< A relative value indicating the performance of the link between two devices"]
    pub const CU_DEVICE_P2P_ATTRIBUTE_PERFORMANCE_RANK: Type = 1;
    #[doc = "< P2P Access is enable"]
    pub const CU_DEVICE_P2P_ATTRIBUTE_ACCESS_SUPPORTED: Type = 2;
    #[doc = "< Atomic operation over the link supported"]
    pub const CU_DEVICE_P2P_ATTRIBUTE_NATIVE_ATOMIC_SUPPORTED: Type = 3;
    #[doc = "< \\deprecated use CU_DEVICE_P2P_ATTRIBUTE_CUDA_ARRAY_ACCESS_SUPPORTED instead"]
    pub const CU_DEVICE_P2P_ATTRIBUTE_ARRAY_ACCESS_ACCESS_SUPPORTED: Type = 4;
    #[doc = "< Accessing CUDA arrays over the link supported"]
    pub const CU_DEVICE_P2P_ATTRIBUTE_CUDA_ARRAY_ACCESS_SUPPORTED: Type = 4;
}
#[doc = " P2P Attributes"]
pub use self::CUdevice_P2PAttribute_enum::Type as CUdevice_P2PAttribute;
#[doc = " CUDA stream callback\n \\param hStream The stream the callback was added to, as passed to ::cuStreamAddCallback.  May be NULL.\n \\param status ::CUDA_SUCCESS or any persistent error on the stream.\n \\param userData User parameter provided at registration."]
pub type CUstreamCallback = ::std::option::Option<
    unsafe extern "C" fn(
        hStream: CUstream,
        status: CUresult,
        userData: *mut ::std::os::raw::c_void,
    ),
>;
#[doc = " Block size to per-block dynamic shared memory mapping for a certain\n kernel \\param blockSize Block size of the kernel.\n\n \\return The dynamic shared memory needed by a block."]
pub type CUoccupancyB2DSize =
    ::std::option::Option<unsafe extern "C" fn(blockSize: ::std::os::raw::c_int) -> usize>;
#[doc = " 2D memory copy parameters"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CUDA_MEMCPY2D_st {
    #[doc = "< Source X in bytes"]
    pub srcXInBytes: usize,
    #[doc = "< Source Y"]
    pub srcY: usize,
    #[doc = "< Source memory type (host, device, array)"]
    pub srcMemoryType: CUmemorytype,
    #[doc = "< Source host pointer"]
    pub srcHost: *const ::std::os::raw::c_void,
    #[doc = "< Source device pointer"]
    pub srcDevice: CUdeviceptr,
    #[doc = "< Source array reference"]
    pub srcArray: CUarray,
    #[doc = "< Source pitch (ignored when src is array)"]
    pub srcPitch: usize,
    #[doc = "< Destination X in bytes"]
    pub dstXInBytes: usize,
    #[doc = "< Destination Y"]
    pub dstY: usize,
    #[doc = "< Destination memory type (host, device, array)"]
    pub dstMemoryType: CUmemorytype,
    #[doc = "< Destination host pointer"]
    pub dstHost: *mut ::std::os::raw::c_void,
    #[doc = "< Destination device pointer"]
    pub dstDevice: CUdeviceptr,
    #[doc = "< Destination array reference"]
    pub dstArray: CUarray,
    #[doc = "< Destination pitch (ignored when dst is array)"]
    pub dstPitch: usize,
    #[doc = "< Width of 2D memory copy in bytes"]
    pub WidthInBytes: usize,
    #[doc = "< Height of 2D memory copy"]
    pub Height: usize,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of CUDA_MEMCPY2D_st"][::std::mem::size_of::<CUDA_MEMCPY2D_st>() - 128usize];
    ["Alignment of CUDA_MEMCPY2D_st"][::std::mem::align_of::<CUDA_MEMCPY2D_st>() - 8usize];
    ["Offset of field: CUDA_MEMCPY2D_st::srcXInBytes"]
        [::std::mem::offset_of!(CUDA_MEMCPY2D_st, srcXInBytes) - 0usize];
    ["Offset of field: CUDA_MEMCPY2D_st::srcY"]
        [::std::mem::offset_of!(CUDA_MEMCPY2D_st, srcY) - 8usize];
    ["Offset of field: CUDA_MEMCPY2D_st::srcMemoryType"]
        [::std::mem::offset_of!(CUDA_MEMCPY2D_st, srcMemoryType) - 16usize];
    ["Offset of field: CUDA_MEMCPY2D_st::srcHost"]
        [::std::mem::offset_of!(CUDA_MEMCPY2D_st, srcHost) - 24usize];
    ["Offset of field: CUDA_MEMCPY2D_st::srcDevice"]
        [::std::mem::offset_of!(CUDA_MEMCPY2D_st, srcDevice) - 32usize];
    ["Offset of field: CUDA_MEMCPY2D_st::srcArray"]
        [::std::mem::offset_of!(CUDA_MEMCPY2D_st, srcArray) - 40usize];
    ["Offset of field: CUDA_MEMCPY2D_st::srcPitch"]
        [::std::mem::offset_of!(CUDA_MEMCPY2D_st, srcPitch) - 48usize];
    ["Offset of field: CUDA_MEMCPY2D_st::dstXInBytes"]
        [::std::mem::offset_of!(CUDA_MEMCPY2D_st, dstXInBytes) - 56usize];
    ["Offset of field: CUDA_MEMCPY2D_st::dstY"]
        [::std::mem::offset_of!(CUDA_MEMCPY2D_st, dstY) - 64usize];
    ["Offset of field: CUDA_MEMCPY2D_st::dstMemoryType"]
        [::std::mem::offset_of!(CUDA_MEMCPY2D_st, dstMemoryType) - 72usize];
    ["Offset of field: CUDA_MEMCPY2D_st::dstHost"]
        [::std::mem::offset_of!(CUDA_MEMCPY2D_st, dstHost) - 80usize];
    ["Offset of field: CUDA_MEMCPY2D_st::dstDevice"]
        [::std::mem::offset_of!(CUDA_MEMCPY2D_st, dstDevice) - 88usize];
    ["Offset of field: CUDA_MEMCPY2D_st::dstArray"]
        [::std::mem::offset_of!(CUDA_MEMCPY2D_st, dstArray) - 96usize];
    ["Offset of field: CUDA_MEMCPY2D_st::dstPitch"]
        [::std::mem::offset_of!(CUDA_MEMCPY2D_st, dstPitch) - 104usize];
    ["Offset of field: CUDA_MEMCPY2D_st::WidthInBytes"]
        [::std::mem::offset_of!(CUDA_MEMCPY2D_st, WidthInBytes) - 112usize];
    ["Offset of field: CUDA_MEMCPY2D_st::Height"]
        [::std::mem::offset_of!(CUDA_MEMCPY2D_st, Height) - 120usize];
};
#[doc = " 2D memory copy parameters"]
pub type CUDA_MEMCPY2D = CUDA_MEMCPY2D_st;
#[doc = " 3D memory copy parameters"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CUDA_MEMCPY3D_st {
    #[doc = "< Source X in bytes"]
    pub srcXInBytes: usize,
    #[doc = "< Source Y"]
    pub srcY: usize,
    #[doc = "< Source Z"]
    pub srcZ: usize,
    #[doc = "< Source LOD"]
    pub srcLOD: usize,
    #[doc = "< Source memory type (host, device, array)"]
    pub srcMemoryType: CUmemorytype,
    #[doc = "< Source host pointer"]
    pub srcHost: *const ::std::os::raw::c_void,
    #[doc = "< Source device pointer"]
    pub srcDevice: CUdeviceptr,
    #[doc = "< Source array reference"]
    pub srcArray: CUarray,
    #[doc = "< Must be NULL"]
    pub reserved0: *mut ::std::os::raw::c_void,
    #[doc = "< Source pitch (ignored when src is array)"]
    pub srcPitch: usize,
    #[doc = "< Source height (ignored when src is array; may be 0 if Depth==1)"]
    pub srcHeight: usize,
    #[doc = "< Destination X in bytes"]
    pub dstXInBytes: usize,
    #[doc = "< Destination Y"]
    pub dstY: usize,
    #[doc = "< Destination Z"]
    pub dstZ: usize,
    #[doc = "< Destination LOD"]
    pub dstLOD: usize,
    #[doc = "< Destination memory type (host, device, array)"]
    pub dstMemoryType: CUmemorytype,
    #[doc = "< Destination host pointer"]
    pub dstHost: *mut ::std::os::raw::c_void,
    #[doc = "< Destination device pointer"]
    pub dstDevice: CUdeviceptr,
    #[doc = "< Destination array reference"]
    pub dstArray: CUarray,
    #[doc = "< Must be NULL"]
    pub reserved1: *mut ::std::os::raw::c_void,
    #[doc = "< Destination pitch (ignored when dst is array)"]
    pub dstPitch: usize,
    #[doc = "< Destination height (ignored when dst is array; may be 0 if Depth==1)"]
    pub dstHeight: usize,
    #[doc = "< Width of 3D memory copy in bytes"]
    pub WidthInBytes: usize,
    #[doc = "< Height of 3D memory copy"]
    pub Height: usize,
    #[doc = "< Depth of 3D memory copy"]
    pub Depth: usize,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of CUDA_MEMCPY3D_st"][::std::mem::size_of::<CUDA_MEMCPY3D_st>() - 200usize];
    ["Alignment of CUDA_MEMCPY3D_st"][::std::mem::align_of::<CUDA_MEMCPY3D_st>() - 8usize];
    ["Offset of field: CUDA_MEMCPY3D_st::srcXInBytes"]
        [::std::mem::offset_of!(CUDA_MEMCPY3D_st, srcXInBytes) - 0usize];
    ["Offset of field: CUDA_MEMCPY3D_st::srcY"]
        [::std::mem::offset_of!(CUDA_MEMCPY3D_st, srcY) - 8usize];
    ["Offset of field: CUDA_MEMCPY3D_st::srcZ"]
        [::std::mem::offset_of!(CUDA_MEMCPY3D_st, srcZ) - 16usize];
    ["Offset of field: CUDA_MEMCPY3D_st::srcLOD"]
        [::std::mem::offset_of!(CUDA_MEMCPY3D_st, srcLOD) - 24usize];
    ["Offset of field: CUDA_MEMCPY3D_st::srcMemoryType"]
        [::std::mem::offset_of!(CUDA_MEMCPY3D_st, srcMemoryType) - 32usize];
    ["Offset of field: CUDA_MEMCPY3D_st::srcHost"]
        [::std::mem::offset_of!(CUDA_MEMCPY3D_st, srcHost) - 40usize];
    ["Offset of field: CUDA_MEMCPY3D_st::srcDevice"]
        [::std::mem::offset_of!(CUDA_MEMCPY3D_st, srcDevice) - 48usize];
    ["Offset of field: CUDA_MEMCPY3D_st::srcArray"]
        [::std::mem::offset_of!(CUDA_MEMCPY3D_st, srcArray) - 56usize];
    ["Offset of field: CUDA_MEMCPY3D_st::reserved0"]
        [::std::mem::offset_of!(CUDA_MEMCPY3D_st, reserved0) - 64usize];
    ["Offset of field: CUDA_MEMCPY3D_st::srcPitch"]
        [::std::mem::offset_of!(CUDA_MEMCPY3D_st, srcPitch) - 72usize];
    ["Offset of field: CUDA_MEMCPY3D_st::srcHeight"]
        [::std::mem::offset_of!(CUDA_MEMCPY3D_st, srcHeight) - 80usize];
    ["Offset of field: CUDA_MEMCPY3D_st::dstXInBytes"]
        [::std::mem::offset_of!(CUDA_MEMCPY3D_st, dstXInBytes) - 88usize];
    ["Offset of field: CUDA_MEMCPY3D_st::dstY"]
        [::std::mem::offset_of!(CUDA_MEMCPY3D_st, dstY) - 96usize];
    ["Offset of field: CUDA_MEMCPY3D_st::dstZ"]
        [::std::mem::offset_of!(CUDA_MEMCPY3D_st, dstZ) - 104usize];
    ["Offset of field: CUDA_MEMCPY3D_st::dstLOD"]
        [::std::mem::offset_of!(CUDA_MEMCPY3D_st, dstLOD) - 112usize];
    ["Offset of field: CUDA_MEMCPY3D_st::dstMemoryType"]
        [::std::mem::offset_of!(CUDA_MEMCPY3D_st, dstMemoryType) - 120usize];
    ["Offset of field: CUDA_MEMCPY3D_st::dstHost"]
        [::std::mem::offset_of!(CUDA_MEMCPY3D_st, dstHost) - 128usize];
    ["Offset of field: CUDA_MEMCPY3D_st::dstDevice"]
        [::std::mem::offset_of!(CUDA_MEMCPY3D_st, dstDevice) - 136usize];
    ["Offset of field: CUDA_MEMCPY3D_st::dstArray"]
        [::std::mem::offset_of!(CUDA_MEMCPY3D_st, dstArray) - 144usize];
    ["Offset of field: CUDA_MEMCPY3D_st::reserved1"]
        [::std::mem::offset_of!(CUDA_MEMCPY3D_st, reserved1) - 152usize];
    ["Offset of field: CUDA_MEMCPY3D_st::dstPitch"]
        [::std::mem::offset_of!(CUDA_MEMCPY3D_st, dstPitch) - 160usize];
    ["Offset of field: CUDA_MEMCPY3D_st::dstHeight"]
        [::std::mem::offset_of!(CUDA_MEMCPY3D_st, dstHeight) - 168usize];
    ["Offset of field: CUDA_MEMCPY3D_st::WidthInBytes"]
        [::std::mem::offset_of!(CUDA_MEMCPY3D_st, WidthInBytes) - 176usize];
    ["Offset of field: CUDA_MEMCPY3D_st::Height"]
        [::std::mem::offset_of!(CUDA_MEMCPY3D_st, Height) - 184usize];
    ["Offset of field: CUDA_MEMCPY3D_st::Depth"]
        [::std::mem::offset_of!(CUDA_MEMCPY3D_st, Depth) - 192usize];
};
#[doc = " 3D memory copy parameters"]
pub type CUDA_MEMCPY3D = CUDA_MEMCPY3D_st;
#[doc = " 3D memory cross-context copy parameters"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CUDA_MEMCPY3D_PEER_st {
    #[doc = "< Source X in bytes"]
    pub srcXInBytes: usize,
    #[doc = "< Source Y"]
    pub srcY: usize,
    #[doc = "< Source Z"]
    pub srcZ: usize,
    #[doc = "< Source LOD"]
    pub srcLOD: usize,
    #[doc = "< Source memory type (host, device, array)"]
    pub srcMemoryType: CUmemorytype,
    #[doc = "< Source host pointer"]
    pub srcHost: *const ::std::os::raw::c_void,
    #[doc = "< Source device pointer"]
    pub srcDevice: CUdeviceptr,
    #[doc = "< Source array reference"]
    pub srcArray: CUarray,
    #[doc = "< Source context (ignored with srcMemoryType is ::CU_MEMORYTYPE_ARRAY)"]
    pub srcContext: CUcontext,
    #[doc = "< Source pitch (ignored when src is array)"]
    pub srcPitch: usize,
    #[doc = "< Source height (ignored when src is array; may be 0 if Depth==1)"]
    pub srcHeight: usize,
    #[doc = "< Destination X in bytes"]
    pub dstXInBytes: usize,
    #[doc = "< Destination Y"]
    pub dstY: usize,
    #[doc = "< Destination Z"]
    pub dstZ: usize,
    #[doc = "< Destination LOD"]
    pub dstLOD: usize,
    #[doc = "< Destination memory type (host, device, array)"]
    pub dstMemoryType: CUmemorytype,
    #[doc = "< Destination host pointer"]
    pub dstHost: *mut ::std::os::raw::c_void,
    #[doc = "< Destination device pointer"]
    pub dstDevice: CUdeviceptr,
    #[doc = "< Destination array reference"]
    pub dstArray: CUarray,
    #[doc = "< Destination context (ignored with dstMemoryType is ::CU_MEMORYTYPE_ARRAY)"]
    pub dstContext: CUcontext,
    #[doc = "< Destination pitch (ignored when dst is array)"]
    pub dstPitch: usize,
    #[doc = "< Destination height (ignored when dst is array; may be 0 if Depth==1)"]
    pub dstHeight: usize,
    #[doc = "< Width of 3D memory copy in bytes"]
    pub WidthInBytes: usize,
    #[doc = "< Height of 3D memory copy"]
    pub Height: usize,
    #[doc = "< Depth of 3D memory copy"]
    pub Depth: usize,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of CUDA_MEMCPY3D_PEER_st"][::std::mem::size_of::<CUDA_MEMCPY3D_PEER_st>() - 200usize];
    ["Alignment of CUDA_MEMCPY3D_PEER_st"]
        [::std::mem::align_of::<CUDA_MEMCPY3D_PEER_st>() - 8usize];
    ["Offset of field: CUDA_MEMCPY3D_PEER_st::srcXInBytes"]
        [::std::mem::offset_of!(CUDA_MEMCPY3D_PEER_st, srcXInBytes) - 0usize];
    ["Offset of field: CUDA_MEMCPY3D_PEER_st::srcY"]
        [::std::mem::offset_of!(CUDA_MEMCPY3D_PEER_st, srcY) - 8usize];
    ["Offset of field: CUDA_MEMCPY3D_PEER_st::srcZ"]
        [::std::mem::offset_of!(CUDA_MEMCPY3D_PEER_st, srcZ) - 16usize];
    ["Offset of field: CUDA_MEMCPY3D_PEER_st::srcLOD"]
        [::std::mem::offset_of!(CUDA_MEMCPY3D_PEER_st, srcLOD) - 24usize];
    ["Offset of field: CUDA_MEMCPY3D_PEER_st::srcMemoryType"]
        [::std::mem::offset_of!(CUDA_MEMCPY3D_PEER_st, srcMemoryType) - 32usize];
    ["Offset of field: CUDA_MEMCPY3D_PEER_st::srcHost"]
        [::std::mem::offset_of!(CUDA_MEMCPY3D_PEER_st, srcHost) - 40usize];
    ["Offset of field: CUDA_MEMCPY3D_PEER_st::srcDevice"]
        [::std::mem::offset_of!(CUDA_MEMCPY3D_PEER_st, srcDevice) - 48usize];
    ["Offset of field: CUDA_MEMCPY3D_PEER_st::srcArray"]
        [::std::mem::offset_of!(CUDA_MEMCPY3D_PEER_st, srcArray) - 56usize];
    ["Offset of field: CUDA_MEMCPY3D_PEER_st::srcContext"]
        [::std::mem::offset_of!(CUDA_MEMCPY3D_PEER_st, srcContext) - 64usize];
    ["Offset of field: CUDA_MEMCPY3D_PEER_st::srcPitch"]
        [::std::mem::offset_of!(CUDA_MEMCPY3D_PEER_st, srcPitch) - 72usize];
    ["Offset of field: CUDA_MEMCPY3D_PEER_st::srcHeight"]
        [::std::mem::offset_of!(CUDA_MEMCPY3D_PEER_st, srcHeight) - 80usize];
    ["Offset of field: CUDA_MEMCPY3D_PEER_st::dstXInBytes"]
        [::std::mem::offset_of!(CUDA_MEMCPY3D_PEER_st, dstXInBytes) - 88usize];
    ["Offset of field: CUDA_MEMCPY3D_PEER_st::dstY"]
        [::std::mem::offset_of!(CUDA_MEMCPY3D_PEER_st, dstY) - 96usize];
    ["Offset of field: CUDA_MEMCPY3D_PEER_st::dstZ"]
        [::std::mem::offset_of!(CUDA_MEMCPY3D_PEER_st, dstZ) - 104usize];
    ["Offset of field: CUDA_MEMCPY3D_PEER_st::dstLOD"]
        [::std::mem::offset_of!(CUDA_MEMCPY3D_PEER_st, dstLOD) - 112usize];
    ["Offset of field: CUDA_MEMCPY3D_PEER_st::dstMemoryType"]
        [::std::mem::offset_of!(CUDA_MEMCPY3D_PEER_st, dstMemoryType) - 120usize];
    ["Offset of field: CUDA_MEMCPY3D_PEER_st::dstHost"]
        [::std::mem::offset_of!(CUDA_MEMCPY3D_PEER_st, dstHost) - 128usize];
    ["Offset of field: CUDA_MEMCPY3D_PEER_st::dstDevice"]
        [::std::mem::offset_of!(CUDA_MEMCPY3D_PEER_st, dstDevice) - 136usize];
    ["Offset of field: CUDA_MEMCPY3D_PEER_st::dstArray"]
        [::std::mem::offset_of!(CUDA_MEMCPY3D_PEER_st, dstArray) - 144usize];
    ["Offset of field: CUDA_MEMCPY3D_PEER_st::dstContext"]
        [::std::mem::offset_of!(CUDA_MEMCPY3D_PEER_st, dstContext) - 152usize];
    ["Offset of field: CUDA_MEMCPY3D_PEER_st::dstPitch"]
        [::std::mem::offset_of!(CUDA_MEMCPY3D_PEER_st, dstPitch) - 160usize];
    ["Offset of field: CUDA_MEMCPY3D_PEER_st::dstHeight"]
        [::std::mem::offset_of!(CUDA_MEMCPY3D_PEER_st, dstHeight) - 168usize];
    ["Offset of field: CUDA_MEMCPY3D_PEER_st::WidthInBytes"]
        [::std::mem::offset_of!(CUDA_MEMCPY3D_PEER_st, WidthInBytes) - 176usize];
    ["Offset of field: CUDA_MEMCPY3D_PEER_st::Height"]
        [::std::mem::offset_of!(CUDA_MEMCPY3D_PEER_st, Height) - 184usize];
    ["Offset of field: CUDA_MEMCPY3D_PEER_st::Depth"]
        [::std::mem::offset_of!(CUDA_MEMCPY3D_PEER_st, Depth) - 192usize];
};
#[doc = " 3D memory cross-context copy parameters"]
pub type CUDA_MEMCPY3D_PEER = CUDA_MEMCPY3D_PEER_st;
#[doc = " Array descriptor"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CUDA_ARRAY_DESCRIPTOR_st {
    #[doc = "< Width of array"]
    pub Width: usize,
    #[doc = "< Height of array"]
    pub Height: usize,
    #[doc = "< Array format"]
    pub Format: CUarray_format,
    #[doc = "< Channels per array element"]
    pub NumChannels: ::std::os::raw::c_uint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of CUDA_ARRAY_DESCRIPTOR_st"]
        [::std::mem::size_of::<CUDA_ARRAY_DESCRIPTOR_st>() - 24usize];
    ["Alignment of CUDA_ARRAY_DESCRIPTOR_st"]
        [::std::mem::align_of::<CUDA_ARRAY_DESCRIPTOR_st>() - 8usize];
    ["Offset of field: CUDA_ARRAY_DESCRIPTOR_st::Width"]
        [::std::mem::offset_of!(CUDA_ARRAY_DESCRIPTOR_st, Width) - 0usize];
    ["Offset of field: CUDA_ARRAY_DESCRIPTOR_st::Height"]
        [::std::mem::offset_of!(CUDA_ARRAY_DESCRIPTOR_st, Height) - 8usize];
    ["Offset of field: CUDA_ARRAY_DESCRIPTOR_st::Format"]
        [::std::mem::offset_of!(CUDA_ARRAY_DESCRIPTOR_st, Format) - 16usize];
    ["Offset of field: CUDA_ARRAY_DESCRIPTOR_st::NumChannels"]
        [::std::mem::offset_of!(CUDA_ARRAY_DESCRIPTOR_st, NumChannels) - 20usize];
};
#[doc = " Array descriptor"]
pub type CUDA_ARRAY_DESCRIPTOR = CUDA_ARRAY_DESCRIPTOR_st;
#[doc = " 3D array descriptor"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CUDA_ARRAY3D_DESCRIPTOR_st {
    #[doc = "< Width of 3D array"]
    pub Width: usize,
    #[doc = "< Height of 3D array"]
    pub Height: usize,
    #[doc = "< Depth of 3D array"]
    pub Depth: usize,
    #[doc = "< Array format"]
    pub Format: CUarray_format,
    #[doc = "< Channels per array element"]
    pub NumChannels: ::std::os::raw::c_uint,
    #[doc = "< Flags"]
    pub Flags: ::std::os::raw::c_uint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of CUDA_ARRAY3D_DESCRIPTOR_st"]
        [::std::mem::size_of::<CUDA_ARRAY3D_DESCRIPTOR_st>() - 40usize];
    ["Alignment of CUDA_ARRAY3D_DESCRIPTOR_st"]
        [::std::mem::align_of::<CUDA_ARRAY3D_DESCRIPTOR_st>() - 8usize];
    ["Offset of field: CUDA_ARRAY3D_DESCRIPTOR_st::Width"]
        [::std::mem::offset_of!(CUDA_ARRAY3D_DESCRIPTOR_st, Width) - 0usize];
    ["Offset of field: CUDA_ARRAY3D_DESCRIPTOR_st::Height"]
        [::std::mem::offset_of!(CUDA_ARRAY3D_DESCRIPTOR_st, Height) - 8usize];
    ["Offset of field: CUDA_ARRAY3D_DESCRIPTOR_st::Depth"]
        [::std::mem::offset_of!(CUDA_ARRAY3D_DESCRIPTOR_st, Depth) - 16usize];
    ["Offset of field: CUDA_ARRAY3D_DESCRIPTOR_st::Format"]
        [::std::mem::offset_of!(CUDA_ARRAY3D_DESCRIPTOR_st, Format) - 24usize];
    ["Offset of field: CUDA_ARRAY3D_DESCRIPTOR_st::NumChannels"]
        [::std::mem::offset_of!(CUDA_ARRAY3D_DESCRIPTOR_st, NumChannels) - 28usize];
    ["Offset of field: CUDA_ARRAY3D_DESCRIPTOR_st::Flags"]
        [::std::mem::offset_of!(CUDA_ARRAY3D_DESCRIPTOR_st, Flags) - 32usize];
};
#[doc = " 3D array descriptor"]
pub type CUDA_ARRAY3D_DESCRIPTOR = CUDA_ARRAY3D_DESCRIPTOR_st;
#[doc = " CUDA Resource descriptor"]
#[repr(C)]
#[derive(Copy, Clone)]
pub struct CUDA_RESOURCE_DESC_st {
    #[doc = "< Resource type"]
    pub resType: CUresourcetype,
    pub res: CUDA_RESOURCE_DESC_st__bindgen_ty_1,
    #[doc = "< Flags (must be zero)"]
    pub flags: ::std::os::raw::c_uint,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union CUDA_RESOURCE_DESC_st__bindgen_ty_1 {
    pub array: CUDA_RESOURCE_DESC_st__bindgen_ty_1__bindgen_ty_1,
    pub mipmap: CUDA_RESOURCE_DESC_st__bindgen_ty_1__bindgen_ty_2,
    pub linear: CUDA_RESOURCE_DESC_st__bindgen_ty_1__bindgen_ty_3,
    pub pitch2D: CUDA_RESOURCE_DESC_st__bindgen_ty_1__bindgen_ty_4,
    pub reserved: CUDA_RESOURCE_DESC_st__bindgen_ty_1__bindgen_ty_5,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CUDA_RESOURCE_DESC_st__bindgen_ty_1__bindgen_ty_1 {
    #[doc = "< CUDA array"]
    pub hArray: CUarray,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of CUDA_RESOURCE_DESC_st__bindgen_ty_1__bindgen_ty_1"]
        [::std::mem::size_of::<CUDA_RESOURCE_DESC_st__bindgen_ty_1__bindgen_ty_1>() - 8usize];
    ["Alignment of CUDA_RESOURCE_DESC_st__bindgen_ty_1__bindgen_ty_1"]
        [::std::mem::align_of::<CUDA_RESOURCE_DESC_st__bindgen_ty_1__bindgen_ty_1>() - 8usize];
    ["Offset of field: CUDA_RESOURCE_DESC_st__bindgen_ty_1__bindgen_ty_1::hArray"][::std::mem::offset_of!(
        CUDA_RESOURCE_DESC_st__bindgen_ty_1__bindgen_ty_1,
        hArray
    ) - 0usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CUDA_RESOURCE_DESC_st__bindgen_ty_1__bindgen_ty_2 {
    #[doc = "< CUDA mipmapped array"]
    pub hMipmappedArray: CUmipmappedArray,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of CUDA_RESOURCE_DESC_st__bindgen_ty_1__bindgen_ty_2"]
        [::std::mem::size_of::<CUDA_RESOURCE_DESC_st__bindgen_ty_1__bindgen_ty_2>() - 8usize];
    ["Alignment of CUDA_RESOURCE_DESC_st__bindgen_ty_1__bindgen_ty_2"]
        [::std::mem::align_of::<CUDA_RESOURCE_DESC_st__bindgen_ty_1__bindgen_ty_2>() - 8usize];
    ["Offset of field: CUDA_RESOURCE_DESC_st__bindgen_ty_1__bindgen_ty_2::hMipmappedArray"][::std::mem::offset_of!(
        CUDA_RESOURCE_DESC_st__bindgen_ty_1__bindgen_ty_2,
        hMipmappedArray
    )
        - 0usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CUDA_RESOURCE_DESC_st__bindgen_ty_1__bindgen_ty_3 {
    #[doc = "< Device pointer"]
    pub devPtr: CUdeviceptr,
    #[doc = "< Array format"]
    pub format: CUarray_format,
    #[doc = "< Channels per array element"]
    pub numChannels: ::std::os::raw::c_uint,
    #[doc = "< Size in bytes"]
    pub sizeInBytes: usize,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of CUDA_RESOURCE_DESC_st__bindgen_ty_1__bindgen_ty_3"]
        [::std::mem::size_of::<CUDA_RESOURCE_DESC_st__bindgen_ty_1__bindgen_ty_3>() - 24usize];
    ["Alignment of CUDA_RESOURCE_DESC_st__bindgen_ty_1__bindgen_ty_3"]
        [::std::mem::align_of::<CUDA_RESOURCE_DESC_st__bindgen_ty_1__bindgen_ty_3>() - 8usize];
    ["Offset of field: CUDA_RESOURCE_DESC_st__bindgen_ty_1__bindgen_ty_3::devPtr"][::std::mem::offset_of!(
        CUDA_RESOURCE_DESC_st__bindgen_ty_1__bindgen_ty_3,
        devPtr
    ) - 0usize];
    ["Offset of field: CUDA_RESOURCE_DESC_st__bindgen_ty_1__bindgen_ty_3::format"][::std::mem::offset_of!(
        CUDA_RESOURCE_DESC_st__bindgen_ty_1__bindgen_ty_3,
        format
    ) - 8usize];
    ["Offset of field: CUDA_RESOURCE_DESC_st__bindgen_ty_1__bindgen_ty_3::numChannels"][::std::mem::offset_of!(
        CUDA_RESOURCE_DESC_st__bindgen_ty_1__bindgen_ty_3,
        numChannels
    )
        - 12usize];
    ["Offset of field: CUDA_RESOURCE_DESC_st__bindgen_ty_1__bindgen_ty_3::sizeInBytes"][::std::mem::offset_of!(
        CUDA_RESOURCE_DESC_st__bindgen_ty_1__bindgen_ty_3,
        sizeInBytes
    )
        - 16usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CUDA_RESOURCE_DESC_st__bindgen_ty_1__bindgen_ty_4 {
    #[doc = "< Device pointer"]
    pub devPtr: CUdeviceptr,
    #[doc = "< Array format"]
    pub format: CUarray_format,
    #[doc = "< Channels per array element"]
    pub numChannels: ::std::os::raw::c_uint,
    #[doc = "< Width of the array in elements"]
    pub width: usize,
    #[doc = "< Height of the array in elements"]
    pub height: usize,
    #[doc = "< Pitch between two rows in bytes"]
    pub pitchInBytes: usize,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of CUDA_RESOURCE_DESC_st__bindgen_ty_1__bindgen_ty_4"]
        [::std::mem::size_of::<CUDA_RESOURCE_DESC_st__bindgen_ty_1__bindgen_ty_4>() - 40usize];
    ["Alignment of CUDA_RESOURCE_DESC_st__bindgen_ty_1__bindgen_ty_4"]
        [::std::mem::align_of::<CUDA_RESOURCE_DESC_st__bindgen_ty_1__bindgen_ty_4>() - 8usize];
    ["Offset of field: CUDA_RESOURCE_DESC_st__bindgen_ty_1__bindgen_ty_4::devPtr"][::std::mem::offset_of!(
        CUDA_RESOURCE_DESC_st__bindgen_ty_1__bindgen_ty_4,
        devPtr
    ) - 0usize];
    ["Offset of field: CUDA_RESOURCE_DESC_st__bindgen_ty_1__bindgen_ty_4::format"][::std::mem::offset_of!(
        CUDA_RESOURCE_DESC_st__bindgen_ty_1__bindgen_ty_4,
        format
    ) - 8usize];
    ["Offset of field: CUDA_RESOURCE_DESC_st__bindgen_ty_1__bindgen_ty_4::numChannels"][::std::mem::offset_of!(
        CUDA_RESOURCE_DESC_st__bindgen_ty_1__bindgen_ty_4,
        numChannels
    )
        - 12usize];
    ["Offset of field: CUDA_RESOURCE_DESC_st__bindgen_ty_1__bindgen_ty_4::width"][::std::mem::offset_of!(
        CUDA_RESOURCE_DESC_st__bindgen_ty_1__bindgen_ty_4,
        width
    ) - 16usize];
    ["Offset of field: CUDA_RESOURCE_DESC_st__bindgen_ty_1__bindgen_ty_4::height"][::std::mem::offset_of!(
        CUDA_RESOURCE_DESC_st__bindgen_ty_1__bindgen_ty_4,
        height
    ) - 24usize];
    ["Offset of field: CUDA_RESOURCE_DESC_st__bindgen_ty_1__bindgen_ty_4::pitchInBytes"][::std::mem::offset_of!(
        CUDA_RESOURCE_DESC_st__bindgen_ty_1__bindgen_ty_4,
        pitchInBytes
    )
        - 32usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CUDA_RESOURCE_DESC_st__bindgen_ty_1__bindgen_ty_5 {
    pub reserved: [::std::os::raw::c_int; 32usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of CUDA_RESOURCE_DESC_st__bindgen_ty_1__bindgen_ty_5"]
        [::std::mem::size_of::<CUDA_RESOURCE_DESC_st__bindgen_ty_1__bindgen_ty_5>() - 128usize];
    ["Alignment of CUDA_RESOURCE_DESC_st__bindgen_ty_1__bindgen_ty_5"]
        [::std::mem::align_of::<CUDA_RESOURCE_DESC_st__bindgen_ty_1__bindgen_ty_5>() - 4usize];
    ["Offset of field: CUDA_RESOURCE_DESC_st__bindgen_ty_1__bindgen_ty_5::reserved"][::std::mem::offset_of!(
        CUDA_RESOURCE_DESC_st__bindgen_ty_1__bindgen_ty_5,
        reserved
    ) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of CUDA_RESOURCE_DESC_st__bindgen_ty_1"]
        [::std::mem::size_of::<CUDA_RESOURCE_DESC_st__bindgen_ty_1>() - 128usize];
    ["Alignment of CUDA_RESOURCE_DESC_st__bindgen_ty_1"]
        [::std::mem::align_of::<CUDA_RESOURCE_DESC_st__bindgen_ty_1>() - 8usize];
    ["Offset of field: CUDA_RESOURCE_DESC_st__bindgen_ty_1::array"]
        [::std::mem::offset_of!(CUDA_RESOURCE_DESC_st__bindgen_ty_1, array) - 0usize];
    ["Offset of field: CUDA_RESOURCE_DESC_st__bindgen_ty_1::mipmap"]
        [::std::mem::offset_of!(CUDA_RESOURCE_DESC_st__bindgen_ty_1, mipmap) - 0usize];
    ["Offset of field: CUDA_RESOURCE_DESC_st__bindgen_ty_1::linear"]
        [::std::mem::offset_of!(CUDA_RESOURCE_DESC_st__bindgen_ty_1, linear) - 0usize];
    ["Offset of field: CUDA_RESOURCE_DESC_st__bindgen_ty_1::pitch2D"]
        [::std::mem::offset_of!(CUDA_RESOURCE_DESC_st__bindgen_ty_1, pitch2D) - 0usize];
    ["Offset of field: CUDA_RESOURCE_DESC_st__bindgen_ty_1::reserved"]
        [::std::mem::offset_of!(CUDA_RESOURCE_DESC_st__bindgen_ty_1, reserved) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of CUDA_RESOURCE_DESC_st"][::std::mem::size_of::<CUDA_RESOURCE_DESC_st>() - 144usize];
    ["Alignment of CUDA_RESOURCE_DESC_st"]
        [::std::mem::align_of::<CUDA_RESOURCE_DESC_st>() - 8usize];
    ["Offset of field: CUDA_RESOURCE_DESC_st::resType"]
        [::std::mem::offset_of!(CUDA_RESOURCE_DESC_st, resType) - 0usize];
    ["Offset of field: CUDA_RESOURCE_DESC_st::res"]
        [::std::mem::offset_of!(CUDA_RESOURCE_DESC_st, res) - 8usize];
    ["Offset of field: CUDA_RESOURCE_DESC_st::flags"]
        [::std::mem::offset_of!(CUDA_RESOURCE_DESC_st, flags) - 136usize];
};
#[doc = " CUDA Resource descriptor"]
pub type CUDA_RESOURCE_DESC = CUDA_RESOURCE_DESC_st;
#[doc = " Texture descriptor"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CUDA_TEXTURE_DESC_st {
    #[doc = "< Address modes"]
    pub addressMode: [CUaddress_mode; 3usize],
    #[doc = "< Filter mode"]
    pub filterMode: CUfilter_mode,
    #[doc = "< Flags"]
    pub flags: ::std::os::raw::c_uint,
    #[doc = "< Maximum anisotropy ratio"]
    pub maxAnisotropy: ::std::os::raw::c_uint,
    #[doc = "< Mipmap filter mode"]
    pub mipmapFilterMode: CUfilter_mode,
    #[doc = "< Mipmap level bias"]
    pub mipmapLevelBias: f32,
    #[doc = "< Mipmap minimum level clamp"]
    pub minMipmapLevelClamp: f32,
    #[doc = "< Mipmap maximum level clamp"]
    pub maxMipmapLevelClamp: f32,
    #[doc = "< Border Color"]
    pub borderColor: [f32; 4usize],
    pub reserved: [::std::os::raw::c_int; 12usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of CUDA_TEXTURE_DESC_st"][::std::mem::size_of::<CUDA_TEXTURE_DESC_st>() - 104usize];
    ["Alignment of CUDA_TEXTURE_DESC_st"][::std::mem::align_of::<CUDA_TEXTURE_DESC_st>() - 4usize];
    ["Offset of field: CUDA_TEXTURE_DESC_st::addressMode"]
        [::std::mem::offset_of!(CUDA_TEXTURE_DESC_st, addressMode) - 0usize];
    ["Offset of field: CUDA_TEXTURE_DESC_st::filterMode"]
        [::std::mem::offset_of!(CUDA_TEXTURE_DESC_st, filterMode) - 12usize];
    ["Offset of field: CUDA_TEXTURE_DESC_st::flags"]
        [::std::mem::offset_of!(CUDA_TEXTURE_DESC_st, flags) - 16usize];
    ["Offset of field: CUDA_TEXTURE_DESC_st::maxAnisotropy"]
        [::std::mem::offset_of!(CUDA_TEXTURE_DESC_st, maxAnisotropy) - 20usize];
    ["Offset of field: CUDA_TEXTURE_DESC_st::mipmapFilterMode"]
        [::std::mem::offset_of!(CUDA_TEXTURE_DESC_st, mipmapFilterMode) - 24usize];
    ["Offset of field: CUDA_TEXTURE_DESC_st::mipmapLevelBias"]
        [::std::mem::offset_of!(CUDA_TEXTURE_DESC_st, mipmapLevelBias) - 28usize];
    ["Offset of field: CUDA_TEXTURE_DESC_st::minMipmapLevelClamp"]
        [::std::mem::offset_of!(CUDA_TEXTURE_DESC_st, minMipmapLevelClamp) - 32usize];
    ["Offset of field: CUDA_TEXTURE_DESC_st::maxMipmapLevelClamp"]
        [::std::mem::offset_of!(CUDA_TEXTURE_DESC_st, maxMipmapLevelClamp) - 36usize];
    ["Offset of field: CUDA_TEXTURE_DESC_st::borderColor"]
        [::std::mem::offset_of!(CUDA_TEXTURE_DESC_st, borderColor) - 40usize];
    ["Offset of field: CUDA_TEXTURE_DESC_st::reserved"]
        [::std::mem::offset_of!(CUDA_TEXTURE_DESC_st, reserved) - 56usize];
};
#[doc = " Texture descriptor"]
pub type CUDA_TEXTURE_DESC = CUDA_TEXTURE_DESC_st;
pub mod CUresourceViewFormat_enum {
    #[doc = " Resource view format"]
    pub type Type = ::std::os::raw::c_uint;
    #[doc = "< No resource view format (use underlying resource format)"]
    pub const CU_RES_VIEW_FORMAT_NONE: Type = 0;
    #[doc = "< 1 channel unsigned 8-bit integers"]
    pub const CU_RES_VIEW_FORMAT_UINT_1X8: Type = 1;
    #[doc = "< 2 channel unsigned 8-bit integers"]
    pub const CU_RES_VIEW_FORMAT_UINT_2X8: Type = 2;
    #[doc = "< 4 channel unsigned 8-bit integers"]
    pub const CU_RES_VIEW_FORMAT_UINT_4X8: Type = 3;
    #[doc = "< 1 channel signed 8-bit integers"]
    pub const CU_RES_VIEW_FORMAT_SINT_1X8: Type = 4;
    #[doc = "< 2 channel signed 8-bit integers"]
    pub const CU_RES_VIEW_FORMAT_SINT_2X8: Type = 5;
    #[doc = "< 4 channel signed 8-bit integers"]
    pub const CU_RES_VIEW_FORMAT_SINT_4X8: Type = 6;
    #[doc = "< 1 channel unsigned 16-bit integers"]
    pub const CU_RES_VIEW_FORMAT_UINT_1X16: Type = 7;
    #[doc = "< 2 channel unsigned 16-bit integers"]
    pub const CU_RES_VIEW_FORMAT_UINT_2X16: Type = 8;
    #[doc = "< 4 channel unsigned 16-bit integers"]
    pub const CU_RES_VIEW_FORMAT_UINT_4X16: Type = 9;
    #[doc = "< 1 channel signed 16-bit integers"]
    pub const CU_RES_VIEW_FORMAT_SINT_1X16: Type = 10;
    #[doc = "< 2 channel signed 16-bit integers"]
    pub const CU_RES_VIEW_FORMAT_SINT_2X16: Type = 11;
    #[doc = "< 4 channel signed 16-bit integers"]
    pub const CU_RES_VIEW_FORMAT_SINT_4X16: Type = 12;
    #[doc = "< 1 channel unsigned 32-bit integers"]
    pub const CU_RES_VIEW_FORMAT_UINT_1X32: Type = 13;
    #[doc = "< 2 channel unsigned 32-bit integers"]
    pub const CU_RES_VIEW_FORMAT_UINT_2X32: Type = 14;
    #[doc = "< 4 channel unsigned 32-bit integers"]
    pub const CU_RES_VIEW_FORMAT_UINT_4X32: Type = 15;
    #[doc = "< 1 channel signed 32-bit integers"]
    pub const CU_RES_VIEW_FORMAT_SINT_1X32: Type = 16;
    #[doc = "< 2 channel signed 32-bit integers"]
    pub const CU_RES_VIEW_FORMAT_SINT_2X32: Type = 17;
    #[doc = "< 4 channel signed 32-bit integers"]
    pub const CU_RES_VIEW_FORMAT_SINT_4X32: Type = 18;
    #[doc = "< 1 channel 16-bit floating point"]
    pub const CU_RES_VIEW_FORMAT_FLOAT_1X16: Type = 19;
    #[doc = "< 2 channel 16-bit floating point"]
    pub const CU_RES_VIEW_FORMAT_FLOAT_2X16: Type = 20;
    #[doc = "< 4 channel 16-bit floating point"]
    pub const CU_RES_VIEW_FORMAT_FLOAT_4X16: Type = 21;
    #[doc = "< 1 channel 32-bit floating point"]
    pub const CU_RES_VIEW_FORMAT_FLOAT_1X32: Type = 22;
    #[doc = "< 2 channel 32-bit floating point"]
    pub const CU_RES_VIEW_FORMAT_FLOAT_2X32: Type = 23;
    #[doc = "< 4 channel 32-bit floating point"]
    pub const CU_RES_VIEW_FORMAT_FLOAT_4X32: Type = 24;
    #[doc = "< Block compressed 1"]
    pub const CU_RES_VIEW_FORMAT_UNSIGNED_BC1: Type = 25;
    #[doc = "< Block compressed 2"]
    pub const CU_RES_VIEW_FORMAT_UNSIGNED_BC2: Type = 26;
    #[doc = "< Block compressed 3"]
    pub const CU_RES_VIEW_FORMAT_UNSIGNED_BC3: Type = 27;
    #[doc = "< Block compressed 4 unsigned"]
    pub const CU_RES_VIEW_FORMAT_UNSIGNED_BC4: Type = 28;
    #[doc = "< Block compressed 4 signed"]
    pub const CU_RES_VIEW_FORMAT_SIGNED_BC4: Type = 29;
    #[doc = "< Block compressed 5 unsigned"]
    pub const CU_RES_VIEW_FORMAT_UNSIGNED_BC5: Type = 30;
    #[doc = "< Block compressed 5 signed"]
    pub const CU_RES_VIEW_FORMAT_SIGNED_BC5: Type = 31;
    #[doc = "< Block compressed 6 unsigned half-float"]
    pub const CU_RES_VIEW_FORMAT_UNSIGNED_BC6H: Type = 32;
    #[doc = "< Block compressed 6 signed half-float"]
    pub const CU_RES_VIEW_FORMAT_SIGNED_BC6H: Type = 33;
    #[doc = "< Block compressed 7"]
    pub const CU_RES_VIEW_FORMAT_UNSIGNED_BC7: Type = 34;
}
#[doc = " Resource view format"]
pub use self::CUresourceViewFormat_enum::Type as CUresourceViewFormat;
#[doc = " Resource view descriptor"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CUDA_RESOURCE_VIEW_DESC_st {
    #[doc = "< Resource view format"]
    pub format: CUresourceViewFormat,
    #[doc = "< Width of the resource view"]
    pub width: usize,
    #[doc = "< Height of the resource view"]
    pub height: usize,
    #[doc = "< Depth of the resource view"]
    pub depth: usize,
    #[doc = "< First defined mipmap level"]
    pub firstMipmapLevel: ::std::os::raw::c_uint,
    #[doc = "< Last defined mipmap level"]
    pub lastMipmapLevel: ::std::os::raw::c_uint,
    #[doc = "< First layer index"]
    pub firstLayer: ::std::os::raw::c_uint,
    #[doc = "< Last layer index"]
    pub lastLayer: ::std::os::raw::c_uint,
    pub reserved: [::std::os::raw::c_uint; 16usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of CUDA_RESOURCE_VIEW_DESC_st"]
        [::std::mem::size_of::<CUDA_RESOURCE_VIEW_DESC_st>() - 112usize];
    ["Alignment of CUDA_RESOURCE_VIEW_DESC_st"]
        [::std::mem::align_of::<CUDA_RESOURCE_VIEW_DESC_st>() - 8usize];
    ["Offset of field: CUDA_RESOURCE_VIEW_DESC_st::format"]
        [::std::mem::offset_of!(CUDA_RESOURCE_VIEW_DESC_st, format) - 0usize];
    ["Offset of field: CUDA_RESOURCE_VIEW_DESC_st::width"]
        [::std::mem::offset_of!(CUDA_RESOURCE_VIEW_DESC_st, width) - 8usize];
    ["Offset of field: CUDA_RESOURCE_VIEW_DESC_st::height"]
        [::std::mem::offset_of!(CUDA_RESOURCE_VIEW_DESC_st, height) - 16usize];
    ["Offset of field: CUDA_RESOURCE_VIEW_DESC_st::depth"]
        [::std::mem::offset_of!(CUDA_RESOURCE_VIEW_DESC_st, depth) - 24usize];
    ["Offset of field: CUDA_RESOURCE_VIEW_DESC_st::firstMipmapLevel"]
        [::std::mem::offset_of!(CUDA_RESOURCE_VIEW_DESC_st, firstMipmapLevel) - 32usize];
    ["Offset of field: CUDA_RESOURCE_VIEW_DESC_st::lastMipmapLevel"]
        [::std::mem::offset_of!(CUDA_RESOURCE_VIEW_DESC_st, lastMipmapLevel) - 36usize];
    ["Offset of field: CUDA_RESOURCE_VIEW_DESC_st::firstLayer"]
        [::std::mem::offset_of!(CUDA_RESOURCE_VIEW_DESC_st, firstLayer) - 40usize];
    ["Offset of field: CUDA_RESOURCE_VIEW_DESC_st::lastLayer"]
        [::std::mem::offset_of!(CUDA_RESOURCE_VIEW_DESC_st, lastLayer) - 44usize];
    ["Offset of field: CUDA_RESOURCE_VIEW_DESC_st::reserved"]
        [::std::mem::offset_of!(CUDA_RESOURCE_VIEW_DESC_st, reserved) - 48usize];
};
#[doc = " Resource view descriptor"]
pub type CUDA_RESOURCE_VIEW_DESC = CUDA_RESOURCE_VIEW_DESC_st;
#[doc = " GPU Direct v3 tokens"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CUDA_POINTER_ATTRIBUTE_P2P_TOKENS_st {
    pub p2pToken: ::std::os::raw::c_ulonglong,
    pub vaSpaceToken: ::std::os::raw::c_uint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of CUDA_POINTER_ATTRIBUTE_P2P_TOKENS_st"]
        [::std::mem::size_of::<CUDA_POINTER_ATTRIBUTE_P2P_TOKENS_st>() - 16usize];
    ["Alignment of CUDA_POINTER_ATTRIBUTE_P2P_TOKENS_st"]
        [::std::mem::align_of::<CUDA_POINTER_ATTRIBUTE_P2P_TOKENS_st>() - 8usize];
    ["Offset of field: CUDA_POINTER_ATTRIBUTE_P2P_TOKENS_st::p2pToken"]
        [::std::mem::offset_of!(CUDA_POINTER_ATTRIBUTE_P2P_TOKENS_st, p2pToken) - 0usize];
    ["Offset of field: CUDA_POINTER_ATTRIBUTE_P2P_TOKENS_st::vaSpaceToken"]
        [::std::mem::offset_of!(CUDA_POINTER_ATTRIBUTE_P2P_TOKENS_st, vaSpaceToken) - 8usize];
};
#[doc = " GPU Direct v3 tokens"]
pub type CUDA_POINTER_ATTRIBUTE_P2P_TOKENS = CUDA_POINTER_ATTRIBUTE_P2P_TOKENS_st;
#[doc = " Kernel launch parameters"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CUDA_LAUNCH_PARAMS_st {
    #[doc = "< Kernel to launch"]
    pub function: CUfunction,
    #[doc = "< Width of grid in blocks"]
    pub gridDimX: ::std::os::raw::c_uint,
    #[doc = "< Height of grid in blocks"]
    pub gridDimY: ::std::os::raw::c_uint,
    #[doc = "< Depth of grid in blocks"]
    pub gridDimZ: ::std::os::raw::c_uint,
    #[doc = "< X dimension of each thread block"]
    pub blockDimX: ::std::os::raw::c_uint,
    #[doc = "< Y dimension of each thread block"]
    pub blockDimY: ::std::os::raw::c_uint,
    #[doc = "< Z dimension of each thread block"]
    pub blockDimZ: ::std::os::raw::c_uint,
    #[doc = "< Dynamic shared-memory size per thread block in bytes"]
    pub sharedMemBytes: ::std::os::raw::c_uint,
    #[doc = "< Stream identifier"]
    pub hStream: CUstream,
    #[doc = "< Array of pointers to kernel parameters"]
    pub kernelParams: *mut *mut ::std::os::raw::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of CUDA_LAUNCH_PARAMS_st"][::std::mem::size_of::<CUDA_LAUNCH_PARAMS_st>() - 56usize];
    ["Alignment of CUDA_LAUNCH_PARAMS_st"]
        [::std::mem::align_of::<CUDA_LAUNCH_PARAMS_st>() - 8usize];
    ["Offset of field: CUDA_LAUNCH_PARAMS_st::function"]
        [::std::mem::offset_of!(CUDA_LAUNCH_PARAMS_st, function) - 0usize];
    ["Offset of field: CUDA_LAUNCH_PARAMS_st::gridDimX"]
        [::std::mem::offset_of!(CUDA_LAUNCH_PARAMS_st, gridDimX) - 8usize];
    ["Offset of field: CUDA_LAUNCH_PARAMS_st::gridDimY"]
        [::std::mem::offset_of!(CUDA_LAUNCH_PARAMS_st, gridDimY) - 12usize];
    ["Offset of field: CUDA_LAUNCH_PARAMS_st::gridDimZ"]
        [::std::mem::offset_of!(CUDA_LAUNCH_PARAMS_st, gridDimZ) - 16usize];
    ["Offset of field: CUDA_LAUNCH_PARAMS_st::blockDimX"]
        [::std::mem::offset_of!(CUDA_LAUNCH_PARAMS_st, blockDimX) - 20usize];
    ["Offset of field: CUDA_LAUNCH_PARAMS_st::blockDimY"]
        [::std::mem::offset_of!(CUDA_LAUNCH_PARAMS_st, blockDimY) - 24usize];
    ["Offset of field: CUDA_LAUNCH_PARAMS_st::blockDimZ"]
        [::std::mem::offset_of!(CUDA_LAUNCH_PARAMS_st, blockDimZ) - 28usize];
    ["Offset of field: CUDA_LAUNCH_PARAMS_st::sharedMemBytes"]
        [::std::mem::offset_of!(CUDA_LAUNCH_PARAMS_st, sharedMemBytes) - 32usize];
    ["Offset of field: CUDA_LAUNCH_PARAMS_st::hStream"]
        [::std::mem::offset_of!(CUDA_LAUNCH_PARAMS_st, hStream) - 40usize];
    ["Offset of field: CUDA_LAUNCH_PARAMS_st::kernelParams"]
        [::std::mem::offset_of!(CUDA_LAUNCH_PARAMS_st, kernelParams) - 48usize];
};
#[doc = " Kernel launch parameters"]
pub type CUDA_LAUNCH_PARAMS = CUDA_LAUNCH_PARAMS_st;
pub mod CUexternalMemoryHandleType_enum {
    #[doc = " External memory handle types"]
    pub type Type = ::std::os::raw::c_uint;
    #[doc = " Handle is an opaque file descriptor"]
    pub const CU_EXTERNAL_MEMORY_HANDLE_TYPE_OPAQUE_FD: Type = 1;
    #[doc = " Handle is an opaque shared NT handle"]
    pub const CU_EXTERNAL_MEMORY_HANDLE_TYPE_OPAQUE_WIN32: Type = 2;
    #[doc = " Handle is an opaque, globally shared handle"]
    pub const CU_EXTERNAL_MEMORY_HANDLE_TYPE_OPAQUE_WIN32_KMT: Type = 3;
    #[doc = " Handle is a D3D12 heap object"]
    pub const CU_EXTERNAL_MEMORY_HANDLE_TYPE_D3D12_HEAP: Type = 4;
    #[doc = " Handle is a D3D12 committed resource"]
    pub const CU_EXTERNAL_MEMORY_HANDLE_TYPE_D3D12_RESOURCE: Type = 5;
}
#[doc = " External memory handle types"]
pub use self::CUexternalMemoryHandleType_enum::Type as CUexternalMemoryHandleType;
#[doc = " External memory handle descriptor"]
#[repr(C)]
#[derive(Copy, Clone)]
pub struct CUDA_EXTERNAL_MEMORY_HANDLE_DESC_st {
    #[doc = " Type of the handle"]
    pub type_: CUexternalMemoryHandleType,
    pub handle: CUDA_EXTERNAL_MEMORY_HANDLE_DESC_st__bindgen_ty_1,
    #[doc = " Size of the memory allocation"]
    pub size: ::std::os::raw::c_ulonglong,
    #[doc = " Flags must either be zero or ::CUDA_EXTERNAL_MEMORY_DEDICATED"]
    pub flags: ::std::os::raw::c_uint,
    pub reserved: [::std::os::raw::c_uint; 16usize],
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union CUDA_EXTERNAL_MEMORY_HANDLE_DESC_st__bindgen_ty_1 {
    #[doc = " File descriptor referencing the memory object. Valid\n when type is\n ::CU_EXTERNAL_MEMORY_HANDLE_TYPE_OPAQUE_FD"]
    pub fd: ::std::os::raw::c_int,
    pub win32: CUDA_EXTERNAL_MEMORY_HANDLE_DESC_st__bindgen_ty_1__bindgen_ty_1,
}
#[doc = " Win32 handle referencing the semaphore object. Valid when\n type is one of the following:\n - ::CU_EXTERNAL_MEMORY_HANDLE_TYPE_OPAQUE_WIN32\n - ::CU_EXTERNAL_MEMORY_HANDLE_TYPE_OPAQUE_WIN32_KMT\n - ::CU_EXTERNAL_MEMORY_HANDLE_TYPE_D3D12_HEAP\n - ::CU_EXTERNAL_MEMORY_HANDLE_TYPE_D3D12_RESOURCE\n Exactly one of 'handle' and 'name' must be non-NULL. If\n type is\n ::CU_EXTERNAL_SEMAPHORE_HANDLE_TYPE_OPAQUE_WIN32_KMT\n then 'name' must be NULL."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CUDA_EXTERNAL_MEMORY_HANDLE_DESC_st__bindgen_ty_1__bindgen_ty_1 {
    #[doc = " Valid NT handle. Must be NULL if 'name' is non-NULL"]
    pub handle: *mut ::std::os::raw::c_void,
    #[doc = " Name of a valid memory object.\n Must be NULL if 'handle' is non-NULL."]
    pub name: *const ::std::os::raw::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of CUDA_EXTERNAL_MEMORY_HANDLE_DESC_st__bindgen_ty_1__bindgen_ty_1"][::std::mem::size_of::<
        CUDA_EXTERNAL_MEMORY_HANDLE_DESC_st__bindgen_ty_1__bindgen_ty_1,
    >() - 16usize];
    ["Alignment of CUDA_EXTERNAL_MEMORY_HANDLE_DESC_st__bindgen_ty_1__bindgen_ty_1"]
        [::std::mem::align_of::<CUDA_EXTERNAL_MEMORY_HANDLE_DESC_st__bindgen_ty_1__bindgen_ty_1>()
            - 8usize];
    ["Offset of field: CUDA_EXTERNAL_MEMORY_HANDLE_DESC_st__bindgen_ty_1__bindgen_ty_1::handle"][::std::mem::offset_of!(
        CUDA_EXTERNAL_MEMORY_HANDLE_DESC_st__bindgen_ty_1__bindgen_ty_1,
        handle
    )
        - 0usize];
    ["Offset of field: CUDA_EXTERNAL_MEMORY_HANDLE_DESC_st__bindgen_ty_1__bindgen_ty_1::name"][::std::mem::offset_of!(
        CUDA_EXTERNAL_MEMORY_HANDLE_DESC_st__bindgen_ty_1__bindgen_ty_1,
        name
    )
        - 8usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of CUDA_EXTERNAL_MEMORY_HANDLE_DESC_st__bindgen_ty_1"]
        [::std::mem::size_of::<CUDA_EXTERNAL_MEMORY_HANDLE_DESC_st__bindgen_ty_1>() - 16usize];
    ["Alignment of CUDA_EXTERNAL_MEMORY_HANDLE_DESC_st__bindgen_ty_1"]
        [::std::mem::align_of::<CUDA_EXTERNAL_MEMORY_HANDLE_DESC_st__bindgen_ty_1>() - 8usize];
    ["Offset of field: CUDA_EXTERNAL_MEMORY_HANDLE_DESC_st__bindgen_ty_1::fd"]
        [::std::mem::offset_of!(CUDA_EXTERNAL_MEMORY_HANDLE_DESC_st__bindgen_ty_1, fd) - 0usize];
    ["Offset of field: CUDA_EXTERNAL_MEMORY_HANDLE_DESC_st__bindgen_ty_1::win32"]
        [::std::mem::offset_of!(CUDA_EXTERNAL_MEMORY_HANDLE_DESC_st__bindgen_ty_1, win32) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of CUDA_EXTERNAL_MEMORY_HANDLE_DESC_st"]
        [::std::mem::size_of::<CUDA_EXTERNAL_MEMORY_HANDLE_DESC_st>() - 104usize];
    ["Alignment of CUDA_EXTERNAL_MEMORY_HANDLE_DESC_st"]
        [::std::mem::align_of::<CUDA_EXTERNAL_MEMORY_HANDLE_DESC_st>() - 8usize];
    ["Offset of field: CUDA_EXTERNAL_MEMORY_HANDLE_DESC_st::type_"]
        [::std::mem::offset_of!(CUDA_EXTERNAL_MEMORY_HANDLE_DESC_st, type_) - 0usize];
    ["Offset of field: CUDA_EXTERNAL_MEMORY_HANDLE_DESC_st::handle"]
        [::std::mem::offset_of!(CUDA_EXTERNAL_MEMORY_HANDLE_DESC_st, handle) - 8usize];
    ["Offset of field: CUDA_EXTERNAL_MEMORY_HANDLE_DESC_st::size"]
        [::std::mem::offset_of!(CUDA_EXTERNAL_MEMORY_HANDLE_DESC_st, size) - 24usize];
    ["Offset of field: CUDA_EXTERNAL_MEMORY_HANDLE_DESC_st::flags"]
        [::std::mem::offset_of!(CUDA_EXTERNAL_MEMORY_HANDLE_DESC_st, flags) - 32usize];
    ["Offset of field: CUDA_EXTERNAL_MEMORY_HANDLE_DESC_st::reserved"]
        [::std::mem::offset_of!(CUDA_EXTERNAL_MEMORY_HANDLE_DESC_st, reserved) - 36usize];
};
#[doc = " External memory handle descriptor"]
pub type CUDA_EXTERNAL_MEMORY_HANDLE_DESC = CUDA_EXTERNAL_MEMORY_HANDLE_DESC_st;
#[doc = " External memory buffer descriptor"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CUDA_EXTERNAL_MEMORY_BUFFER_DESC_st {
    #[doc = " Offset into the memory object where the buffer's base is"]
    pub offset: ::std::os::raw::c_ulonglong,
    #[doc = " Size of the buffer"]
    pub size: ::std::os::raw::c_ulonglong,
    #[doc = " Flags reserved for future use. Must be zero."]
    pub flags: ::std::os::raw::c_uint,
    pub reserved: [::std::os::raw::c_uint; 16usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of CUDA_EXTERNAL_MEMORY_BUFFER_DESC_st"]
        [::std::mem::size_of::<CUDA_EXTERNAL_MEMORY_BUFFER_DESC_st>() - 88usize];
    ["Alignment of CUDA_EXTERNAL_MEMORY_BUFFER_DESC_st"]
        [::std::mem::align_of::<CUDA_EXTERNAL_MEMORY_BUFFER_DESC_st>() - 8usize];
    ["Offset of field: CUDA_EXTERNAL_MEMORY_BUFFER_DESC_st::offset"]
        [::std::mem::offset_of!(CUDA_EXTERNAL_MEMORY_BUFFER_DESC_st, offset) - 0usize];
    ["Offset of field: CUDA_EXTERNAL_MEMORY_BUFFER_DESC_st::size"]
        [::std::mem::offset_of!(CUDA_EXTERNAL_MEMORY_BUFFER_DESC_st, size) - 8usize];
    ["Offset of field: CUDA_EXTERNAL_MEMORY_BUFFER_DESC_st::flags"]
        [::std::mem::offset_of!(CUDA_EXTERNAL_MEMORY_BUFFER_DESC_st, flags) - 16usize];
    ["Offset of field: CUDA_EXTERNAL_MEMORY_BUFFER_DESC_st::reserved"]
        [::std::mem::offset_of!(CUDA_EXTERNAL_MEMORY_BUFFER_DESC_st, reserved) - 20usize];
};
#[doc = " External memory buffer descriptor"]
pub type CUDA_EXTERNAL_MEMORY_BUFFER_DESC = CUDA_EXTERNAL_MEMORY_BUFFER_DESC_st;
#[doc = " External memory mipmap descriptor"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CUDA_EXTERNAL_MEMORY_MIPMAPPED_ARRAY_DESC_st {
    #[doc = " Offset into the memory object where the base level of the\n mipmap chain is."]
    pub offset: ::std::os::raw::c_ulonglong,
    #[doc = " Format, dimension and type of base level of the mipmap chain"]
    pub arrayDesc: CUDA_ARRAY3D_DESCRIPTOR,
    #[doc = " Total number of levels in the mipmap chain"]
    pub numLevels: ::std::os::raw::c_uint,
    pub reserved: [::std::os::raw::c_uint; 16usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of CUDA_EXTERNAL_MEMORY_MIPMAPPED_ARRAY_DESC_st"]
        [::std::mem::size_of::<CUDA_EXTERNAL_MEMORY_MIPMAPPED_ARRAY_DESC_st>() - 120usize];
    ["Alignment of CUDA_EXTERNAL_MEMORY_MIPMAPPED_ARRAY_DESC_st"]
        [::std::mem::align_of::<CUDA_EXTERNAL_MEMORY_MIPMAPPED_ARRAY_DESC_st>() - 8usize];
    ["Offset of field: CUDA_EXTERNAL_MEMORY_MIPMAPPED_ARRAY_DESC_st::offset"]
        [::std::mem::offset_of!(CUDA_EXTERNAL_MEMORY_MIPMAPPED_ARRAY_DESC_st, offset) - 0usize];
    ["Offset of field: CUDA_EXTERNAL_MEMORY_MIPMAPPED_ARRAY_DESC_st::arrayDesc"]
        [::std::mem::offset_of!(CUDA_EXTERNAL_MEMORY_MIPMAPPED_ARRAY_DESC_st, arrayDesc) - 8usize];
    ["Offset of field: CUDA_EXTERNAL_MEMORY_MIPMAPPED_ARRAY_DESC_st::numLevels"]
        [::std::mem::offset_of!(CUDA_EXTERNAL_MEMORY_MIPMAPPED_ARRAY_DESC_st, numLevels) - 48usize];
    ["Offset of field: CUDA_EXTERNAL_MEMORY_MIPMAPPED_ARRAY_DESC_st::reserved"]
        [::std::mem::offset_of!(CUDA_EXTERNAL_MEMORY_MIPMAPPED_ARRAY_DESC_st, reserved) - 52usize];
};
#[doc = " External memory mipmap descriptor"]
pub type CUDA_EXTERNAL_MEMORY_MIPMAPPED_ARRAY_DESC = CUDA_EXTERNAL_MEMORY_MIPMAPPED_ARRAY_DESC_st;
pub mod CUexternalSemaphoreHandleType_enum {
    #[doc = " External semaphore handle types"]
    pub type Type = ::std::os::raw::c_uint;
    #[doc = " Handle is an opaque file descriptor"]
    pub const CU_EXTERNAL_SEMAPHORE_HANDLE_TYPE_OPAQUE_FD: Type = 1;
    #[doc = " Handle is an opaque shared NT handle"]
    pub const CU_EXTERNAL_SEMAPHORE_HANDLE_TYPE_OPAQUE_WIN32: Type = 2;
    #[doc = " Handle is an opaque, globally shared handle"]
    pub const CU_EXTERNAL_SEMAPHORE_HANDLE_TYPE_OPAQUE_WIN32_KMT: Type = 3;
    #[doc = " Handle is a shared NT handle referencing a D3D12 fence object"]
    pub const CU_EXTERNAL_SEMAPHORE_HANDLE_TYPE_D3D12_FENCE: Type = 4;
}
#[doc = " External semaphore handle types"]
pub use self::CUexternalSemaphoreHandleType_enum::Type as CUexternalSemaphoreHandleType;
#[doc = " External semaphore handle descriptor"]
#[repr(C)]
#[derive(Copy, Clone)]
pub struct CUDA_EXTERNAL_SEMAPHORE_HANDLE_DESC_st {
    #[doc = " Type of the handle"]
    pub type_: CUexternalSemaphoreHandleType,
    pub handle: CUDA_EXTERNAL_SEMAPHORE_HANDLE_DESC_st__bindgen_ty_1,
    #[doc = " Flags reserved for the future. Must be zero."]
    pub flags: ::std::os::raw::c_uint,
    pub reserved: [::std::os::raw::c_uint; 16usize],
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union CUDA_EXTERNAL_SEMAPHORE_HANDLE_DESC_st__bindgen_ty_1 {
    #[doc = " File descriptor referencing the semaphore object. Valid\n when type is\n ::CU_EXTERNAL_SEMAPHORE_HANDLE_TYPE_OPAQUE_FD"]
    pub fd: ::std::os::raw::c_int,
    pub win32: CUDA_EXTERNAL_SEMAPHORE_HANDLE_DESC_st__bindgen_ty_1__bindgen_ty_1,
}
#[doc = " Win32 handle referencing the semaphore object. Valid when\n type is one of the following:\n - ::CU_EXTERNAL_SEMAPHORE_HANDLE_TYPE_OPAQUE_WIN32\n - ::CU_EXTERNAL_SEMAPHORE_HANDLE_TYPE_OPAQUE_WIN32_KMT\n - ::CU_EXTERNAL_SEMAPHORE_HANDLE_TYPE_D3D12_FENCE\n Exactly one of 'handle' and 'name' must be non-NULL. If\n type is\n ::CU_EXTERNAL_SEMAPHORE_HANDLE_TYPE_OPAQUE_WIN32_KMT\n then 'name' must be NULL."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CUDA_EXTERNAL_SEMAPHORE_HANDLE_DESC_st__bindgen_ty_1__bindgen_ty_1 {
    #[doc = " Valid NT handle. Must be NULL if 'name' is non-NULL"]
    pub handle: *mut ::std::os::raw::c_void,
    #[doc = " Name of a valid synchronization primitive.\n Must be NULL if 'handle' is non-NULL."]
    pub name: *const ::std::os::raw::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of CUDA_EXTERNAL_SEMAPHORE_HANDLE_DESC_st__bindgen_ty_1__bindgen_ty_1"]
        [::std::mem::size_of::<CUDA_EXTERNAL_SEMAPHORE_HANDLE_DESC_st__bindgen_ty_1__bindgen_ty_1>(
        ) - 16usize];
    ["Alignment of CUDA_EXTERNAL_SEMAPHORE_HANDLE_DESC_st__bindgen_ty_1__bindgen_ty_1"]
        [::std::mem::align_of::<CUDA_EXTERNAL_SEMAPHORE_HANDLE_DESC_st__bindgen_ty_1__bindgen_ty_1>(
        ) - 8usize];
    ["Offset of field: CUDA_EXTERNAL_SEMAPHORE_HANDLE_DESC_st__bindgen_ty_1__bindgen_ty_1::handle"]
        [::std::mem::offset_of!(
            CUDA_EXTERNAL_SEMAPHORE_HANDLE_DESC_st__bindgen_ty_1__bindgen_ty_1,
            handle
        ) - 0usize];
    ["Offset of field: CUDA_EXTERNAL_SEMAPHORE_HANDLE_DESC_st__bindgen_ty_1__bindgen_ty_1::name"][::std::mem::offset_of!(
        CUDA_EXTERNAL_SEMAPHORE_HANDLE_DESC_st__bindgen_ty_1__bindgen_ty_1,
        name
    )
        - 8usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of CUDA_EXTERNAL_SEMAPHORE_HANDLE_DESC_st__bindgen_ty_1"]
        [::std::mem::size_of::<CUDA_EXTERNAL_SEMAPHORE_HANDLE_DESC_st__bindgen_ty_1>() - 16usize];
    ["Alignment of CUDA_EXTERNAL_SEMAPHORE_HANDLE_DESC_st__bindgen_ty_1"]
        [::std::mem::align_of::<CUDA_EXTERNAL_SEMAPHORE_HANDLE_DESC_st__bindgen_ty_1>() - 8usize];
    ["Offset of field: CUDA_EXTERNAL_SEMAPHORE_HANDLE_DESC_st__bindgen_ty_1::fd"]
        [::std::mem::offset_of!(CUDA_EXTERNAL_SEMAPHORE_HANDLE_DESC_st__bindgen_ty_1, fd) - 0usize];
    ["Offset of field: CUDA_EXTERNAL_SEMAPHORE_HANDLE_DESC_st__bindgen_ty_1::win32"][::std::mem::offset_of!(
        CUDA_EXTERNAL_SEMAPHORE_HANDLE_DESC_st__bindgen_ty_1,
        win32
    ) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of CUDA_EXTERNAL_SEMAPHORE_HANDLE_DESC_st"]
        [::std::mem::size_of::<CUDA_EXTERNAL_SEMAPHORE_HANDLE_DESC_st>() - 96usize];
    ["Alignment of CUDA_EXTERNAL_SEMAPHORE_HANDLE_DESC_st"]
        [::std::mem::align_of::<CUDA_EXTERNAL_SEMAPHORE_HANDLE_DESC_st>() - 8usize];
    ["Offset of field: CUDA_EXTERNAL_SEMAPHORE_HANDLE_DESC_st::type_"]
        [::std::mem::offset_of!(CUDA_EXTERNAL_SEMAPHORE_HANDLE_DESC_st, type_) - 0usize];
    ["Offset of field: CUDA_EXTERNAL_SEMAPHORE_HANDLE_DESC_st::handle"]
        [::std::mem::offset_of!(CUDA_EXTERNAL_SEMAPHORE_HANDLE_DESC_st, handle) - 8usize];
    ["Offset of field: CUDA_EXTERNAL_SEMAPHORE_HANDLE_DESC_st::flags"]
        [::std::mem::offset_of!(CUDA_EXTERNAL_SEMAPHORE_HANDLE_DESC_st, flags) - 24usize];
    ["Offset of field: CUDA_EXTERNAL_SEMAPHORE_HANDLE_DESC_st::reserved"]
        [::std::mem::offset_of!(CUDA_EXTERNAL_SEMAPHORE_HANDLE_DESC_st, reserved) - 28usize];
};
#[doc = " External semaphore handle descriptor"]
pub type CUDA_EXTERNAL_SEMAPHORE_HANDLE_DESC = CUDA_EXTERNAL_SEMAPHORE_HANDLE_DESC_st;
#[doc = " External semaphore signal parameters"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CUDA_EXTERNAL_SEMAPHORE_SIGNAL_PARAMS_st {
    pub params: CUDA_EXTERNAL_SEMAPHORE_SIGNAL_PARAMS_st__bindgen_ty_1,
    #[doc = " Flags reserved for the future. Must be zero."]
    pub flags: ::std::os::raw::c_uint,
    pub reserved: [::std::os::raw::c_uint; 16usize],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CUDA_EXTERNAL_SEMAPHORE_SIGNAL_PARAMS_st__bindgen_ty_1 {
    pub fence: CUDA_EXTERNAL_SEMAPHORE_SIGNAL_PARAMS_st__bindgen_ty_1__bindgen_ty_1,
    pub reserved: [::std::os::raw::c_uint; 16usize],
}
#[doc = " Parameters for fence objects"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CUDA_EXTERNAL_SEMAPHORE_SIGNAL_PARAMS_st__bindgen_ty_1__bindgen_ty_1 {
    #[doc = " Value of fence to be signaled"]
    pub value: ::std::os::raw::c_ulonglong,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of CUDA_EXTERNAL_SEMAPHORE_SIGNAL_PARAMS_st__bindgen_ty_1__bindgen_ty_1"]
        [::std::mem::size_of::<CUDA_EXTERNAL_SEMAPHORE_SIGNAL_PARAMS_st__bindgen_ty_1__bindgen_ty_1>(
        ) - 8usize];
    ["Alignment of CUDA_EXTERNAL_SEMAPHORE_SIGNAL_PARAMS_st__bindgen_ty_1__bindgen_ty_1"]
        [::std::mem::align_of::<
            CUDA_EXTERNAL_SEMAPHORE_SIGNAL_PARAMS_st__bindgen_ty_1__bindgen_ty_1,
        >() - 8usize];
    [
        "Offset of field: CUDA_EXTERNAL_SEMAPHORE_SIGNAL_PARAMS_st__bindgen_ty_1__bindgen_ty_1::value",
    ][::std::mem::offset_of!(
        CUDA_EXTERNAL_SEMAPHORE_SIGNAL_PARAMS_st__bindgen_ty_1__bindgen_ty_1,
        value
    ) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of CUDA_EXTERNAL_SEMAPHORE_SIGNAL_PARAMS_st__bindgen_ty_1"]
        [::std::mem::size_of::<CUDA_EXTERNAL_SEMAPHORE_SIGNAL_PARAMS_st__bindgen_ty_1>() - 72usize];
    ["Alignment of CUDA_EXTERNAL_SEMAPHORE_SIGNAL_PARAMS_st__bindgen_ty_1"]
        [::std::mem::align_of::<CUDA_EXTERNAL_SEMAPHORE_SIGNAL_PARAMS_st__bindgen_ty_1>() - 8usize];
    ["Offset of field: CUDA_EXTERNAL_SEMAPHORE_SIGNAL_PARAMS_st__bindgen_ty_1::fence"][::std::mem::offset_of!(
        CUDA_EXTERNAL_SEMAPHORE_SIGNAL_PARAMS_st__bindgen_ty_1,
        fence
    ) - 0usize];
    ["Offset of field: CUDA_EXTERNAL_SEMAPHORE_SIGNAL_PARAMS_st__bindgen_ty_1::reserved"][::std::mem::offset_of!(
        CUDA_EXTERNAL_SEMAPHORE_SIGNAL_PARAMS_st__bindgen_ty_1,
        reserved
    )
        - 8usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of CUDA_EXTERNAL_SEMAPHORE_SIGNAL_PARAMS_st"]
        [::std::mem::size_of::<CUDA_EXTERNAL_SEMAPHORE_SIGNAL_PARAMS_st>() - 144usize];
    ["Alignment of CUDA_EXTERNAL_SEMAPHORE_SIGNAL_PARAMS_st"]
        [::std::mem::align_of::<CUDA_EXTERNAL_SEMAPHORE_SIGNAL_PARAMS_st>() - 8usize];
    ["Offset of field: CUDA_EXTERNAL_SEMAPHORE_SIGNAL_PARAMS_st::params"]
        [::std::mem::offset_of!(CUDA_EXTERNAL_SEMAPHORE_SIGNAL_PARAMS_st, params) - 0usize];
    ["Offset of field: CUDA_EXTERNAL_SEMAPHORE_SIGNAL_PARAMS_st::flags"]
        [::std::mem::offset_of!(CUDA_EXTERNAL_SEMAPHORE_SIGNAL_PARAMS_st, flags) - 72usize];
    ["Offset of field: CUDA_EXTERNAL_SEMAPHORE_SIGNAL_PARAMS_st::reserved"]
        [::std::mem::offset_of!(CUDA_EXTERNAL_SEMAPHORE_SIGNAL_PARAMS_st, reserved) - 76usize];
};
#[doc = " External semaphore signal parameters"]
pub type CUDA_EXTERNAL_SEMAPHORE_SIGNAL_PARAMS = CUDA_EXTERNAL_SEMAPHORE_SIGNAL_PARAMS_st;
#[doc = " External semaphore wait parameters"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CUDA_EXTERNAL_SEMAPHORE_WAIT_PARAMS_st {
    pub params: CUDA_EXTERNAL_SEMAPHORE_WAIT_PARAMS_st__bindgen_ty_1,
    #[doc = " Flags reserved for the future. Must be zero."]
    pub flags: ::std::os::raw::c_uint,
    pub reserved: [::std::os::raw::c_uint; 16usize],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CUDA_EXTERNAL_SEMAPHORE_WAIT_PARAMS_st__bindgen_ty_1 {
    pub fence: CUDA_EXTERNAL_SEMAPHORE_WAIT_PARAMS_st__bindgen_ty_1__bindgen_ty_1,
    pub reserved: [::std::os::raw::c_uint; 16usize],
}
#[doc = " Parameters for fence objects"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CUDA_EXTERNAL_SEMAPHORE_WAIT_PARAMS_st__bindgen_ty_1__bindgen_ty_1 {
    #[doc = " Value of fence to be waited on"]
    pub value: ::std::os::raw::c_ulonglong,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of CUDA_EXTERNAL_SEMAPHORE_WAIT_PARAMS_st__bindgen_ty_1__bindgen_ty_1"]
        [::std::mem::size_of::<CUDA_EXTERNAL_SEMAPHORE_WAIT_PARAMS_st__bindgen_ty_1__bindgen_ty_1>(
        ) - 8usize];
    ["Alignment of CUDA_EXTERNAL_SEMAPHORE_WAIT_PARAMS_st__bindgen_ty_1__bindgen_ty_1"]
        [::std::mem::align_of::<CUDA_EXTERNAL_SEMAPHORE_WAIT_PARAMS_st__bindgen_ty_1__bindgen_ty_1>(
        ) - 8usize];
    ["Offset of field: CUDA_EXTERNAL_SEMAPHORE_WAIT_PARAMS_st__bindgen_ty_1__bindgen_ty_1::value"]
        [::std::mem::offset_of!(
            CUDA_EXTERNAL_SEMAPHORE_WAIT_PARAMS_st__bindgen_ty_1__bindgen_ty_1,
            value
        ) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of CUDA_EXTERNAL_SEMAPHORE_WAIT_PARAMS_st__bindgen_ty_1"]
        [::std::mem::size_of::<CUDA_EXTERNAL_SEMAPHORE_WAIT_PARAMS_st__bindgen_ty_1>() - 72usize];
    ["Alignment of CUDA_EXTERNAL_SEMAPHORE_WAIT_PARAMS_st__bindgen_ty_1"]
        [::std::mem::align_of::<CUDA_EXTERNAL_SEMAPHORE_WAIT_PARAMS_st__bindgen_ty_1>() - 8usize];
    ["Offset of field: CUDA_EXTERNAL_SEMAPHORE_WAIT_PARAMS_st__bindgen_ty_1::fence"][::std::mem::offset_of!(
        CUDA_EXTERNAL_SEMAPHORE_WAIT_PARAMS_st__bindgen_ty_1,
        fence
    ) - 0usize];
    ["Offset of field: CUDA_EXTERNAL_SEMAPHORE_WAIT_PARAMS_st__bindgen_ty_1::reserved"][::std::mem::offset_of!(
        CUDA_EXTERNAL_SEMAPHORE_WAIT_PARAMS_st__bindgen_ty_1,
        reserved
    ) - 8usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of CUDA_EXTERNAL_SEMAPHORE_WAIT_PARAMS_st"]
        [::std::mem::size_of::<CUDA_EXTERNAL_SEMAPHORE_WAIT_PARAMS_st>() - 144usize];
    ["Alignment of CUDA_EXTERNAL_SEMAPHORE_WAIT_PARAMS_st"]
        [::std::mem::align_of::<CUDA_EXTERNAL_SEMAPHORE_WAIT_PARAMS_st>() - 8usize];
    ["Offset of field: CUDA_EXTERNAL_SEMAPHORE_WAIT_PARAMS_st::params"]
        [::std::mem::offset_of!(CUDA_EXTERNAL_SEMAPHORE_WAIT_PARAMS_st, params) - 0usize];
    ["Offset of field: CUDA_EXTERNAL_SEMAPHORE_WAIT_PARAMS_st::flags"]
        [::std::mem::offset_of!(CUDA_EXTERNAL_SEMAPHORE_WAIT_PARAMS_st, flags) - 72usize];
    ["Offset of field: CUDA_EXTERNAL_SEMAPHORE_WAIT_PARAMS_st::reserved"]
        [::std::mem::offset_of!(CUDA_EXTERNAL_SEMAPHORE_WAIT_PARAMS_st, reserved) - 76usize];
};
#[doc = " External semaphore wait parameters"]
pub type CUDA_EXTERNAL_SEMAPHORE_WAIT_PARAMS = CUDA_EXTERNAL_SEMAPHORE_WAIT_PARAMS_st;
unsafe extern "C" {
    #[doc = " \\brief Gets the string description of an error code\n\n Sets \\p *pStr to the address of a NULL-terminated string description\n of the error code \\p error.\n If the error code is not recognized, ::CUDA_ERROR_INVALID_VALUE\n will be returned and \\p *pStr will be set to the NULL address.\n\n \\param error - Error code to convert to string\n \\param pStr - Address of the string pointer.\n\n \\return\n ::CUDA_SUCCESS,\n ::CUDA_ERROR_INVALID_VALUE\n\n \\sa\n ::CUresult,\n ::cudaGetErrorString"]
    pub fn cuGetErrorString(error: CUresult, pStr: *mut *const ::std::os::raw::c_char) -> CUresult;
}
unsafe extern "C" {
